export const events = [
  {
    id: "f96fc5b4-1d29-469b-98f2-d3a231721870",
    time: "1 млн р. до н. е.",
    events: "Палеоліт. Королевська стоянка первісної людини у Закарпатті",
    eventsMarkup:
      '<b><a href="/wiki/%D0%9F%D0%B0%D0%BB%D0%B5%D0%BE%D0%BB%D1%96%D1%82" title="Палеоліт">Палеоліт</a></b>. <a href="/wiki/%D0%9A%D0%BE%D1%80%D0%BE%D0%BB%D0%B5%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D1%81%D1%82%D0%BE%D1%8F%D0%BD%D0%BA%D0%B0" title="Королевська стоянка">Королевська стоянка</a> первісної людини у <a href="/wiki/%D0%97%D0%B0%D0%BA%D0%B0%D1%80%D0%BF%D0%B0%D1%82%D1%82%D1%8F" title="Закарпаття">Закарпатті</a>\n',
    eventIndex: 0,
    createdAt: "2024-01-06T17:36:32.177Z",
  },
  {
    id: "9d939325-a318-4195-8aab-062ace265b5a",
    time: "300 тис.р.до н. е.",
    events:
      "Датування стоянок людини на Дністрі (Сокіл), Дніпрі (Круглик), Сіверському Донці (Ізюм)",
    eventsMarkup:
      'Датування стоянок людини на <a href="/wiki/%D0%94%D0%BD%D1%96%D1%81%D1%82%D0%B5%D1%80" title="Дністер">Дністрі</a> (Сокіл), <a href="/wiki/%D0%94%D0%BD%D1%96%D0%BF%D1%80%D0%BE_(%D1%80%D1%96%D1%87%D0%BA%D0%B0)" class="mw-redirect" title="Дніпро (річка)">Дніпрі</a> (Круглик), <a href="/wiki/%D0%A1%D1%96%D0%B2%D0%B5%D1%80%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%94%D0%BE%D0%BD%D0%B5%D1%86%D1%8C" title="Сіверський Донець">Сіверському Донці</a> (<a href="/wiki/%D0%86%D0%B7%D1%8E%D0%BC" title="Ізюм">Ізюм</a>)\n',
    eventIndex: 1,
    createdAt: "2024-01-06T17:36:32.177Z",
  },
  {
    id: "6ef3297f-3a73-4d16-a088-22ea9dcfdc55",
    time: "300—30 тис. р. до н. е.",
    events: "Середній палеоліт (мустьє) на території України: понад 80 стоянок",
    eventsMarkup:
      '<a href="/wiki/%D0%A1%D0%B5%D1%80%D0%B5%D0%B4%D0%BD%D1%96%D0%B9_%D0%BF%D0%B0%D0%BB%D0%B5%D0%BE%D0%BB%D1%96%D1%82" title="Середній палеоліт">Середній палеоліт</a> (<a href="/wiki/%D0%9C%D1%83%D1%81%D1%82%D1%8C%D1%94" class="mw-redirect" title="Мустьє">мустьє</a>) на території України: понад 80 стоянок\n',
    eventIndex: 2,
    createdAt: "2024-01-06T17:36:32.177Z",
  },
  {
    id: "574291f1-ee97-4db4-8ff2-2c5e10a23307",
    time: "250—170 (100) тис.р. до .н. е.",
    events:
      "Дніпровське (максимальне) зледеніння: крижаний панцир по Дніпру просунувся до порогів.",
    eventsMarkup:
      'Дніпровське (максимальне) <a href="/wiki/%D0%97%D0%BB%D0%B5%D0%B4%D0%B5%D0%BD%D1%96%D0%BD%D0%BD%D1%8F" title="Зледеніння">зледеніння</a>: крижаний панцир по Дніпру просунувся до <a href="/wiki/%D0%94%D0%BD%D1%96%D0%BF%D1%80%D0%BE%D0%B2%D1%96_%D0%BF%D0%BE%D1%80%D0%BE%D0%B3%D0%B8" title="Дніпрові пороги">порогів</a>.\n',
    eventIndex: 3,
    createdAt: "2024-01-06T17:36:32.177Z",
  },
  {
    id: "7d0f0366-4918-4610-8bfe-97ef2faf2c83",
    time: "75—10 тис. р. до н. е.",
    events: "Останнє зледеніння у Європі: льодовик просунувся до Полісся",
    eventsMarkup:
      'Останнє зледеніння у Європі: льодовик просунувся до <a href="/wiki/%D0%9F%D0%BE%D0%BB%D1%96%D1%81%D1%81%D1%8F" title="Полісся">Полісся</a>\n',
    eventIndex: 4,
    createdAt: "2024-01-06T17:36:32.177Z",
  },
  {
    id: "6d4472ae-8bed-4e9b-a17d-071c1ac935b8",
    time: "35—9 тис.р. до н. е.",
    events:
      "Верхній палеоліт на території України; відомо декілька окремих археологічних культур (Межиріцька, Анетівська, Спіцинська, Молодовська, Бринзенська, Липська, Мізинська). Міграції первісних мисливців з заходу і півдня. Найгустіше населення — на Дністрі, біля Дніпрових порогів і у південному Криму.",
    eventsMarkup:
      '<figure typeof="mw:File/Thumb"><a href="/wiki/%D0%A4%D0%B0%D0%B9%D0%BB:012_Ukraine_paleolit_2.jpg" class="mw-file-description"><img src="//upload.wikimedia.org/wikipedia/commons/thumb/8/83/012_Ukraine_paleolit_2.jpg/100px-012_Ukraine_paleolit_2.jpg" decoding="async" width="100" height="73" class="mw-file-element" srcset="//upload.wikimedia.org/wikipedia/commons/thumb/8/83/012_Ukraine_paleolit_2.jpg/150px-012_Ukraine_paleolit_2.jpg 1.5x, //upload.wikimedia.org/wikipedia/commons/thumb/8/83/012_Ukraine_paleolit_2.jpg/200px-012_Ukraine_paleolit_2.jpg 2x" data-file-width="1013" data-file-height="742"></a><figcaption></figcaption></figure> <a href="/wiki/%D0%92%D0%B5%D1%80%D1%85%D0%BD%D1%96%D0%B9_%D0%BF%D0%B0%D0%BB%D0%B5%D0%BE%D0%BB%D1%96%D1%82" class="mw-redirect" title="Верхній палеоліт">Верхній палеоліт</a> на території України; відомо декілька окремих археологічних культур (<a href="/wiki/%D0%9C%D0%B5%D0%B6%D0%B8%D1%80%D1%96%D1%86%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Межиріцька культура">Межиріцька</a>, <a href="/wiki/%D0%90%D0%BD%D0%B5%D1%82%D1%96%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Анетівська культура">Анетівська</a>, <a href="/wiki/%D0%A1%D0%BF%D1%96%D1%86%D0%B8%D0%BD%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" class="mw-redirect" title="Спіцинська культура">Спіцинська</a>, <a href="/wiki/%D0%9C%D0%BE%D0%BB%D0%BE%D0%B4%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Молодовська культура">Молодовська</a>, <a href="/w/index.php?title=%D0%91%D1%80%D0%B8%D0%BD%D0%B7%D0%B5%D0%BD%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0&amp;action=edit&amp;redlink=1" class="new" title="Бринзенська культура (ще не написана)">Бринзенська</a>, <a href="/wiki/%D0%9B%D0%B8%D0%BF%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Липська культура">Липська</a>, <a href="/wiki/%D0%9C%D1%96%D0%B7%D0%B8%D0%BD%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Мізинська культура">Мізинська</a>). Міграції первісних мисливців з заходу і півдня. Найгустіше населення&nbsp;— на Дністрі, біля Дніпрових порогів і у південному <a href="/wiki/%D0%9A%D1%80%D0%B8%D0%BC" title="Крим">Криму</a>.\n',
    eventIndex: 5,
    createdAt: "2024-01-06T17:36:32.177Z",
  },
  {
    id: "216935f3-48f2-42e6-9937-2ed7ec304c18",
    time: "9—6 тис. р. до н. е.",
    events:
      "Мезоліт на території України. Кукрецька, Кудлаївська, Гребениківська, Донецька, Рудоострівська, Пісочнорівська та інші археологічні культури.",
    eventsMarkup:
      '<b><a href="/wiki/%D0%9C%D0%B5%D0%B7%D0%BE%D0%BB%D1%96%D1%82" title="Мезоліт">Мезоліт</a> на території України</b>. <a href="/wiki/%D0%9A%D1%83%D0%BA%D1%80%D0%B5%D1%86%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Кукрецька культура">Кукрецька</a>, <a href="/wiki/%D0%9A%D1%83%D0%B4%D0%BB%D0%B0%D1%97%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Кудлаївська культура">Кудлаївська</a>, <a href="/wiki/%D0%93%D1%80%D0%B5%D0%B1%D0%B5%D0%BD%D0%B8%D0%BA%D1%96%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Гребениківська культура">Гребениківська</a>, <a href="/wiki/%D0%94%D0%BE%D0%BD%D0%B5%D1%86%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Донецька культура">Донецька</a>, <a href="/wiki/%D0%A0%D1%83%D0%B4%D0%BE%D0%BE%D1%81%D1%82%D1%80%D1%96%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" class="mw-redirect" title="Рудоострівська культура">Рудоострівська</a>, <a href="/wiki/%D0%9F%D1%96%D1%81%D0%BE%D1%87%D0%BD%D0%BE%D1%80%D1%96%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" class="mw-redirect" title="Пісочнорівська культура">Пісочнорівська</a> та інші археологічні культури.\n',
    eventIndex: 6,
    createdAt: "2024-01-06T17:36:32.177Z",
  },
  {
    id: "b6598928-8d3a-42db-863a-484310697e0a",
    time: "6—4 тис. до н. е.",
    events:
      "Неоліт на території України. Буго-Дністровська, Сурська культура, Дніпро-Донецька, Азово-Дніпровська та ін. культури.",
    eventsMarkup:
      '\n<p><b><a href="/wiki/%D0%9D%D0%B5%D0%BE%D0%BB%D1%96%D1%82" title="Неоліт">Неоліт</a> на території України</b>. <a href="/wiki/%D0%91%D1%83%D0%B3%D0%BE-%D0%94%D0%BD%D1%96%D1%81%D1%82%D1%80%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" class="mw-redirect" title="Буго-Дністровська культура">Буго-Дністровська</a>, <a href="/wiki/%D0%A1%D1%83%D1%80%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" class="mw-redirect" title="Сурська культура">Сурська культура</a>, <a href="/wiki/%D0%94%D0%BD%D1%96%D0%BF%D1%80%D0%BE-%D0%94%D0%BE%D0%BD%D0%B5%D1%86%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Дніпро-Донецька культура">Дніпро-Донецька</a>, <a href="/wiki/%D0%90%D0%B7%D0%BE%D0%B2%D0%BE-%D0%94%D0%BD%D1%96%D0%BF%D1%80%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" class="mw-redirect" title="Азово-Дніпровська культура">Азово-Дніпровська</a> та ін. культури.\n</p>\n',
    eventIndex: 7,
    createdAt: "2024-01-06T17:36:32.177Z",
  },
  {
    id: "d26ca3f7-3589-4b6b-b3f3-cee7b141d891",
    time: "4—3 тис. до н. е.",
    events:
      "Енеоліт на території України. Трипільська, Середньостогівська та ін. культури. Будівництво трипільцями перших міст, з населенням до 46 000 мешканців.",
    eventsMarkup:
      '\n<p><b><a href="/wiki/%D0%95%D0%BD%D0%B5%D0%BE%D0%BB%D1%96%D1%82" title="Енеоліт">Енеоліт</a> на території України</b>. <a href="/wiki/%D0%A2%D1%80%D0%B8%D0%BF%D1%96%D0%BB%D1%8C%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Трипільська культура">Трипільська</a>, <a href="/wiki/%D0%A1%D0%B5%D1%80%D0%B5%D0%B4%D0%BD%D1%8C%D0%BE%D1%81%D1%82%D0%BE%D0%B3%D1%96%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Середньостогівська культура">Середньостогівська</a> та ін. культури. Будівництво трипільцями <a href="/wiki/%D0%A2%D1%80%D0%B8%D0%BF%D1%96%D0%BB%D1%8C%D1%81%D1%8C%D0%BA%D1%96_%D0%BC%D1%96%D1%81%D1%82%D0%B0" title="Трипільські міста">перших міст</a>, з населенням до 46 000 мешканців.\n</p>\n',
    eventIndex: 8,
    createdAt: "2024-01-06T17:36:32.177Z",
  },
  {
    id: "5df9feef-9e7e-40b4-bd23-55b37d616f43",
    time: "3—1 тис. до н. е.",
    events:
      "Бронзова доба. Ямна культура, Катакомбна культура, Кемі-обінська, Східнотшинецька, Комарівська, Зрубна, Сабатинівська, Білогрудівська, Чорноліська та ін. культури.",
    eventsMarkup:
      '\n<p><b>Бронзова доба</b>. <a href="/wiki/%D0%AF%D0%BC%D0%BD%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Ямна культура">Ямна культура</a>, <a href="/wiki/%D0%9A%D0%B0%D1%82%D0%B0%D0%BA%D0%BE%D0%BC%D0%B1%D0%BD%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Катакомбна культура">Катакомбна культура</a>, <a href="/wiki/%D0%9A%D0%B5%D0%BC%D1%96-%D0%BE%D0%B1%D1%96%D0%BD%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" class="mw-redirect" title="Кемі-обінська культура">Кемі-обінська</a>, <a href="/w/index.php?title=%D0%A1%D1%85%D1%96%D0%B4%D0%BD%D0%BE%D1%82%D1%88%D0%B8%D0%BD%D0%B5%D1%86%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0&amp;action=edit&amp;redlink=1" class="new" title="Східнотшинецька культура (ще не написана)">Східнотшинецька</a>, <a href="/wiki/%D0%9A%D0%BE%D0%BC%D0%B0%D1%80%D1%96%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Комарівська культура">Комарівська</a>, <a href="/wiki/%D0%97%D1%80%D1%83%D0%B1%D0%BD%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" class="mw-redirect" title="Зрубна культура">Зрубна</a>, <a href="/wiki/%D0%A1%D0%B0%D0%B1%D0%B0%D1%82%D0%B8%D0%BD%D1%96%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Сабатинівська культура">Сабатинівська</a>, <a href="/wiki/%D0%91%D1%96%D0%BB%D0%BE%D0%B3%D1%80%D1%83%D0%B4%D1%96%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Білогрудівська культура">Білогрудівська</a>, <a href="/wiki/%D0%A7%D0%BE%D1%80%D0%BD%D0%BE%D0%BB%D1%96%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Чорноліська культура">Чорноліська</a> та ін. культури.\n</p>\n',
    eventIndex: 9,
    createdAt: "2024-01-06T17:36:32.177Z",
  },
  {
    id: "d02f1fc9-df1f-4fe4-a044-81dee76232d4",
    time: "1100—200 рр. до н. е.",
    events:
      "Культури залізної доби на території України: Зарубинецька культура, Кизил-Кобінська, Лужицька культура, Скіфська, Сарматська, Юхнівська та ін. археологічні культури залізної доби",
    eventsMarkup:
      '\n<p>Культури <b><a href="/wiki/%D0%97%D0%B0%D0%BB%D1%96%D0%B7%D0%BD%D0%B0_%D0%B4%D0%BE%D0%B1%D0%B0" title="Залізна доба">залізної доби</a></b> на території України: <a href="/wiki/%D0%97%D0%B0%D1%80%D1%83%D0%B1%D0%B8%D0%BD%D0%B5%D1%86%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Зарубинецька культура">Зарубинецька культура</a>, <a href="/w/index.php?title=%D0%9A%D0%B8%D0%B7%D0%B8%D0%BB-%D0%9A%D0%BE%D0%B1%D1%96%D0%BD%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0&amp;action=edit&amp;redlink=1" class="new" title="Кизил-Кобінська культура (ще не написана)">Кизил-Кобінська</a>, <a href="/wiki/%D0%9B%D1%83%D0%B6%D0%B8%D1%86%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Лужицька культура">Лужицька культура</a>, <a href="/wiki/%D0%A1%D0%BA%D1%96%D1%84%D0%B8" title="Скіфи">Скіфська</a>, <a href="/wiki/%D0%A1%D0%B0%D1%80%D0%BC%D0%B0%D1%82%D0%B8" title="Сармати">Сарматська</a>, <a href="/wiki/%D0%AE%D1%85%D0%BD%D1%96%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Юхнівська культура">Юхнівська</a> та ін. археологічні культури залізної доби\n</p>\n',
    eventIndex: 10,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "d8c766bd-ac7a-431b-9724-7a0378c0a387",
    time: "1250—700 рр. до н. е.",
    events:
      "Кімерійці у Північному Причорномор'ї, таври у Криму. Заснування близько 1250 року до н. е. у гирлі Інгулу міста кімерійців.\nМісто людей Кімерійських",
    eventsMarkup:
      '<b><a href="/wiki/%D0%9A%D1%96%D0%BC%D0%B5%D1%80%D1%96%D0%B9%D1%86%D1%96" title="Кімерійці">Кімерійці</a></b> у Північному Причорномор\'ї, <a href="/wiki/%D0%A2%D0%B0%D0%B2%D1%80%D0%B8_(%D0%BF%D0%BB%D0%B5%D0%BC%27%D1%8F)" class="mw-redirect" title="Таври (плем\'я)">таври</a> у Криму. Заснування близько 1250 року до н.&nbsp;е.  у гирлі <a href="/wiki/%D0%86%D0%BD%D0%B3%D1%83%D0%BB" title="Інгул">Інгулу</a> <a href="/wiki/%D0%9C%D1%96%D1%81%D1%82%D0%BE_%D0%BB%D1%8E%D0%B4%D0%B5%D0%B9_%D0%BA%D1%96%D0%BC%D0%B5%D1%80%D1%96%D0%B9%D1%81%D1%8C%D0%BA%D0%B8%D1%85" title="Місто людей кімерійських">міста кімерійців</a>. <figure typeof="mw:File/Thumb"><a href="/wiki/%D0%A4%D0%B0%D0%B9%D0%BB:%D0%A0%D0%B5%D0%BA%D0%BE%D0%BD%D1%81%D1%82%D1%80%D1%83%D0%BA%D1%86%D1%96%D1%8F_%D0%9A%D1%96%D0%BC%D0%B5%D1%80%D0%BE%D0%BF%D0%BE%D0%BB%D1%96%D1%81%D1%83.png" class="mw-file-description"><img src="//upload.wikimedia.org/wikipedia/uk/thumb/5/5e/%D0%A0%D0%B5%D0%BA%D0%BE%D0%BD%D1%81%D1%82%D1%80%D1%83%D0%BA%D1%86%D1%96%D1%8F_%D0%9A%D1%96%D0%BC%D0%B5%D1%80%D0%BE%D0%BF%D0%BE%D0%BB%D1%96%D1%81%D1%83.png/100px-%D0%A0%D0%B5%D0%BA%D0%BE%D0%BD%D1%81%D1%82%D1%80%D1%83%D0%BA%D1%86%D1%96%D1%8F_%D0%9A%D1%96%D0%BC%D0%B5%D1%80%D0%BE%D0%BF%D0%BE%D0%BB%D1%96%D1%81%D1%83.png" decoding="async" width="100" height="54" class="mw-file-element" srcset="//upload.wikimedia.org/wikipedia/uk/thumb/5/5e/%D0%A0%D0%B5%D0%BA%D0%BE%D0%BD%D1%81%D1%82%D1%80%D1%83%D0%BA%D1%86%D1%96%D1%8F_%D0%9A%D1%96%D0%BC%D0%B5%D1%80%D0%BE%D0%BF%D0%BE%D0%BB%D1%96%D1%81%D1%83.png/150px-%D0%A0%D0%B5%D0%BA%D0%BE%D0%BD%D1%81%D1%82%D1%80%D1%83%D0%BA%D1%86%D1%96%D1%8F_%D0%9A%D1%96%D0%BC%D0%B5%D1%80%D0%BE%D0%BF%D0%BE%D0%BB%D1%96%D1%81%D1%83.png 1.5x, //upload.wikimedia.org/wikipedia/uk/thumb/5/5e/%D0%A0%D0%B5%D0%BA%D0%BE%D0%BD%D1%81%D1%82%D1%80%D1%83%D0%BA%D1%86%D1%96%D1%8F_%D0%9A%D1%96%D0%BC%D0%B5%D1%80%D0%BE%D0%BF%D0%BE%D0%BB%D1%96%D1%81%D1%83.png/200px-%D0%A0%D0%B5%D0%BA%D0%BE%D0%BD%D1%81%D1%82%D1%80%D1%83%D0%BA%D1%86%D1%96%D1%8F_%D0%9A%D1%96%D0%BC%D0%B5%D1%80%D0%BE%D0%BF%D0%BE%D0%BB%D1%96%D1%81%D1%83.png 2x" data-file-width="1024" data-file-height="548"></a><figcaption>Місто людей Кімерійських</figcaption></figure>\n',
    eventIndex: 11,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "73b9303b-f904-46fe-890c-dd4ba3ffb670",
    time: "700—300 рр. до н. е.",
    events:
      "Скіфи у Північному Причорномор'ї. Ймовірно, їхня «столиця» — Метрополь — нині Кам'янське городище біля сучасного Енергодара на Дніпрі. відомі також їх величезні городища на Полтавщині (Більське городище — Гелон), Поділлі, Київщині.",
    eventsMarkup:
      '\n<p><b><a href="/wiki/%D0%A1%D0%BA%D1%96%D1%84%D0%B8" title="Скіфи">Скіфи</a></b> у Північному Причорномор\'ї. Ймовірно, їхня «столиця»&nbsp;— Метрополь&nbsp;— нині <a href="/wiki/%D0%9A%D0%B0%D0%BC%27%D1%8F%D0%BD%D1%81%D1%8C%D0%BA%D0%B5_%D0%B3%D0%BE%D1%80%D0%BE%D0%B4%D0%B8%D1%89%D0%B5" title="Кам\'янське городище">Кам\'янське городище</a> біля сучасного <a href="/wiki/%D0%95%D0%BD%D0%B5%D1%80%D0%B3%D0%BE%D0%B4%D0%B0%D1%80" title="Енергодар">Енергодара</a> на Дніпрі. відомі також їх величезні городища на Полтавщині (<a href="/wiki/%D0%91%D1%96%D0%BB%D1%8C%D1%81%D1%8C%D0%BA%D0%B5_%D0%B3%D0%BE%D1%80%D0%BE%D0%B4%D0%B8%D1%89%D0%B5" title="Більське городище">Більське городище</a>&nbsp;— <a href="/wiki/%D0%93%D0%B5%D0%BB%D0%BE%D0%BD" title="Гелон">Гелон</a>), Поділлі, Київщині.\n</p>\n',
    eventIndex: 12,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "8bc89273-7eb9-4579-a74f-272e2ba9c128",
    time: "647 до н.е.",
    events:
      "Заснування 1-ї грецької колонії у Північному Причорномор'ї — Борисфеніди у гирлі Дніпра.",
    eventsMarkup:
      'Заснування 1-ї <a href="/wiki/%D0%94%D0%B0%D0%B2%D0%BD%D1%8C%D0%BE%D0%B3%D1%80%D0%B5%D1%86%D1%8C%D0%BA%D1%96_%D0%BC%D1%96%D1%81%D1%82%D0%B0_%D0%9F%D1%96%D0%B2%D0%BD%D1%96%D1%87%D0%BD%D0%BE%D0%B3%D0%BE_%D0%9F%D1%80%D0%B8%D1%87%D0%BE%D1%80%D0%BD%D0%BE%D0%BC%D0%BE%D1%80%27%D1%8F" class="mw-redirect" title="Давньогрецькі міста Північного Причорномор\'я">грецької</a> колонії у Північному Причорномор\'ї&nbsp;— <a href="/wiki/%D0%91%D0%BE%D1%80%D0%B8%D1%81%D1%84%D0%B5%D0%BD%D1%96%D0%B4%D0%B0" class="mw-redirect" title="Борисфеніда">Борисфеніди</a> у гирлі Дніпра.\n',
    eventIndex: 13,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "e323dbd6-0e96-4f97-9433-8ee714b573b8",
    time: "бл. 600 до н.е.",
    events: "Заснування греками Ольвії та Пантікапея",
    eventsMarkup:
      'Заснування <a href="/wiki/%D0%93%D1%80%D0%B5%D0%BA%D0%B8" title="Греки">греками</a> <a href="/wiki/%D0%9E%D0%BB%D1%8C%D0%B2%D1%96%D1%8F" title="Ольвія">Ольвії</a> та <a href="/wiki/%D0%9F%D0%B0%D0%BD%D1%82%D1%96%D0%BA%D0%B0%D0%BF%D0%B5%D0%B9" title="Пантікапей">Пантікапея</a>\n',
    eventIndex: 14,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "9f31626d-0d7e-4355-9870-088a8ecb1756",
    time: "бл.550 до н.е.",
    events: "Заснування Феодосії та Керкінітиди у Таврії",
    eventsMarkup:
      'Заснування <a href="/wiki/%D0%A4%D0%B5%D0%BE%D0%B4%D0%BE%D1%81%D1%96%D1%8F" title="Феодосія">Феодосії</a> та <a href="/wiki/%D0%9A%D0%B5%D1%80%D0%BA%D1%96%D0%BD%D1%96%D1%82%D0%B8%D0%B4%D0%B0" title="Керкінітида">Керкінітиди</a> у Таврії\n',
    eventIndex: 15,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "c4ea89fa-1005-4199-ac5d-3506449c5701",
    time: "528 до н.е.",
    events: "Заснування гераклейцями Херсонесу",
    eventsMarkup:
      'Заснування гераклейцями <a href="/wiki/%D0%A5%D0%B5%D1%80%D1%81%D0%BE%D0%BD%D0%B5%D1%81" class="mw-redirect" title="Херсонес">Херсонесу</a>\n',
    eventIndex: 16,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "9873deff-fd37-4410-9955-d75a379fd6c9",
    time: "513 до н.е.",
    events:
      "Невдалий похід Дарія І на скіфів (Скіфи уникали головної битви, виснажуючи персів дрібними сутичками і нападами).",
    eventsMarkup:
      'Невдалий похід <a href="/wiki/%D0%94%D0%B0%D1%80%D1%96%D0%B9_I_%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B8%D0%B9" title="Дарій I Великий">Дарія І</a> на скіфів (<a href="/wiki/%D0%A1%D0%BA%D1%96%D1%84%D0%B8" title="Скіфи">Скіфи</a> уникали головної битви, виснажуючи персів дрібними сутичками і нападами).\n',
    eventIndex: 17,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "a31c71f1-25b4-40a9-a424-c83ecc3dfcb6",
    time: "502 до н.е.",
    events:
      "Заснування Тіри (Офіусси) — нині Білгород-Дністровський. За відомостями ЮНЕСКО, Білгород-Дністровський входить до десятки найдавніших міст Землі безперервного існування",
    eventsMarkup:
      'Заснування <a href="/wiki/%D0%A2%D1%96%D1%80%D0%B0" title="Тіра">Тіри</a> (Офіусси)&nbsp;— нині <a href="/wiki/%D0%91%D1%96%D0%BB%D0%B3%D0%BE%D1%80%D0%BE%D0%B4-%D0%94%D0%BD%D1%96%D1%81%D1%82%D1%80%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B8%D0%B9" title="Білгород-Дністровський">Білгород-Дністровський</a>. За відомостями <a href="/wiki/%D0%AE%D0%9D%D0%95%D0%A1%D0%9A%D0%9E" title="ЮНЕСКО">ЮНЕСКО</a>, Білгород-Дністровський входить до десятки найдавніших міст Землі безперервного існування\n',
    eventIndex: 18,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "7659a129-bde6-4cf4-9c1d-d5674c940fd4",
    time: "480 до н.е.",
    events:
      "Об'єднання грецьких поселень на Боспорі Кімерійському у Боспорське царство під зверхністю Пантикапея. Археанакт засновує царську династію.",
    eventsMarkup:
      'Об\'єднання грецьких поселень на Боспорі Кімерійському у <b><a href="/wiki/%D0%91%D0%BE%D1%81%D0%BF%D0%BE%D1%80%D1%81%D1%8C%D0%BA%D0%B5_%D1%86%D0%B0%D1%80%D1%81%D1%82%D0%B2%D0%BE" class="mw-redirect" title="Боспорське царство">Боспорське царство</a></b> під зверхністю Пантикапея. <a href="/wiki/%D0%90%D1%80%D1%85%D0%B5%D0%B0%D0%BD%D0%B0%D0%BA%D1%82" class="mw-redirect" title="Археанакт">Археанакт</a> засновує царську династію.\n',
    eventIndex: 19,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "e885d170-a84e-4804-86aa-82a9cd0dbdc8",
    time: "438 до н.е.",
    events:
      "У Боспорському царстві до влади приходить Спарток, який засновує нову династію.",
    eventsMarkup:
      'У Боспорському царстві до влади приходить <a href="/wiki/%D0%A1%D0%BF%D0%B0%D1%80%D1%82%D0%BE%D0%BA" class="mw-disambig" title="Спарток">Спарток</a>, який засновує нову династію.\n',
    eventIndex: 20,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "a813cab7-6d8c-4292-b369-ee5d1b692f1d",
    time: "434 до н.е.",
    events: "Договір про дружбу між Афінами та Боспорським царством",
    eventsMarkup: "Договір про дружбу між Афінами та Боспорським царством\n",
    eventIndex: 21,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "4af65e59-f07a-4bbb-8554-0e5698d1b37a",
    time: "421 до н.е.",
    events:
      "Ще одна ймовірна дата заснування Херсонесу Таврійського — як колонії Гераклеї.",
    eventsMarkup:
      "\n<p>Ще одна ймовірна дата заснування Херсонесу Таврійського&nbsp;— як колонії Гераклеї.\n</p>\n",
    eventIndex: 22,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "5f6d5e7e-17ab-4e4a-bffb-0908d2caa7ac",
    time: "бл. 385 до н.е.",
    events:
      "Феодосія потрапляє до складу Боспорського царства після її облоги царем Левконом l. Також під владу царства підпадає Керченський півострів.",
    eventsMarkup:
      '<a href="/wiki/%D0%A4%D0%B5%D0%BE%D0%B4%D0%BE%D1%81%D1%96%D1%8F" title="Феодосія">Феодосія</a> потрапляє до складу Боспорського царства після її облоги царем Левконом l. Також під владу царства підпадає Керченський півострів.\n',
    eventIndex: 23,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "4dc4931a-ff95-4380-b385-a2907517b9c2",
    time: "331 до н.е.",
    events:
      "Зопіріон, полководець Александра Македонського, рушив з військом через Дунай з метою підкорення народів у Північному Причорномор'ї. Ймовірно, намагався здобути Ольвію і оточив її. Був розбитий скіфами та ольвіополітами і загинув.",
    eventsMarkup:
      '<a href="/wiki/%D0%97%D0%BE%D0%BF%D1%96%D1%80%D1%96%D0%BE%D0%BD" title="Зопіріон">Зопіріон</a>, полководець <a href="/wiki/%D0%90%D0%BB%D0%B5%D0%BA%D1%81%D0%B0%D0%BD%D0%B4%D1%80_%D0%9C%D0%B0%D0%BA%D0%B5%D0%B4%D0%BE%D0%BD%D1%81%D1%8C%D0%BA%D0%B8%D0%B9" title="Александр Македонський">Александра Македонського</a>, рушив з військом через <a href="/wiki/%D0%94%D1%83%D0%BD%D0%B0%D0%B9" title="Дунай">Дунай</a> з метою підкорення народів у Північному Причорномор\'ї. Ймовірно, намагався здобути Ольвію і оточив її. Був розбитий скіфами та ольвіополітами і загинув.\n',
    eventIndex: 24,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "563dcb3d-3e75-4ca4-8350-40de11566927",
    time: "сер. ІІІ ст. до н. е.",
    events:
      "Сармати поступово витискають скіфів з Причорноморських степів до Таврії. Скіфські поселення залишились і на Нижньому Дніпрі.",
    eventsMarkup:
      '\n<p><a href="/wiki/%D0%A1%D0%B0%D1%80%D0%BC%D0%B0%D1%82%D0%B8" title="Сармати">Сармати</a> поступово витискають скіфів з Причорноморських степів до Таврії. Скіфські поселення залишились і на Нижньому Дніпрі.\n</p>\n',
    eventIndex: 25,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "d6f5a8e4-79b5-4703-9bbf-9565ba2cea2e",
    time: "III ст. до н. е. — І ст. н. е.",
    events: "Зарубинецька культура у Середньому Подніпров'ї",
    eventsMarkup:
      '<b><a href="/wiki/%D0%97%D0%B0%D1%80%D1%83%D0%B1%D0%B8%D0%BD%D0%B5%D1%86%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Зарубинецька культура">Зарубинецька культура</a></b> у Середньому Подніпров\'ї\n',
    eventIndex: 26,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "fa724b3b-6913-4ddf-9084-e4621cbefa25",
    time: "291 до н.е.",
    events: "Гети перемогли Лісімаха",
    eventsMarkup:
      '<a href="/wiki/%D0%93%D0%B5%D1%82%D0%B8" title="Гети">Гети</a> перемогли <a href="/wiki/%D0%9B%D1%96%D1%81%D1%96%D0%BC%D0%B0%D1%85" title="Лісімах">Лісімаха</a>\n',
    eventIndex: 27,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "9b2e21a1-db5f-4660-92c5-5f6bbab3b0af",
    time: "бл. 284 до н.е.",
    events: "Кельти в Західній Україні і Бессарабії.",
    eventsMarkup:
      '<b><a href="/wiki/%D0%9A%D0%B5%D0%BB%D1%8C%D1%82%D0%B8" title="Кельти">Кельти</a></b> в Західній Україні і Бессарабії.\n',
    eventIndex: 28,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "1bffb8f7-d4d6-49cf-a3a7-a808f8d30fa0",
    time: "108—107 до н. е.",
    events:
      "Цар Боспору Перісад V заповідає своє царство Понту, що викликає повстання скіфів на чолі з Савмаком. Придушене за допомогою військ царя Понту Мітрідата VI Євпатора.",
    eventsMarkup:
      'Цар Боспору <a href="/wiki/%D0%9F%D0%B5%D1%80%D1%96%D1%81%D0%B0%D0%B4_V" title="Перісад V">Перісад V</a> заповідає своє царство <a href="/wiki/%D0%9F%D0%BE%D0%BD%D1%82" title="Понт">Понту</a>, що викликає <b>повстання</b> скіфів на чолі з <a href="/wiki/%D0%A1%D0%B0%D0%B2%D0%BC%D0%B0%D0%BA" title="Савмак">Савмаком</a>. Придушене за допомогою військ царя Понту <a href="/wiki/%D0%9C%D1%96%D1%82%D1%80%D1%96%D0%B4%D0%B0%D1%82_VI_%D0%95%D0%B2%D0%BF%D0%B0%D1%82%D0%BE%D1%80" class="mw-redirect" title="Мітрідат VI Евпатор">Мітрідата VI Євпатора</a>.\n',
    eventIndex: 29,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "979d40a7-d011-447f-894e-1c04c18b1729",
    time: "106 до н. е.",
    events: "Херсонес на деякий час приєднано до Боспорського царства",
    eventsMarkup:
      '<a href="/wiki/%D0%A5%D0%B5%D1%80%D1%81%D0%BE%D0%BD%D0%B5%D1%81" class="mw-redirect" title="Херсонес">Херсонес</a> на деякий час приєднано до Боспорського царства\n',
    eventIndex: 30,
    createdAt: "2024-01-06T17:36:32.258Z",
  },
  {
    id: "6e305633-8f6c-4bee-890e-53ba1e4614a6",
    time: "63 до н. е.",
    events:
      "Загибель царя Понту Мітрідата VI Євпатора у Пантикапеї в результаті бунту проти нього власного сина Фарнака.",
    eventsMarkup:
      'Загибель царя Понту Мітрідата VI Євпатора у Пантикапеї в результаті бунту проти нього власного сина <a href="/wiki/%D0%A4%D0%B0%D1%80%D0%BD%D0%B0%D0%BA" class="mw-disambig" title="Фарнак">Фарнака</a>.\n',
    eventIndex: 31,
    createdAt: "2024-01-06T17:36:32.258Z",
  },
  {
    id: "84449440-5212-4b32-a523-fbc53232a707",
    time: "48—20 до н. е.",
    events: "Правління у Боспорі Асандра.",
    eventsMarkup:
      'Правління у Боспорі <a href="/wiki/%D0%90%D1%81%D0%B0%D0%BD%D0%B4%D1%80" title="Асандр">Асандра</a>.\n',
    eventIndex: 32,
    createdAt: "2024-01-06T17:36:32.258Z",
  },
  {
    id: "946a28c5-14cc-43f8-aa25-587f308131a6",
    time: "47 до н. е.",
    events:
      "2 серпня — перемога Юлія Цезаря над царем Боспора Фарнаком ІІ в битві при Зелі у Малій Азії. («Прийшов, побачив, переміг»)",
    eventsMarkup:
      '2 серпня&nbsp;— перемога <a href="/wiki/%D0%93%D0%B0%D0%B9_%D0%AE%D0%BB%D1%96%D0%B9_%D0%A6%D0%B5%D0%B7%D0%B0%D1%80" title="Гай Юлій Цезар">Юлія Цезаря</a> над царем Боспора <a href="/w/index.php?title=%D0%A4%D0%B0%D1%80%D0%BD%D0%B0%D0%BA_%D0%86%D0%86&amp;action=edit&amp;redlink=1" class="new" title="Фарнак ІІ (ще не написана)">Фарнаком ІІ</a> в <a href="/w/index.php?title=%D0%91%D0%B8%D1%82%D0%B2%D0%B0_%D0%BF%D1%80%D0%B8_%D0%97%D0%B5%D0%BB%D1%96&amp;action=edit&amp;redlink=1" class="new" title="Битва при Зелі (ще не написана)">битві при Зелі</a> у Малій Азії. («Прийшов, побачив, переміг»)\n',
    eventIndex: 33,
    createdAt: "2024-01-06T17:36:32.258Z",
  },
  {
    id: "af18dcc6-3a09-44ef-aa9f-9ce9745da47a",
    time: "30",
    events: "Тіра входить до складу Римської імперії.",
    eventsMarkup:
      'Тіра входить до складу <a href="/wiki/%D0%A0%D0%B8%D0%BC%D1%81%D1%8C%D0%BA%D0%B0_%D0%86%D0%BC%D0%BF%D0%B5%D1%80%D1%96%D1%8F" class="mw-redirect" title="Римська Імперія">Римської імперії</a>.\n',
    eventIndex: 34,
    createdAt: "2024-01-06T17:36:32.258Z",
  },
  {
    id: "79acdd30-bcd7-4280-9cff-2b6733284d3e",
    time: "38",
    events:
      "Смерть боспорського царя Аспурга, родоначальника нової династії. На трон вступає його син Мітрідат ІІІ, якого було позбавлено влади братом Котісом за допомогою Риму. Початок римо-боспорської війни.",
    eventsMarkup:
      'Смерть боспорського царя <a href="/w/index.php?title=%D0%90%D1%81%D0%BF%D1%83%D1%80%D0%B3&amp;action=edit&amp;redlink=1" class="new" title="Аспург (ще не написана)">Аспурга</a>, родоначальника нової династії. На трон вступає його син <a href="/w/index.php?title=%D0%9C%D1%96%D1%82%D1%80%D1%96%D0%B4%D0%B0%D1%82_%D0%86%D0%86%D0%86&amp;action=edit&amp;redlink=1" class="new" title="Мітрідат ІІІ (ще не написана)">Мітрідат ІІІ</a>, якого було позбавлено влади братом <a href="/wiki/%D0%9A%D0%BE%D1%82%D1%96%D1%81" title="Котіс">Котісом</a> за допомогою <a href="/wiki/%D0%A0%D0%B8%D0%BC%D1%81%D1%8C%D0%BA%D0%B0_%D1%96%D0%BC%D0%BF%D0%B5%D1%80%D1%96%D1%8F" title="Римська імперія">Риму</a>. Початок римо-боспорської війни.\n',
    eventIndex: 35,
    createdAt: "2024-01-06T17:36:32.258Z",
  },
  {
    id: "ff2f160a-cf6f-4e7c-9660-ff2786cfb70d",
    time: "бл.69 — 244",
    events:
      "Римський гарнізон у фортеці Харакс (біля сучасної Ялти). Також відомі римські гарнізони І — III ст. у Ольвії, Тірі, Херсонесі, сучасній Балаклаві.",
    eventsMarkup:
      'Римський гарнізон у фортеці <a href="/wiki/%D0%A5%D0%B0%D1%80%D0%B0%D0%BA%D1%81" title="Харакс">Харакс</a> (біля сучасної Ялти). Також відомі римські гарнізони І&nbsp;— III&nbsp;ст. у Ольвії, Тірі, <a href="/wiki/%D0%A5%D0%B5%D1%80%D1%81%D0%BE%D0%BD%D0%B5%D1%81" class="mw-redirect" title="Херсонес">Херсонесі</a>, сучасній <a href="/wiki/%D0%91%D0%B0%D0%BB%D0%B0%D0%BA%D0%BB%D0%B0%D0%B2%D0%B0" title="Балаклава">Балаклаві</a>.\n',
    eventIndex: 36,
    createdAt: "2024-01-06T17:36:32.258Z",
  },
  {
    id: "0305453c-7a7d-4e79-89d9-2397c83ad278",
    time: "101",
    events:
      "Загибель у засланні 3-го Папи Римського Климента I — ймовірно, у Херсонесі.",
    eventsMarkup:
      'Загибель у засланні 3-го <a href="/wiki/%D0%9F%D0%B0%D0%BF%D0%B0_%D0%A0%D0%B8%D0%BC%D1%81%D1%8C%D0%BA%D0%B8%D0%B9" title="Папа Римський">Папи Римського</a> <a href="/wiki/%D0%9A%D0%BB%D0%B8%D0%BC%D0%B5%D0%BD%D1%82_I" title="Климент I">Климента</a> I&nbsp;— ймовірно, у <a href="/wiki/%D0%A5%D0%B5%D1%80%D1%81%D0%BE%D0%BD%D0%B5%D1%81" class="mw-redirect" title="Херсонес">Херсонесі</a>.\n',
    eventIndex: 37,
    createdAt: "2024-01-06T17:36:32.258Z",
  },
  {
    id: "44ef6d89-4bb5-4c43-bc06-022c661ab5b1",
    time: "І — II ст.",
    events:
      "Спорудження римлянами у південній Бессарабії захисних валів («Троянові вали»)",
    eventsMarkup:
      'Спорудження римлянами у південній <a href="/wiki/%D0%91%D0%B5%D1%81%D1%81%D0%B0%D1%80%D0%B0%D0%B1%D1%96%D1%8F" title="Бессарабія">Бессарабії</a> захисних валів (<a href="/wiki/%D0%A2%D1%80%D0%BE%D1%8F%D0%BD%D0%BE%D0%B2%D1%96_%D0%B2%D0%B0%D0%BB%D0%B8" class="mw-redirect" title="Троянові вали">«Троянові вали»</a>)\n',
    eventIndex: 38,
    createdAt: "2024-01-06T17:36:32.258Z",
  },
  {
    id: "b5ec7d02-7ca5-423b-b054-b480f8c1138f",
    time: "поч. ІІІ ст.",
    events:
      "Територію Правобережної України займають германські племена готів, які просунулись з північного заходу (вельбарська культура). Витиснення сарматів. Готська держава Ойум; створення Зміївих валів. Черняхівська культура — ймовірно, різноетнічний племінний союз у Правобережній Україні, на Полтавщині, у Молдові та східній Румунії на чолі з готами.",
    eventsMarkup:
      '\n<p>Територію Правобережної України займають германські племена <b><a href="/wiki/%D0%93%D0%BE%D1%82%D0%B8" title="Готи">готів</a></b>, які просунулись з північного заходу (<a href="/wiki/%D0%92%D0%B5%D0%BB%D1%8C%D0%B1%D0%B0%D1%80%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Вельбарська культура">вельбарська культура</a>). Витиснення сарматів. Готська держава <a href="/wiki/%D0%9E%D0%B9%D1%83%D0%BC" class="mw-redirect" title="Ойум">Ойум</a>; створення <a href="/wiki/%D0%97%D0%BC%D1%96%D1%94%D0%B2%D1%96_%D0%B2%D0%B0%D0%BB%D0%B8" title="Змієві вали">Зміївих валів</a>. <b><a href="/wiki/%D0%A7%D0%B5%D1%80%D0%BD%D1%8F%D1%85%D1%96%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D1%83%D0%BB%D1%8C%D1%82%D1%83%D1%80%D0%B0" title="Черняхівська культура">Черняхівська культура</a></b>&nbsp;— ймовірно, різноетнічний племінний союз у Правобережній Україні, на Полтавщині, у Молдові та східній Румунії на чолі з готами.\n</p>\n',
    eventIndex: 39,
    createdAt: "2024-01-06T17:36:32.258Z",
  },
  {
    id: "0d45b3a9-503c-4980-8651-56edcab3dacd",
    time: "238—270",
    events:
      "Скіфські (Готські) війни: низка військових походів варварів на чолі з готами з Північного Причорномор'я на римські землі на Балканах і приморські міста Малої Азії та Греції.",
    eventsMarkup:
      '<b><a href="/w/index.php?title=%D0%A1%D0%BA%D1%96%D1%84%D1%81%D1%8C%D0%BA%D1%96_%D0%B2%D1%96%D0%B9%D0%BD%D0%B8&amp;action=edit&amp;redlink=1" class="new" title="Скіфські війни (ще не написана)">Скіфські (Готські) війни</a></b>: низка військових походів варварів на чолі з готами з Північного Причорномор\'я на римські землі на Балканах і приморські міста <a href="/wiki/%D0%9C%D0%B0%D0%BB%D0%B0_%D0%90%D0%B7%D1%96%D1%8F" title="Мала Азія">Малої Азії</a> та <a href="/wiki/%D0%93%D1%80%D0%B5%D1%86%D1%96%D1%8F" title="Греція">Греції</a>.\n',
    eventIndex: 40,
    createdAt: "2024-01-06T17:36:32.204Z",
  },
  {
    id: "c4391f1e-fc65-4124-9e3f-48b0c89415be",
    time: "238",
    events:
      "Перше готське нашестя на дунайські провінції Риму (племена карпів).",
    eventsMarkup:
      'Перше готське нашестя на дунайські провінції <a href="/wiki/%D0%A0%D0%B8%D0%BC" title="Рим">Риму</a> (племена карпів).\n',
    eventIndex: 41,
    createdAt: "2024-01-06T17:36:32.204Z",
  },
  {
    id: "1954c300-8d6e-43ab-b4fe-0ba5682e0a22",
    time: "248",
    events: "Спільний похід готів і тайфалів на Мезію",
    eventsMarkup:
      'Спільний похід готів і <a href="/wiki/%D0%A2%D0%B0%D0%B9%D1%84%D0%B0%D0%BB%D0%B8" class="mw-redirect" title="Тайфали">тайфалів</a> на <a href="/wiki/%D0%9C%D0%B5%D0%B7%D1%96%D1%8F" title="Мезія">Мезію</a>\n',
    eventIndex: 42,
    createdAt: "2024-01-06T17:36:32.204Z",
  },
  {
    id: "1cf95dd3-c69b-40fd-8a04-156796120e1e",
    time: "252",
    events: "Готське нашестя на Балкани",
    eventsMarkup:
      'Готське нашестя на <a href="/wiki/%D0%91%D0%B0%D0%BB%D0%BA%D0%B0%D0%BD%D0%B8" class="mw-redirect" title="Балкани">Балкани</a>\n',
    eventIndex: 43,
    createdAt: "2024-01-06T17:36:32.204Z",
  },
  {
    id: "d1aa3748-ccc5-47a9-9317-e76353e1df1c",
    time: "256",
    events: "Готське нашестя на Малу Азію (258 р.?)",
    eventsMarkup: "Готське нашестя на Малу Азію (258&nbsp;р.?)\n",
    eventIndex: 44,
    createdAt: "2024-01-06T17:36:32.204Z",
  },
  {
    id: "19e7173b-75a7-4686-9fcf-fb4b8c17fb25",
    time: "267",
    events:
      "Готське вторгнення в Малу Азію і Грецію, в якому брало участь близько 320 тис. воїнів.",
    eventsMarkup:
      "Готське вторгнення в Малу Азію і Грецію, в якому брало участь близько 320 тис. воїнів.\n",
    eventIndex: 45,
    createdAt: "2024-01-06T17:36:32.204Z",
  },
  {
    id: "158a5b3a-634e-4ac1-b221-af44c5e47407",
    time: "268",
    events:
      "Набіг готів на Салоніки, їх розгром імператором Галлієном. Римські легіони залишають Дакію (або 271 р.).",
    eventsMarkup:
      'Набіг готів на <a href="/wiki/%D0%A1%D0%B0%D0%BB%D0%BE%D0%BD%D1%96%D0%BA%D0%B8" title="Салоніки">Салоніки</a>, їх розгром імператором <a href="/wiki/%D0%93%D0%B0%D0%BB%D0%BB%D1%96%D1%94%D0%BD" title="Галлієн">Галлієном</a>. Римські легіони залишають <a href="/wiki/%D0%94%D0%B0%D0%BA%D1%96%D1%8F" title="Дакія">Дакію</a> (або 271&nbsp;р.).\n',
    eventIndex: 46,
    createdAt: "2024-01-06T17:36:32.204Z",
  },
  {
    id: "86d72b34-05fa-45b5-ad9b-7ad5278bf265",
    time: "бл.270",
    events:
      "Готи руйнують причорноморські грецькі міста у тому числі і Ольвію.",
    eventsMarkup:
      '<a href="/wiki/%D0%93%D0%BE%D1%82%D0%B8" title="Готи">Готи</a> руйнують причорноморські грецькі міста у тому числі і Ольвію.\n',
    eventIndex: 47,
    createdAt: "2024-01-06T17:36:32.204Z",
  },
  {
    id: "a099abab-9b1a-4e27-b7c4-471dda66ac04",
    time: "289",
    events: "Війна імператора Діоклетіана з сарматами",
    eventsMarkup:
      'Війна імператора <a href="/wiki/%D0%94%D1%96%D0%BE%D0%BA%D0%BB%D0%B5%D1%82%D1%96%D0%B0%D0%BD" title="Діоклетіан">Діоклетіана</a> з сарматами\n',
    eventIndex: 48,
    createdAt: "2024-01-06T17:36:32.204Z",
  },
  {
    id: "39a61bd0-2468-4a70-93ed-33c128ea7f44",
    time: "291",
    events: "Війна готів і тайфалів проти вандалів і гепідів",
    eventsMarkup:
      'Війна готів і <a href="/wiki/%D0%A2%D0%B0%D0%B9%D1%84%D0%B0%D0%BB%D0%B8" class="mw-redirect" title="Тайфали">тайфалів</a> проти <a href="/wiki/%D0%92%D0%B0%D0%BD%D0%B4%D0%B0%D0%BB%D0%B8" title="Вандали">вандалів</a> і <a href="/wiki/%D0%93%D0%B5%D0%BF%D1%96%D0%B4%D0%B8" title="Гепіди">гепідів</a>\n',
    eventIndex: 49,
    createdAt: "2024-01-06T17:36:32.204Z",
  },
  {
    id: "4960adfc-ca7d-432e-b85c-e9ca452e71c6",
    time: "292",
    events: "Війна Діоклетіана з сарматами",
    eventsMarkup:
      'Війна <a href="/wiki/%D0%94%D1%96%D0%BE%D0%BA%D0%BB%D0%B5%D1%82%D1%96%D0%B0%D0%BD" title="Діоклетіан">Діоклетіана</a> з сарматами\n',
    eventIndex: 50,
    createdAt: "2024-01-06T17:36:32.269Z",
  },
  {
    id: "84fed66a-d0be-48b6-88d7-b5111a9ec498",
    time: "306",
    events: "Костянтин стає одним з соправителів Римської імперії",
    eventsMarkup:
      '<a href="/wiki/%D0%9A%D0%BE%D1%81%D1%82%D1%8F%D0%BD%D1%82%D0%B8%D0%BD_%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B8%D0%B9" title="Костянтин Великий">Костянтин</a> стає одним з соправителів Римської імперії\n',
    eventIndex: 51,
    createdAt: "2024-01-06T17:36:32.269Z",
  },
  {
    id: "c3ccff2e-9d4d-4201-9da4-ffa166849876",
    time: "324",
    events: "Костянтин стає єдиним імператором Римської імперії (помер 337 р.)",
    eventsMarkup:
      '<a href="/wiki/%D0%9A%D0%BE%D1%81%D1%82%D1%8F%D0%BD%D1%82%D0%B8%D0%BD_%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B8%D0%B9" title="Костянтин Великий">Костянтин</a> стає єдиним імператором Римської імперії (помер 337&nbsp;р.)\n',
    eventIndex: 52,
    createdAt: "2024-01-06T17:36:32.269Z",
  },
  {
    id: "8ad7854d-736c-40e3-ad24-eb1b3df1fc39",
    time: "325",
    events:
      "Імператор Костянтин Великий скликає у Нікеї 1-й Вселенський собор: християнство стає у Імперії державною релігією.",
    eventsMarkup:
      'Імператор <a href="/wiki/%D0%9A%D0%BE%D1%81%D1%82%D1%8F%D0%BD%D1%82%D0%B8%D0%BD_%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B8%D0%B9" title="Костянтин Великий">Костянтин Великий</a> скликає у Нікеї <a href="/wiki/1-%D0%B9_%D0%92%D1%81%D0%B5%D0%BB%D0%B5%D0%BD%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D1%81%D0%BE%D0%B1%D0%BE%D1%80" class="mw-redirect" title="1-й Вселенський собор">1-й Вселенський собор</a>: <b><a href="/wiki/%D0%A5%D1%80%D0%B8%D1%81%D1%82%D0%B8%D1%8F%D0%BD%D1%81%D1%82%D0%B2%D0%BE" title="Християнство">християнство</a></b> стає у Імперії державною релігією.\n',
    eventIndex: 53,
    createdAt: "2024-01-06T17:36:32.269Z",
  },
  {
    id: "7fb71983-2479-4a38-8c65-bc007c1eb8ca",
    time: "337",
    events: "Передові загони гунів досягли Дону",
    eventsMarkup:
      'Передові загони <b><a href="/wiki/%D0%93%D1%83%D0%BD%D0%B8" title="Гуни">гунів</a></b> досягли <a href="/wiki/%D0%94%D0%BE%D0%BD" title="Дон">Дону</a>\n',
    eventIndex: 54,
    createdAt: "2024-01-06T17:36:32.269Z",
  },
  {
    id: "c4eed2d6-20d9-4f2a-b6be-ee3fc3e11cba",
    time: "бл.350—376",
    events: "Правління готського вождя Германаріха (Ерманаріха)",
    eventsMarkup:
      'Правління готського вождя <a href="/wiki/%D0%93%D0%B5%D1%80%D0%BC%D0%B0%D0%BD%D0%B0%D1%80%D1%96%D1%85" title="Германаріх">Германаріха</a> (Ерманаріха)\n',
    eventIndex: 55,
    createdAt: "2024-01-06T17:36:32.269Z",
  },
  {
    id: "bba7a367-bb6c-4e7f-b658-61918dde1e53",
    time: "бл.360",
    events: "Алани підкорені гунами",
    eventsMarkup:
      '<a href="/wiki/%D0%90%D0%BB%D0%B0%D0%BD%D0%B8" title="Алани">Алани</a> підкорені гунами\n',
    eventIndex: 56,
    createdAt: "2024-01-06T17:36:32.269Z",
  },
  {
    id: "1a57ca6d-bb4f-488c-9412-f4f47cf59b25",
    time: "бл.362",
    events: "Боспор підкорено Германаріхом",
    eventsMarkup:
      'Боспор підкорено <a href="/wiki/%D0%93%D0%B5%D1%80%D0%BC%D0%B0%D0%BD%D0%B0%D1%80%D1%96%D1%85" title="Германаріх">Германаріхом</a>\n',
    eventIndex: 57,
    createdAt: "2024-01-06T17:36:32.269Z",
  },
  {
    id: "efcdec27-f826-4f0e-8f70-7738de6e56dc",
    time: "бл.365",
    events:
      "Війна Германаріха проти слов'ян, в результаті якої їх частина втікає на північ (з часом — на оз. Ільмень)",
    eventsMarkup:
      "Війна Германаріха проти слов'ян, в результаті якої їх частина втікає на північ (з часом&nbsp;— на оз. Ільмень)\n",
    eventIndex: 58,
    createdAt: "2024-01-06T17:36:32.269Z",
  },
  {
    id: "c28f73e5-76ab-4ba4-94e9-1e8c155d83d8",
    time: "бл. 373—376",
    events: "Алано-готська війна.",
    eventsMarkup: "Алано-готська війна.\n",
    eventIndex: 59,
    createdAt: "2024-01-06T17:36:32.269Z",
  },
  {
    id: "d7a3553a-e7a7-4310-a740-f8605b344c61",
    time: "бл.374",
    events: "Війна готів з антами: загибель антського вождя Боза.",
    eventsMarkup:
      'Війна готів з антами: загибель <b><a href="/wiki/%D0%90%D0%BD%D1%82%D0%B8" title="Анти">антського</a></b> вождя Боза.\n',
    eventIndex: 60,
    createdAt: "2024-01-06T17:36:32.278Z",
  },
  {
    id: "103bc188-109e-4841-867e-a229ea7e19a2",
    time: "375",
    events: "Еракська битва: алани розбили готів",
    eventsMarkup:
      'Еракська битва: <a href="/wiki/%D0%90%D0%BB%D0%B0%D0%BD%D0%B8" title="Алани">алани</a> розбили готів\n',
    eventIndex: 61,
    createdAt: "2024-01-06T17:36:32.278Z",
  },
  {
    id: "27068ef2-359b-4c0d-9bec-480ffcd9de1e",
    time: "бл.375/376 (370?)",
    events:
      "Україна. Гуни\nГунське нашестя. Розгром готів і їх втеча на захід. Вестготи (везиготи) за згодою римської адміністрації поселяються на Дунаї (у Фракії) на правах конфедератів. В подальшому підіймають антиримські повстання, виходять з-під контролю Імперії і починають військові рейди по її землях, що врешті решт призводить до краху Рима у 476 р. і створенню у Західній Європі 2-х готських та інших варварських королівств.",
    eventsMarkup:
      '\n<figure typeof="mw:File/Thumb"><a href="/wiki/%D0%A4%D0%B0%D0%B9%D0%BB:0375_Ukraine.png" class="mw-file-description"><img src="//upload.wikimedia.org/wikipedia/commons/thumb/6/65/0375_Ukraine.png/100px-0375_Ukraine.png" decoding="async" width="100" height="74" class="mw-file-element" srcset="//upload.wikimedia.org/wikipedia/commons/thumb/6/65/0375_Ukraine.png/150px-0375_Ukraine.png 1.5x, //upload.wikimedia.org/wikipedia/commons/thumb/6/65/0375_Ukraine.png/200px-0375_Ukraine.png 2x" data-file-width="1657" data-file-height="1225"></a><figcaption>Україна. Гуни</figcaption></figure><a href="/wiki/%D0%93%D1%83%D0%BD%D0%B8" title="Гуни">Гунське</a> нашестя. Розгром готів і їх втеча на захід. <a href="/wiki/%D0%92%D0%B5%D1%81%D1%82%D0%B3%D0%BE%D1%82%D0%B8" title="Вестготи">Вестготи</a> (везиготи) за згодою римської адміністрації поселяються на Дунаї (у Фракії) на правах конфедератів. В подальшому підіймають антиримські повстання, виходять з-під контролю Імперії і починають військові рейди по її землях, що врешті решт призводить до краху Рима у 476&nbsp;р. і створенню у Західній Європі 2-х готських та інших <a href="/wiki/%D0%92%D0%B0%D1%80%D0%B2%D0%B0%D1%80%D1%81%D1%8C%D0%BA%D1%96_%D0%BA%D0%BE%D1%80%D0%BE%D0%BB%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%B0" title="Варварські королівства">варварських королівств</a>.\n',
    eventIndex: 62,
    createdAt: "2024-01-06T17:36:32.278Z",
  },
  {
    id: "182b9617-e45d-49da-adc0-12082cad9c99",
    time: "378",
    events: "Гуни перетинають Керченську протоку. Кінець Боспорського царства.",
    eventsMarkup:
      '<a href="/wiki/%D0%93%D1%83%D0%BD%D0%B8" title="Гуни">Гуни</a> перетинають <a href="/wiki/%D0%9A%D0%B5%D1%80%D1%87%D0%B5%D0%BD%D1%81%D1%8C%D0%BA%D0%B0_%D0%BF%D1%80%D0%BE%D1%82%D0%BE%D0%BA%D0%B0" title="Керченська протока">Керченську протоку</a>. Кінець <a href="/wiki/%D0%91%D0%BE%D1%81%D0%BF%D0%BE%D1%80%D1%81%D1%8C%D0%BA%D0%B5_%D1%86%D0%B0%D1%80%D1%81%D1%82%D0%B2%D0%BE" class="mw-redirect" title="Боспорське царство">Боспорського царства</a>.\n',
    eventIndex: 63,
    createdAt: "2024-01-06T17:36:32.278Z",
  },
  {
    id: "e9728724-29ca-436d-9291-02314b21afea",
    time: "395",
    events:
      "Остаточний розподіл Римської імперії на Західну і Східну (Візантійську)",
    eventsMarkup:
      "Остаточний розподіл Римської імперії на Західну і Східну (Візантійську)\n",
    eventIndex: 64,
    createdAt: "2024-01-06T17:36:32.278Z",
  },
  {
    id: "1d0a5595-93c7-4fbc-b2e6-e443a5a53f88",
    time: "420",
    events:
      "Гуни закріплюються у Паннонії і починають загарбницькі походи по Європі",
    eventsMarkup:
      '<a href="/wiki/%D0%93%D1%83%D0%BD%D0%B8" title="Гуни">Гуни</a> закріплюються у <a href="/wiki/%D0%9F%D0%B0%D0%BD%D0%BD%D0%BE%D0%BD%D1%96%D1%8F" title="Паннонія">Паннонії</a> і починають загарбницькі походи по Європі\n',
    eventIndex: 65,
    createdAt: "2024-01-06T17:36:32.278Z",
  },
  {
    id: "7e59d7ed-a637-4bd9-9089-cc292a59b0b2",
    time: "434",
    events: "Облога гунами Константинополя",
    eventsMarkup:
      'Облога гунами <a href="/wiki/%D0%9A%D0%BE%D0%BD%D1%81%D1%82%D0%B0%D0%BD%D1%82%D0%B8%D0%BD%D0%BE%D0%BF%D0%BE%D0%BB%D1%8C" title="Константинополь">Константинополя</a>\n',
    eventIndex: 66,
    createdAt: "2024-01-06T17:36:32.278Z",
  },
  {
    id: "3a2d3c14-047f-4936-973c-d69bed55759f",
    time: "451",
    events:
      "Битва на Каталаунських полях (після 20 червня 451 року), в якій війська Західної Римської імперії під керівництвом полководця Аеція в союзі з армією Тулузького королівства вестготів зупинили навалу коаліції варварських племен гунів і германців під проводом Аттіли на Галлію.",
    eventsMarkup:
      '<b>Битва на Каталаунських полях</b> (після <a href="/wiki/20_%D1%87%D0%B5%D1%80%D0%B2%D0%BD%D1%8F" title="20 червня">20 червня</a> <a href="/wiki/451" title="451">451</a> року), в якій війська <a href="/wiki/%D0%97%D0%B0%D1%85%D1%96%D0%B4%D0%BD%D0%B0_%D0%A0%D0%B8%D0%BC%D1%81%D1%8C%D0%BA%D0%B0_%D1%96%D0%BC%D0%BF%D0%B5%D1%80%D1%96%D1%8F" title="Західна Римська імперія">Західної Римської імперії</a> під керівництвом полководця <a href="/wiki/%D0%A4%D0%BB%D0%B0%D0%B2%D1%96%D0%B9_%D0%90%D0%B5%D1%86%D1%96%D0%B9" title="Флавій Аецій">Аеція</a> в союзі з армією <a href="/wiki/%D0%92%D0%B5%D1%81%D1%82%D0%B3%D0%BE%D1%82%D0%B8" title="Вестготи">Тулузького королівства вестготів</a> зупинили навалу коаліції варварських племен <a href="/wiki/%D0%93%D1%83%D0%BD%D0%B8" title="Гуни">гунів</a> і <a href="/wiki/%D0%93%D0%B5%D1%80%D0%BC%D0%B0%D0%BD%D1%86%D1%96" title="Германці">германців</a> під проводом <a href="/wiki/%D0%90%D1%82%D1%82%D1%96%D0%BB%D0%B0" title="Аттіла">Аттіли</a> на <a href="/wiki/%D0%93%D0%B0%D0%BB%D0%BB%D1%96%D1%8F" title="Галлія">Галлію</a>.\n',
    eventIndex: 67,
    createdAt: "2024-01-06T17:36:32.278Z",
  },
  {
    id: "5279d65a-804f-4ca6-b2bf-c4082794f681",
    time: "453",
    events: "Смерть вождя гунів Аттіли (406—453). Розпад держави гунів.",
    eventsMarkup:
      'Смерть вождя гунів <a href="/wiki/%D0%90%D1%82%D1%82%D1%96%D0%BB%D0%B0" title="Аттіла">Аттіли</a> (406—453). Розпад держави гунів.\n',
    eventIndex: 68,
    createdAt: "2024-01-06T17:36:32.278Z",
  },
  {
    id: "0820d3ca-ca2d-43a8-b026-2fec93244cba",
    time: "482",
    events:
      "Легендарна дата заснування Києва братами Києм, Щеком,Хоривом та сестрою Либіддю. Одна з версій походження назви міста — від імені одного з готських вождів (Кніва)",
    eventsMarkup:
      'Легендарна дата заснування <b><a href="/wiki/%D0%9A%D0%B8%D1%97%D0%B2" title="Київ"><big>Києва</big></a></b> братами <a href="/wiki/%D0%9A%D0%B8%D0%B9_(%D0%BA%D0%BD%D1%8F%D0%B7%D1%8C)" title="Кий (князь)">Києм</a>, <a href="/wiki/%D0%A9%D0%B5%D0%BA" title="Щек">Щеком</a>,<a href="/wiki/%D0%A5%D0%BE%D1%80%D0%B8%D0%B2" title="Хорив">Хоривом</a> та сестрою Либіддю. Одна з версій походження назви міста&nbsp;— від імені одного з готських вождів (Кніва)\n',
    eventIndex: 69,
    createdAt: "2024-01-06T17:36:32.278Z",
  },
  {
    id: "124a5aae-57cb-496d-b319-3147d5ee7257",
    time: "527—565",
    events:
      "Правління у Візантії імператора Юстиніана І, при якому, зокрема, було споруджено (або відновлено) низку укріплень у Таврії.",
    eventsMarkup:
      'Правління у <a href="/wiki/%D0%92%D1%96%D0%B7%D0%B0%D0%BD%D1%82%D1%96%D0%B9%D1%81%D1%8C%D0%BA%D0%B0_%D1%96%D0%BC%D0%BF%D0%B5%D1%80%D1%96%D1%8F" title="Візантійська імперія">Візантії</a> імператора <a href="/wiki/%D0%AE%D1%81%D1%82%D0%B8%D0%BD%D1%96%D0%B0%D0%BD_%D0%86" class="mw-redirect" title="Юстиніан І">Юстиніана І</a>, при якому, зокрема, було споруджено (або відновлено) низку укріплень у <a href="/wiki/%D0%A2%D0%B0%D0%B2%D1%80%D1%96%D1%8F" title="Таврія">Таврії</a>.\n',
    eventIndex: 70,
    createdAt: "2024-01-06T17:36:32.330Z",
  },
  {
    id: "bef0abf8-e088-4e81-8387-b8b6dacf168e",
    time: "545",
    events: "Анти стали союзниками Візантії проти «гунів» (і кутригурів)",
    eventsMarkup:
      '<a href="/wiki/%D0%90%D0%BD%D1%82%D0%B8" title="Анти">Анти</a> стали союзниками Візантії проти «гунів» (і кутригурів)\n',
    eventIndex: 71,
    createdAt: "2024-01-06T17:36:32.330Z",
  },
  {
    id: "e7b75a47-76d2-451f-8a7e-f5645df55314",
    time: "548",
    events: "Перше відоме вторгнення слов'ян на Балкани",
    eventsMarkup: "Перше відоме вторгнення слов'ян на Балкани\n",
    eventIndex: 72,
    createdAt: "2024-01-06T17:36:32.330Z",
  },
  {
    id: "2a1be43b-0b79-43b2-a295-fce75edda16d",
    time: "бл.558",
    events: "Україна. Авари\nНашестя аварів",
    eventsMarkup:
      '\n<figure typeof="mw:File/Thumb"><a href="/wiki/%D0%A4%D0%B0%D0%B9%D0%BB:0550_Ukraine.png" class="mw-file-description"><img src="//upload.wikimedia.org/wikipedia/commons/thumb/4/49/0550_Ukraine.png/100px-0550_Ukraine.png" decoding="async" width="100" height="74" class="mw-file-element" srcset="//upload.wikimedia.org/wikipedia/commons/thumb/4/49/0550_Ukraine.png/150px-0550_Ukraine.png 1.5x, //upload.wikimedia.org/wikipedia/commons/thumb/4/49/0550_Ukraine.png/200px-0550_Ukraine.png 2x" data-file-width="1651" data-file-height="1227"></a><figcaption>Україна. Авари</figcaption></figure> Нашестя <b><a href="/wiki/%D0%90%D0%B2%D0%B0%D1%80%D0%B8" title="Авари">аварів</a></b>\n',
    eventIndex: 73,
    createdAt: "2024-01-06T17:36:32.330Z",
  },
  {
    id: "885b2043-0732-4eff-9f34-88c2216ada57",
    time: "558—559",
    events:
      "Вторгнення булгарського хана Забергана до Фракії. під час якого булгари дійшли до Константинополя.",
    eventsMarkup:
      'Вторгнення <a href="/wiki/%D0%91%D1%83%D0%BB%D0%B3%D0%B0%D1%80%D0%B8" title="Булгари">булгарського</a> хана Забергана до <a href="/wiki/%D0%A4%D1%80%D0%B0%D0%BA%D1%96%D1%8F" title="Фракія">Фракії</a>. під час якого булгари дійшли до Константинополя.\n',
    eventIndex: 74,
    createdAt: "2024-01-06T17:36:32.330Z",
  },
  {
    id: "5f98b2f3-dd7c-4839-8d75-eafd1488eda7",
    time: "560—570",
    events:
      "Закріплення аварів у Паннонії, яку вони зробили осередком своїх набігів на Європу.",
    eventsMarkup:
      'Закріплення аварів у <a href="/wiki/%D0%9F%D0%B0%D0%BD%D0%BD%D0%BE%D0%BD%D1%96%D1%8F" title="Паннонія">Паннонії</a>, яку вони зробили осередком своїх набігів на Європу.\n',
    eventIndex: 75,
    createdAt: "2024-01-06T17:36:32.330Z",
  },
  {
    id: "fe07d9d2-315a-4c53-8334-19263cc7fbc1",
    time: "562",
    events: "Авари у Добруджі",
    eventsMarkup:
      '<a href="/wiki/%D0%90%D0%B2%D0%B0%D1%80%D0%B8" title="Авари">Авари</a> у <a href="/wiki/%D0%94%D0%BE%D0%B1%D1%80%D1%83%D0%B4%D0%B6%D0%B0" title="Добруджа">Добруджі</a>\n',
    eventIndex: 76,
    createdAt: "2024-01-06T17:36:32.330Z",
  },
  {
    id: "6bfec5a0-0059-4fa3-ad2d-0463d84b117a",
    time: "565",
    events: "Авари у Тюрингії",
    eventsMarkup:
      '<a href="/wiki/%D0%90%D0%B2%D0%B0%D1%80%D0%B8" title="Авари">Авари</a> у <a href="/wiki/%D0%A2%D1%8E%D1%80%D0%B8%D0%BD%D0%B3%D1%96%D1%8F" title="Тюрингія">Тюрингії</a>\n',
    eventIndex: 77,
    createdAt: "2024-01-06T17:36:32.330Z",
  },
  {
    id: "a9fc951f-e4df-4d00-a3dd-fbe759bfa169",
    time: "565—578",
    events:
      "Після смерті Юстиніана в Константинополі царює Юстин ІІ (565—578 рр.)",
    eventsMarkup:
      'Після смерті <a href="/wiki/%D0%AE%D1%81%D1%82%D0%B8%D0%BD%D1%96%D0%B0%D0%BD_I" title="Юстиніан I">Юстиніана</a> в Константинополі царює <a href="/w/index.php?title=%D0%AE%D1%81%D1%82%D0%B8%D0%BD_%D0%86%D0%86&amp;action=edit&amp;redlink=1" class="new" title="Юстин ІІ (ще не написана)">Юстин ІІ</a> (565—578&nbsp;рр.)\n',
    eventIndex: 78,
    createdAt: "2024-01-06T17:36:32.330Z",
  },
  {
    id: "2c347bc0-c880-4b3d-894a-72d79253cf77",
    time: "568",
    events:
      "Авари перемогли гепідів на Дунаї, після чого повністю заволоділи Паннонією; разом з гепідами Паннонію залишили і переселились до Італії лангобарди, сармати і булгари.",
    eventsMarkup:
      'Авари перемогли <a href="/wiki/%D0%93%D0%B5%D0%BF%D1%96%D0%B4%D0%B8" title="Гепіди">гепідів</a> на Дунаї, після чого повністю заволоділи Паннонією; разом з гепідами Паннонію залишили і переселились до Італії лангобарди, сармати і булгари.\n',
    eventIndex: 79,
    createdAt: "2024-01-06T17:36:32.330Z",
  },
  {
    id: "46dfb4f1-5775-4546-9340-03f6c0483c5c",
    time: "576",
    events:
      "Взяття Боспору військами Тюркського Каганату. Занепад Боспорського царства.",
    eventsMarkup:
      'Взяття Боспору військами <b><a href="/wiki/%D0%A2%D1%8E%D1%80%D0%BA%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%BA%D0%B0%D0%B3%D0%B0%D0%BD%D0%B0%D1%82" title="Тюркський каганат">Тюркського Каганату</a></b>. Занепад <a href="/wiki/%D0%91%D0%BE%D1%81%D0%BF%D0%BE%D1%80%D1%81%D1%8C%D0%BA%D0%B0_%D0%B4%D0%B5%D1%80%D0%B6%D0%B0%D0%B2%D0%B0" title="Боспорська держава">Боспорського царства</a>.\n',
    eventIndex: 80,
    createdAt: "2024-01-06T17:36:32.331Z",
  },
  {
    id: "0e0368f0-fc2a-44fb-b038-9987690896ec",
    time: "581",
    events:
      "Облога Херсонесу тюрками. Остаточний розпад Боспорського царства на дрібні колонії.",
    eventsMarkup:
      'Облога <a href="/wiki/%D0%A5%D0%B5%D1%80%D1%81%D0%BE%D0%BD%D0%B5%D1%81" class="mw-redirect" title="Херсонес">Херсонесу</a> тюрками. Остаточний розпад Боспорського царства на дрібні колонії.\n',
    eventIndex: 81,
    createdAt: "2024-01-06T17:36:32.331Z",
  },
  {
    id: "8f9114e9-72ad-4b38-9602-87f24bf9d5ee",
    time: "588-600",
    events: "Розподіл Тюркського каганату на Східний і Західний",
    eventsMarkup:
      'Розподіл Тюркського каганату на <a href="/w/index.php?title=%D0%A1%D1%85%D1%96%D0%B4%D0%BD%D0%B8%D0%B9_%D0%A2%D1%8E%D1%80%D0%BA%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%BA%D0%B0%D0%B3%D0%B0%D0%BD%D0%B0%D1%82&amp;action=edit&amp;redlink=1" class="new" title="Східний Тюркський каганат (ще не написана)">Східний</a> і <a href="/wiki/%D0%97%D0%B0%D1%85%D1%96%D0%B4%D0%BD%D0%B8%D0%B9_%D1%82%D1%8E%D1%80%D0%BA%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%BA%D0%B0%D0%B3%D0%B0%D0%BD%D0%B0%D1%82" title="Західний тюркський каганат">Західний</a>\n',
    eventIndex: 82,
    createdAt: "2024-01-06T17:36:32.331Z",
  },
  {
    id: "4a95d8e4-598e-4b35-9223-49f58a7a54eb",
    time: "610—641",
    events: "Візантійський імператор — Іраклій",
    eventsMarkup:
      'Візантійський імператор&nbsp;— <a href="/wiki/%D0%86%D1%80%D0%B0%D0%BA%D0%BB%D1%96%D0%B9" title="Іраклій">Іраклій</a>\n',
    eventIndex: 83,
    createdAt: "2024-01-06T17:36:32.331Z",
  },
  {
    id: "de5dd45f-34c5-4d2e-b7b3-7f3cd163550f",
    time: "бл. 625",
    events: "Утворення Хозарського каганату",
    eventsMarkup:
      'Утворення <b><a href="/wiki/%D0%A5%D0%BE%D0%B7%D0%B0%D1%80%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%BA%D0%B0%D0%B3%D0%B0%D0%BD%D0%B0%D1%82" title="Хозарський каганат">Хозарського каганату</a></b>\n',
    eventIndex: 84,
    createdAt: "2024-01-06T17:36:32.331Z",
  },
  {
    id: "502b7446-e17f-492d-ab6a-889153f4b0a9",
    time: "626",
    events: "Облога Константинополя аварами та слов'янами",
    eventsMarkup: "Облога Константинополя аварами та слов'янами\n",
    eventIndex: 85,
    createdAt: "2024-01-06T17:36:32.331Z",
  },
  {
    id: "db923575-86e1-4bf3-b99c-83d19298821b",
    time: "632—665",
    events:
      "Хану Кубрату вдалося об'єднати два провідних булгарських племені кутригурів і утигурів у єдину державу створивши потужну конфедерацію. Хан Великої Булгарії Кубрат",
    eventsMarkup:
      'Хану Кубрату вдалося об\'єднати два провідних булгарських племені <a href="/wiki/%D0%9A%D1%83%D1%82%D1%80%D0%B8%D0%B3%D1%83%D1%80%D0%B8" title="Кутригури">кутригурів</a> і <a href="/wiki/%D0%A3%D1%82%D0%B8%D0%B3%D1%83%D1%80%D0%B8" title="Утигури">утигурів</a> у єдину державу створивши потужну конфедерацію. Хан <b><a href="/wiki/%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B0_%D0%91%D1%83%D0%BB%D0%B3%D0%B0%D1%80%D1%96%D1%8F" class="mw-redirect" title="Велика Булгарія">Великої Булгарії</a></b> <a href="/wiki/%D0%9A%D1%83%D0%B1%D1%80%D0%B0%D1%82" title="Кубрат">Кубрат</a>\n',
    eventIndex: 86,
    createdAt: "2024-01-06T17:36:32.331Z",
  },
  {
    id: "02b78fb7-883e-46d8-9d3c-0d71b38f1ad8",
    time: "бл.650",
    events:
      "Булгарська орда хана Аспаруха відкочувала з Приазов'я до Буджаку. Угри з Північного Кавказу перекочували на Дон і Сіверський Донець.",
    eventsMarkup:
      '\n<figure typeof="mw:File/Thumb"><a href="/wiki/%D0%A4%D0%B0%D0%B9%D0%BB:0650_Ukraine.png" class="mw-file-description"><img src="//upload.wikimedia.org/wikipedia/commons/thumb/6/60/0650_Ukraine.png/100px-0650_Ukraine.png" decoding="async" width="100" height="74" class="mw-file-element" srcset="//upload.wikimedia.org/wikipedia/commons/thumb/6/60/0650_Ukraine.png/150px-0650_Ukraine.png 1.5x, //upload.wikimedia.org/wikipedia/commons/thumb/6/60/0650_Ukraine.png/200px-0650_Ukraine.png 2x" data-file-width="1322" data-file-height="980"></a><figcaption></figcaption></figure> Булгарська орда хана <a href="/wiki/%D0%90%D1%81%D0%BF%D0%B0%D1%80%D1%83%D1%85" title="Аспарух">Аспаруха</a> відкочувала з <a href="/wiki/%D0%9F%D1%80%D0%B8%D0%B0%D0%B7%D0%BE%D0%B2%27%D1%8F" class="mw-redirect" title="Приазов\'я">Приазов\'я</a> до Буджаку. <a href="/wiki/%D0%A3%D0%B3%D0%BE%D1%80%D1%86%D1%96" title="Угорці">Угри</a> з Північного Кавказу перекочували на <a href="/wiki/%D0%94%D0%BE%D0%BD" title="Дон">Дон</a> і <a href="/wiki/%D0%A1%D1%96%D0%B2%D0%B5%D1%80%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%94%D0%BE%D0%BD%D0%B5%D1%86%D1%8C" title="Сіверський Донець">Сіверський Донець</a>.\n',
    eventIndex: 87,
    createdAt: "2024-01-06T17:36:32.331Z",
  },
  {
    id: "30401667-149c-4325-9967-2a15e2b6b27f",
    time: "655",
    events:
      "Імператор Констант ІІ (641—678) відправляє у Херсонес римського папу Мартіна у заслання.",
    eventsMarkup:
      'Імператор Констант ІІ (641—678) відправляє у Херсонес римського папу <a href="/wiki/%D0%9C%D0%B0%D1%80%D1%82%D0%B8%D0%BD_I_(%D0%BF%D0%B0%D0%BF%D0%B0)" title="Мартин I (папа)">Мартіна</a> у заслання.\n',
    eventIndex: 88,
    createdAt: "2024-01-06T17:36:32.331Z",
  },
  {
    id: "0d1bf793-5d2b-4aba-9f84-c481af778fd6",
    time: "668",
    events:
      "Розпад Великої Булгарії; її племена на чолі з синами померлого Кубрата розселяються на Волгу, Північний Кавказ, Дунай.",
    eventsMarkup:
      'Розпад Великої Булгарії; її племена на чолі з синами померлого Кубрата розселяються на Волгу, <a href="/wiki/%D0%9F%D1%96%D0%B2%D0%BD%D1%96%D1%87%D0%BD%D0%B8%D0%B9_%D0%9A%D0%B0%D0%B2%D0%BA%D0%B0%D0%B7" title="Північний Кавказ">Північний Кавказ</a>, <a href="/wiki/%D0%94%D1%83%D0%BD%D0%B0%D0%B9" title="Дунай">Дунай</a>.\n',
    eventIndex: 89,
    createdAt: "2024-01-06T17:36:32.331Z",
  },
  {
    id: "ab2ccaf4-5dae-4f5e-a07d-149c17212780",
    time: "680",
    events:
      "Булгари (хан Аспарух) перемогли візантійську армію і закріпилися на Нижньому Дунаї, де утворили свою державу. Угри поселились між Доном та Дніпром в межах Хозарського каганату",
    eventsMarkup:
      'Булгари (хан Аспарух) перемогли візантійську армію і закріпилися на Нижньому Дунаї, де утворили свою <a href="/wiki/%D0%9F%D0%B5%D1%80%D1%88%D0%B5_%D0%91%D0%BE%D0%BB%D0%B3%D0%B0%D1%80%D1%81%D1%8C%D0%BA%D0%B5_%D1%86%D0%B0%D1%80%D1%81%D1%82%D0%B2%D0%BE" title="Перше Болгарське царство">державу</a>. Угри поселились між Доном та Дніпром в межах Хозарського каганату\n',
    eventIndex: 90,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "104ae3ce-c347-4d1e-b02c-2adb4fff7922",
    time: "695",
    events: "Імператора Юстиніана ІІ повалено і заслано у Херсонес.",
    eventsMarkup:
      'Імператора Юстиніана ІІ повалено і заслано у <a href="/wiki/%D0%A5%D0%B5%D1%80%D1%81%D0%BE%D0%BD%D0%B5%D1%81" class="mw-redirect" title="Херсонес">Херсонес</a>.\n',
    eventIndex: 91,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "ea8dedc5-bd41-4177-873f-b0afc0fcd2dd",
    time: "бл.700",
    events: "Угри закріплюються на Сіверському Донці.",
    eventsMarkup:
      '<a href="/wiki/%D0%A3%D0%B3%D0%BE%D1%80%D1%86%D1%96" title="Угорці">Угри</a> закріплюються на Сіверському Донці.\n',
    eventIndex: 92,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "7e409746-1f74-406f-8548-7960c813d371",
    time: "717—741",
    events: "Правління у Візантії імператора Лева ІІІ Ісавра.",
    eventsMarkup:
      'Правління у Візантії імператора <a href="/wiki/%D0%9B%D0%B5%D0%B2_III_%D0%86%D1%81%D0%B0%D0%B2%D1%80" title="Лев III Ісавр">Лева ІІІ Ісавра</a>.\n',
    eventIndex: 93,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "302e0605-8042-41bd-9c6f-cc1ccf45cfb1",
    time: "730",
    events: "Едикт Лева ІІІ проти іконошанування.",
    eventsMarkup:
      'Едикт Лева ІІІ проти <a href="/wiki/%D0%86%D0%BA%D0%BE%D0%BD%D0%BE%D1%88%D0%B0%D0%BD%D1%83%D0%B2%D0%B0%D0%BD%D0%BD%D1%8F" title="Іконошанування">іконошанування</a>.\n',
    eventIndex: 94,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "a3847a39-f86c-41a3-a39a-b053e33bd9b3",
    time: "741—775",
    events: "Правління у Візантії імператора Костянтина V",
    eventsMarkup:
      'Правління у Візантії імператора <a href="/wiki/%D0%9A%D0%BE%D1%81%D1%82%D1%8F%D0%BD%D1%82%D0%B8%D0%BD_V" title="Костянтин V">Костянтина V</a>\n',
    eventIndex: 95,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "c363bbaf-142b-4625-9613-ae318ade4f3a",
    time: "бл.787—790",
    events:
      "Захоплення області і міста Дорос в Таврії хозарами. Антихозарське повстання в Кримській Готії на чолі з єпископом з Партеніту.",
    eventsMarkup:
      'Захоплення області і міста <a href="/wiki/%D0%94%D0%BE%D1%80%D0%BE%D1%81" class="mw-redirect" title="Дорос">Дорос</a> в Таврії <a href="/wiki/%D0%A5%D0%BE%D0%B7%D0%B0%D1%80%D0%B8" title="Хозари">хозарами</a>. Антихозарське повстання в Кримській Готії на чолі з єпископом з <a href="/wiki/%D0%9F%D0%B0%D1%80%D1%82%D0%B5%D0%BD%D1%96%D1%82" title="Партеніт">Партеніту</a>.\n',
    eventIndex: 96,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "5d73ce63-92e8-4645-bea0-731b2b08b76e",
    time: "бл. 787—790",
    events:
      "Похід дружини Бравліна з «Новагорода» на Судак у Таврії (Даний факт відомий лише з одного історичного джерела).",
    eventsMarkup:
      'Похід дружини <a href="/wiki/%D0%91%D1%80%D0%B0%D0%B2%D0%BB%D1%96%D0%BD" class="mw-redirect" title="Бравлін">Бравліна</a> з «Новагорода» на <a href="/wiki/%D0%A1%D1%83%D0%B4%D0%B0%D0%BA_(%D0%BC%D1%96%D1%81%D1%82%D0%BE)" title="Судак (місто)">Судак</a> у Таврії (Даний факт відомий лише з одного історичного джерела).\n',
    eventIndex: 97,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "37701ad5-fe2c-475a-a616-26a6b7fd9270",
    time: "796 (805)",
    events: "Знищення Аварського каганату у Паннонії франками",
    eventsMarkup:
      'Знищення <a href="/wiki/%D0%90%D0%B2%D0%B0%D1%80%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%BA%D0%B0%D0%B3%D0%B0%D0%BD%D0%B0%D1%82" title="Аварський каганат">Аварського каганату</a> у Паннонії <a href="/wiki/%D0%A4%D1%80%D0%B0%D0%BD%D0%BA%D0%B8" title="Франки">франками</a>\n',
    eventIndex: 98,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "69a8e343-6751-4be4-af6c-0b55933df31d",
    time: "829—842",
    events: "Феофіл (візантійський імператор)",
    eventsMarkup:
      '<a href="/wiki/%D0%A4%D0%B5%D0%BE%D1%84%D1%96%D0%BB_(%D0%B2%D1%96%D0%B7%D0%B0%D0%BD%D1%82%D1%96%D0%B9%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D1%96%D0%BC%D0%BF%D0%B5%D1%80%D0%B0%D1%82%D0%BE%D1%80)" title="Феофіл (візантійський імператор)">Феофіл (візантійський імператор)</a>\n',
    eventIndex: 99,
    createdAt: "2024-01-06T17:36:32.194Z",
  },
  {
    id: "a33ca303-7da2-41b5-8bf1-9d4690c085a7",
    time: "830",
    events:
      "Угри вийшли з підпорядкування Хозарського каганату, після чого переселились до Бессарабії",
    eventsMarkup:
      '<a href="/wiki/%D0%A3%D0%B3%D1%80%D0%B8" title="Угри">Угри</a> вийшли з підпорядкування Хозарського каганату, після чого переселились до Бессарабії\n',
    eventIndex: 100,
    createdAt: "2024-01-06T17:36:32.195Z",
  },
  {
    id: "a377a769-99ab-4f79-98a4-7bb750e723b8",
    time: "838",
    events: "Перше відоме руське посольство з'явилось у Константинополі",
    eventsMarkup:
      'Перше відоме <a href="/wiki/%D0%A0%D1%83%D1%81%D0%B8" class="mw-redirect" title="Руси">руське</a> посольство з\'явилось у Константинополі\n',
    eventIndex: 101,
    createdAt: "2024-01-06T17:36:32.195Z",
  },
  {
    id: "cab6f0b1-5d28-4b32-881e-2da0a2d0c6b2",
    time: "841",
    events:
      "Заснування у південній Таврії візантійської феми Кліматів — Херсона.",
    eventsMarkup:
      "Заснування у південній Таврії візантійської феми Кліматів&nbsp;— Херсона.\n",
    eventIndex: 102,
    createdAt: "2024-01-06T17:36:32.195Z",
  },
  {
    id: "61067d4a-aa8a-4cf9-945f-39da1d9a6eb5",
    time: "842—867",
    events: "Візантійський імператор Михайло ІІІ П'яниця.",
    eventsMarkup:
      'Візантійський імператор <a href="/wiki/%D0%9C%D0%B8%D1%85%D0%B0%D1%97%D0%BB_III_(%D0%B2%D1%96%D0%B7%D0%B0%D0%BD%D1%82%D1%96%D0%B9%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D1%96%D0%BC%D0%BF%D0%B5%D1%80%D0%B0%D1%82%D0%BE%D1%80)" title="Михаїл III (візантійський імператор)">Михайло ІІІ П\'яниця</a>.\n',
    eventIndex: 103,
    createdAt: "2024-01-06T17:36:32.195Z",
  },
  {
    id: "7dab7519-ef6b-4ad8-a8b0-cdbe8a8f8e5a",
    time: "859",
    events: "Сіверяни починають сплачувати данину хозарам",
    eventsMarkup:
      '<a href="/wiki/%D0%A1%D1%96%D0%B2%D0%B5%D1%80%D1%8F%D0%BD%D0%B8" title="Сіверяни">Сіверяни</a> починають сплачувати данину <a href="/wiki/%D0%A5%D0%BE%D0%B7%D0%B0%D1%80%D0%B8" title="Хозари">хозарам</a>\n',
    eventIndex: 104,
    createdAt: "2024-01-06T17:36:32.195Z",
  },
  {
    id: "9b282842-f2a6-4987-810b-db31f563bec5",
    time: "860 (або 866)",
    events:
      "Похід русів (Аскольд?) на Константинополь. Перший русько-візантійський договір.\n\nВізантійське посольство Кирила та Мефодія до Херсонесу на перемовини з хозарами.",
    eventsMarkup:
      'Похід русів (<a href="/wiki/%D0%90%D1%81%D0%BA%D0%BE%D0%BB%D1%8C%D0%B4" title="Аскольд">Аскольд</a>?) на <a href="/wiki/%D0%9A%D0%BE%D0%BD%D1%81%D1%82%D0%B0%D0%BD%D1%82%D0%B8%D0%BD%D0%BE%D0%BF%D0%BE%D0%BB%D1%8C" title="Константинополь">Константинополь</a>. Перший русько-візантійський договір.\n<p>Візантійське посольство Кирила та Мефодія до Херсонесу на перемовини з хозарами.\n</p>\n',
    eventIndex: 105,
    createdAt: "2024-01-06T17:36:32.195Z",
  },
  {
    id: "e3b05286-ade8-4bb5-87cf-f90eb94abc8d",
    time: "бл. 862",
    events:
      "Покликання варягів на Русь. Початок княжіння Рюрика (862—879) у Новгороді",
    eventsMarkup:
      'Покликання <a href="/wiki/%D0%92%D0%B0%D1%80%D1%8F%D0%B3%D0%B8" title="Варяги">варягів</a> на Русь. Початок княжіння <a href="/wiki/%D0%A0%D1%8E%D1%80%D0%B8%D0%BA" title="Рюрик">Рюрика</a> (<a href="/wiki/862" title="862">862</a>—<a href="/wiki/879" title="879">879</a>) у <a href="/wiki/%D0%9D%D0%BE%D0%B2%D0%B3%D0%BE%D1%80%D0%BE%D0%B4" class="mw-redirect" title="Новгород">Новгороді</a>\n',
    eventIndex: 106,
    createdAt: "2024-01-06T17:36:32.195Z",
  },
  {
    id: "977d96f8-2ce2-4334-b77b-bd51fe74cba5",
    time: "863",
    events:
      "Місія солунців Кирила та Мефодія в Моравії, винайдення ними слов'янської абетки",
    eventsMarkup:
      "Місія солунців Кирила та Мефодія в Моравії, винайдення ними слов'янської абетки\n",
    eventIndex: 107,
    createdAt: "2024-01-06T17:36:32.195Z",
  },
  {
    id: "511f1c5e-0776-4599-8799-7893e0522d91",
    time: "864",
    events:
      "Київ захоплюють варязькі вожді Аскольд і Дір. Рюрик прислав до Полоцька збірників данини, а Аскольд і Дір розорили Полоцьк.",
    eventsMarkup:
      '<a href="/wiki/%D0%9A%D0%B8%D1%97%D0%B2" title="Київ">Київ</a> захоплюють варязькі вожді <b><a href="/wiki/%D0%90%D1%81%D0%BA%D0%BE%D0%BB%D1%8C%D0%B4" title="Аскольд">Аскольд</a></b> і <b><a href="/wiki/%D0%94%D1%96%D1%80" title="Дір">Дір</a></b>. <a href="/wiki/%D0%A0%D1%8E%D1%80%D0%B8%D0%BA" title="Рюрик">Рюрик</a> прислав до <a href="/wiki/%D0%9F%D0%BE%D0%BB%D0%BE%D1%86%D1%8C%D0%BA" title="Полоцьк">Полоцька</a> збірників данини, а Аскольд і Дір розорили Полоцьк.\n',
    eventIndex: 108,
    createdAt: "2024-01-06T17:36:32.195Z",
  },
  {
    id: "986a4406-20f1-40f4-a00b-f5a77d987083",
    time: "866",
    events: "Невдалий похід Аскольда і Діра на Константинополь.",
    eventsMarkup:
      'Невдалий похід Аскольда і Діра на <a href="/wiki/%D0%9A%D0%BE%D0%BD%D1%81%D1%82%D0%B0%D0%BD%D1%82%D0%B8%D0%BD%D0%BE%D0%BF%D0%BE%D0%BB%D1%8C" title="Константинополь">Константинополь</a>.\n',
    eventIndex: 109,
    createdAt: "2024-01-06T17:36:32.195Z",
  },
  {
    id: "1d9aed16-ee5b-428d-a97b-092551b04608",
    time: "867",
    events:
      "Константинопольській патріарх Фотій заснував першу єпархію для іноземців — слов'ян і варягів, які прийняли християнство. Ймовірна дата «Першого хрещення Русі» (Фотієвого, або Аскольдового)",
    eventsMarkup:
      'Константинопольській <a href="/wiki/%D0%9F%D0%B0%D1%82%D1%80%D1%96%D0%B0%D1%80%D1%85" title="Патріарх">патріарх</a> Фотій заснував першу єпархію для іноземців&nbsp;— слов\'ян і <a href="/wiki/%D0%92%D0%B0%D1%80%D1%8F%D0%B3%D0%B8" title="Варяги">варягів</a>, які прийняли <a href="/wiki/%D0%A5%D1%80%D0%B8%D1%81%D1%82%D0%B8%D1%8F%D0%BD%D1%81%D1%82%D0%B2%D0%BE" title="Християнство">християнство</a>. Ймовірна дата <a href="/w/index.php?title=%D0%9F%D0%B5%D1%80%D1%88%D0%B5_%D1%85%D1%80%D0%B5%D1%89%D0%B5%D0%BD%D0%BD%D1%8F_%D0%A0%D1%83%D1%81%D1%96&amp;action=edit&amp;redlink=1" class="new" title="Перше хрещення Русі (ще не написана)">«Першого хрещення Русі»</a> (Фотієвого, або Аскольдового)\n',
    eventIndex: 110,
    createdAt: "2024-01-06T17:36:32.263Z",
  },
  {
    id: "8fbb1192-496f-4ebc-abba-e9965df7420b",
    time: "867—886",
    events: "Візантійський імператор Василій І Македонянин",
    eventsMarkup:
      'Візантійський імператор <a href="/wiki/%D0%92%D0%B0%D1%81%D0%B8%D0%BB%D1%96%D0%B9_%D0%86_%D0%9C%D0%B0%D0%BA%D0%B5%D0%B4%D0%BE%D0%BD%D1%8F%D0%BD%D0%B8%D0%BD" class="mw-redirect" title="Василій І Македонянин">Василій І Македонянин</a>\n',
    eventIndex: 111,
    createdAt: "2024-01-06T17:36:32.263Z",
  },
  {
    id: "f65df3a5-ba25-497f-8055-cb5c44c2dc5a",
    time: "879—912",
    events: "Княжіння Олега в Новгороді і Києві (з 882 ?)",
    eventsMarkup:
      'Княжіння <a href="/wiki/%D0%9E%D0%BB%D0%B5%D0%B3" title="Олег">Олега</a> в Новгороді і Києві (з 882&nbsp;?)\n',
    eventIndex: 112,
    createdAt: "2024-01-06T17:36:32.263Z",
  },
  {
    id: "11d12be7-901c-46da-8fa4-810c3cffb595",
    time: "882",
    events:
      "Здобуття Києва новгородським князем Олегом і перенос сюди його столиці. Згідно з літописом — загибель Аскольда і Діра. Перший літописний спогад про Любеч (археологічне датування міста — з початку ІХ ст.)",
    eventsMarkup:
      'Здобуття Києва новгородським князем <b><a href="/wiki/%D0%9E%D0%BB%D0%B5%D0%B3" title="Олег">Олегом</a></b> і перенос сюди його столиці. Згідно з літописом&nbsp;— загибель Аскольда і Діра. Перший літописний спогад про <b><a href="/wiki/%D0%9B%D1%8E%D0%B1%D0%B5%D1%87" title="Любеч">Любеч</a></b> (археологічне датування міста&nbsp;— з початку ІХ ст.)\n',
    eventIndex: 113,
    createdAt: "2024-01-06T17:36:32.263Z",
  },
  {
    id: "7da25a5f-c9eb-4e9e-b0c0-5940a241bd55",
    time: "883",
    events: "Олег підкорив племена древлян.",
    eventsMarkup:
      'Олег підкорив племена <a href="/wiki/%D0%94%D1%80%D0%B5%D0%B2%D0%BB%D1%8F%D0%BD%D0%B8" class="mw-redirect" title="Древляни">древлян</a>.\n',
    eventIndex: 114,
    createdAt: "2024-01-06T17:36:32.263Z",
  },
  {
    id: "16aa7404-87e5-4c21-8d5d-bd58f6810b35",
    time: "884",
    events: "Олег підкорив племена сіверян",
    eventsMarkup:
      'Олег підкорив племена <a href="/wiki/%D0%A1%D1%96%D0%B2%D0%B5%D1%80%D1%8F%D0%BD%D0%B8" title="Сіверяни">сіверян</a>\n',
    eventIndex: 115,
    createdAt: "2024-01-06T17:36:32.263Z",
  },
  {
    id: "5d684777-a8c8-40cb-b1a9-711ccfda86f3",
    time: "884—885",
    events: "Русько-хозарська війна",
    eventsMarkup: "Русько-хозарська війна\n",
    eventIndex: 116,
    createdAt: "2024-01-06T17:36:32.263Z",
  },
  {
    id: "1aeded53-b389-4e36-9d10-cbf96a785910",
    time: "885",
    events:
      "Олег підкорив племена радимичів і намагався підкорити уличів і тиверців",
    eventsMarkup:
      'Олег підкорив племена <a href="/wiki/%D0%A0%D0%B0%D0%B4%D0%B8%D0%BC%D0%B8%D1%87%D1%96" title="Радимичі">радимичів</a> і намагався підкорити <a href="/wiki/%D0%A3%D0%BB%D0%B8%D1%87%D1%96" title="Уличі">уличів</a> і <a href="/wiki/%D0%A2%D0%B8%D0%B2%D0%B5%D1%80%D1%86%D1%96" title="Тиверці">тиверців</a>\n',
    eventIndex: 117,
    createdAt: "2024-01-06T17:36:32.263Z",
  },
  {
    id: "9ccd0041-9d44-4909-a08f-3eb74c958436",
    time: "896",
    events:
      "Битва на Південному Бузі, де болгарський цар Симеон I розбив військо угрів. Під тиском печенігів угри вимушені були відкочувати до Паннонії, де незабаром створили свою державу.",
    eventsMarkup:
      '<a href="/wiki/%D0%91%D0%B8%D1%82%D0%B2%D0%B0_%D0%BD%D0%B0_%D0%9F%D1%96%D0%B2%D0%B4%D0%B5%D0%BD%D0%BD%D0%BE%D0%BC%D1%83_%D0%91%D1%83%D0%B7%D1%96" title="Битва на Південному Бузі">Битва на Південному Бузі</a>, де болгарський цар <a href="/wiki/%D0%A1%D0%B8%D0%BC%D0%B5%D0%BE%D0%BD_I" class="mw-redirect" title="Симеон I">Симеон I</a> розбив військо угрів. Під тиском печенігів угри вимушені були відкочувати до Паннонії, де незабаром створили <a href="/wiki/%D0%A3%D0%B3%D0%BE%D1%80%D1%81%D1%8C%D0%BA%D0%B5_%D0%BA%D0%BE%D1%80%D0%BE%D0%BB%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE" title="Угорське королівство">свою державу</a>.\n',
    eventIndex: 118,
    createdAt: "2024-01-06T17:36:32.263Z",
  },
  {
    id: "fb38af11-6bf4-4198-b98a-0e6bee23a15d",
    time: "898",
    events: "Угри під Києвом. Перехід угрів через Карпати у Паннонію.",
    eventsMarkup:
      '<a href="/wiki/%D0%A3%D0%B3%D1%80%D0%B8" title="Угри">Угри</a> під Києвом. Перехід угрів через <a href="/wiki/%D0%9A%D0%B0%D1%80%D0%BF%D0%B0%D1%82%D0%B8" title="Карпати">Карпати</a> у Паннонію.\n',
    eventIndex: 119,
    createdAt: "2024-01-06T17:36:32.263Z",
  },
  {
    id: "c52d8d25-7205-47bb-9a23-296e73415dcf",
    time: "907",
    events:
      "Вдалий похід Олега на Константинополь. Укладення договору.\n\nПерший літописний спогад про Чернігів і Переяслав",
    eventsMarkup:
      'Вдалий похід Олега на <a href="/wiki/%D0%9A%D0%BE%D0%BD%D1%81%D1%82%D0%B0%D0%BD%D1%82%D0%B8%D0%BD%D0%BE%D0%BF%D0%BE%D0%BB%D1%8C" title="Константинополь">Константинополь</a>. Укладення договору.\n<p>Перший літописний спогад про <b><a href="/wiki/%D0%A7%D0%B5%D1%80%D0%BD%D1%96%D0%B3%D1%96%D0%B2" title="Чернігів">Чернігів</a></b> і <b><a href="/wiki/%D0%9F%D0%B5%D1%80%D0%B5%D1%8F%D1%81%D0%BB%D0%B0%D0%B2" title="Переяслав">Переяслав</a></b>\n</p>\n',
    eventIndex: 120,
    createdAt: "2024-01-06T17:36:32.268Z",
  },
  {
    id: "1c810c18-2772-4e4c-b133-5b1655001d59",
    time: "911",
    events:
      "Другий торговельний договір Олега з Візантією, а також договір про ненапад.",
    eventsMarkup:
      "Другий торговельний договір Олега з Візантією, а також договір про ненапад.\n",
    eventIndex: 121,
    createdAt: "2024-01-06T17:36:32.268Z",
  },
  {
    id: "ce5a4d65-8f7f-4ef9-9b37-c3039f74cf69",
    time: "912—945",
    events: "Княжіння Ігоря, сина Рюрика.",
    eventsMarkup:
      'Княжіння <b><a href="/wiki/%D0%86%D0%B3%D0%BE%D1%80_%D0%A0%D1%8E%D1%80%D0%B8%D0%BA%D0%BE%D0%B2%D0%B8%D1%87" title="Ігор Рюрикович">Ігоря</a></b>, сина Рюрика.\n',
    eventIndex: 122,
    createdAt: "2024-01-06T17:36:32.268Z",
  },
  {
    id: "8ad27579-71f8-417e-9805-01eb6a81b4ff",
    time: "915",
    events: "Перший похід печенігів на Русь. Укладання миру.",
    eventsMarkup:
      'Перший похід <b><a href="/wiki/%D0%9F%D0%B5%D1%87%D0%B5%D0%BD%D1%96%D0%B3%D0%B8" title="Печеніги">печенігів</a></b> на Русь. Укладання миру.\n',
    eventIndex: 123,
    createdAt: "2024-01-06T17:36:32.268Z",
  },
  {
    id: "26fa11bb-55ca-4c8b-a556-12575930146e",
    time: "920",
    events: "Похід Ігоря на печенігів",
    eventsMarkup: "Похід Ігоря на печенігів\n",
    eventIndex: 124,
    createdAt: "2024-01-06T17:36:32.268Z",
  },
  {
    id: "7c387756-0d71-43eb-9ffd-b1ac9608b06f",
    time: "941",
    events:
      "Невдалий похід Ігоря на Константинополь, знищення руських кораблів грецьким вогнем.",
    eventsMarkup:
      'Невдалий похід Ігоря на <a href="/wiki/%D0%9A%D0%BE%D0%BD%D1%81%D1%82%D0%B0%D0%BD%D1%82%D0%B8%D0%BD%D0%BE%D0%BF%D0%BE%D0%BB%D1%8C" title="Константинополь">Константинополь</a>, знищення руських кораблів <a href="/wiki/%D0%93%D1%80%D0%B5%D1%86%D1%8C%D0%BA%D0%B8%D0%B9_%D0%B2%D0%BE%D0%B3%D0%BE%D0%BD%D1%8C" title="Грецький вогонь">грецьким вогнем</a>.\n',
    eventIndex: 125,
    createdAt: "2024-01-06T17:36:32.268Z",
  },
  {
    id: "76895714-e2de-44c7-ad00-b8f5af3116f5",
    time: "943",
    events: "Успішний похід Ігоря у Східне Закавказзя (м. Бердаа)",
    eventsMarkup: "Успішний похід Ігоря у Східне Закавказзя (м. Бердаа)\n",
    eventIndex: 126,
    createdAt: "2024-01-06T17:36:32.268Z",
  },
  {
    id: "95bad015-9270-42d7-b419-d820161c3e70",
    time: "944",
    events: "Новий, невигідний договір Русі з Візантією.",
    eventsMarkup: "Новий, невигідний договір Русі з Візантією.\n",
    eventIndex: 127,
    createdAt: "2024-01-06T17:36:32.268Z",
  },
  {
    id: "b2aecf09-3c38-42f5-9379-ce126cfbb3dc",
    time: "945",
    events:
      "Загибель князя Ігоря у Деревлянській землі під час повторного збору данини.",
    eventsMarkup:
      "Загибель князя Ігоря у Деревлянській землі під час повторного збору данини.\n",
    eventIndex: 128,
    createdAt: "2024-01-06T17:36:32.268Z",
  },
  {
    id: "627e7338-b26e-4626-aca8-2a581f783419",
    time: "945—964",
    events: "Княжіння вдови Ігоря — Ольги.",
    eventsMarkup:
      'Княжіння вдови Ігоря&nbsp;— <b><a href="/wiki/%D0%9E%D0%BB%D1%8C%D0%B3%D0%B0_(%D0%BA%D0%BD%D1%8F%D0%B3%D0%B8%D0%BD%D1%8F)" title="Ольга (княгиня)">Ольги</a></b>.\n',
    eventIndex: 129,
    createdAt: "2024-01-06T17:36:32.268Z",
  },
  {
    id: "71620a6b-ab90-4847-be90-949d0694de7a",
    time: "946",
    events: "Придушення Ольгою повстання древлян після спалення Іскоростеня.",
    eventsMarkup:
      'Придушення Ольгою повстання древлян після спалення <a href="/wiki/%D0%86%D1%81%D0%BA%D0%BE%D1%80%D0%BE%D1%81%D1%82%D0%B5%D0%BD%D1%8C" class="mw-redirect" title="Іскоростень">Іскоростеня</a>.\n',
    eventIndex: 130,
    createdAt: "2024-01-06T17:36:32.271Z",
  },
  {
    id: "e97aca37-977e-454c-ba5f-9f7bc16b13a7",
    time: "955 (957?)",
    events: "Посольство княгині Ольги до Константинополя. Хрещення Ольги.",
    eventsMarkup:
      "Посольство княгині Ольги до Константинополя. Хрещення Ольги.\n",
    eventIndex: 131,
    createdAt: "2024-01-06T17:36:32.271Z",
  },
  {
    id: "e3b6f83b-3cdc-4024-bb9e-f8ef61235856",
    time: "964—972",
    events: "Княжіння у Києві Святослава Ігоровича.",
    eventsMarkup:
      'Княжіння у Києві <b><a href="/wiki/%D0%A1%D0%B2%D1%8F%D1%82%D0%BE%D1%81%D0%BB%D0%B0%D0%B2_%D0%86%D0%B3%D0%BE%D1%80%D0%BE%D0%B2%D0%B8%D1%87" title="Святослав Ігорович">Святослава Ігоровича</a></b>.\n',
    eventIndex: 132,
    createdAt: "2024-01-06T17:36:32.271Z",
  },
  {
    id: "cf4b823d-2c46-48d0-83b0-40dcee7b70fb",
    time: "959",
    events: "Руське посольство до короля Німеччини Оттона І.",
    eventsMarkup:
      'Руське посольство до короля <a href="/wiki/%D0%A1%D0%B2%D1%8F%D1%89%D0%B5%D0%BD%D0%BD%D0%B0_%D0%A0%D0%B8%D0%BC%D1%81%D1%8C%D0%BA%D0%B0_%D0%86%D0%BC%D0%BF%D0%B5%D1%80%D1%96%D1%8F" class="mw-redirect" title="Священна Римська Імперія">Німеччини</a> <a href="/wiki/%D0%9E%D1%82%D1%82%D0%BE%D0%BD_%D0%86_%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B8%D0%B9" class="mw-redirect" title="Оттон І Великий">Оттона І</a>.\n',
    eventIndex: 133,
    createdAt: "2024-01-06T17:36:32.271Z",
  },
  {
    id: "12936d3a-57ff-4a2a-9d1d-b9a82de77fd2",
    time: "964",
    events:
      "Переможні походи Святослава проти хозар на Дон і Північний Кавказ; підпорядкування в'ятичів на Оці і Тмутаракані (Тументархана) на Тамані.",
    eventsMarkup:
      'Переможні походи Святослава проти хозар на <a href="/wiki/%D0%94%D0%BE%D0%BD" title="Дон">Дон</a> і Північний <a href="/wiki/%D0%9A%D0%B0%D0%B2%D0%BA%D0%B0%D0%B7" title="Кавказ">Кавказ</a>; підпорядкування <a href="/wiki/%D0%92%27%D1%8F%D1%82%D0%B8%D1%87%D1%96" title="В\'ятичі">в\'ятичів</a> на <a href="/wiki/%D0%9E%D0%BA%D0%B0" class="mw-redirect mw-disambig" title="Ока">Оці</a> і <a href="/wiki/%D0%A2%D0%BC%D1%83%D1%82%D0%B0%D1%80%D0%B0%D0%BA%D0%B0%D0%BD%D1%8C" class="mw-redirect" title="Тмутаракань">Тмутаракані</a> (Тументархана) на Тамані.\n',
    eventIndex: 134,
    createdAt: "2024-01-06T17:36:32.271Z",
  },
  {
    id: "9162e4e2-10f0-4c11-b85d-9e819f5e3065",
    time: "965",
    events:
      "Переможний похід Святослава на Волзьку Булгарію, здобуття її столиці. Похід по Волзі на хозар, знищення Хозарського каганату; підпорядкування ясів (роксолани) та касогів на Північному Кавказі.",
    eventsMarkup:
      'Переможний похід Святослава на <a href="/wiki/%D0%92%D0%BE%D0%BB%D0%B7%D1%8C%D0%BA%D0%B0_%D0%91%D1%83%D0%BB%D0%B3%D0%B0%D1%80%D1%96%D1%8F" class="mw-redirect" title="Волзька Булгарія">Волзьку Булгарію</a>, здобуття її столиці. Похід по Волзі на хозар, знищення <b><a href="/wiki/%D0%A5%D0%BE%D0%B7%D0%B0%D1%80%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%BA%D0%B0%D0%B3%D0%B0%D0%BD%D0%B0%D1%82" title="Хозарський каганат">Хозарського каганату</a></b>; підпорядкування ясів (<a href="/wiki/%D0%A0%D0%BE%D0%BA%D1%81%D0%BE%D0%BB%D0%B0%D0%BD%D0%B8" title="Роксолани">роксолани</a>) та <a href="/wiki/%D0%9A%D0%B0%D1%81%D0%BE%D0%B3%D0%B8" title="Касоги">касогів</a> на Північному Кавказі.\n',
    eventIndex: 135,
    createdAt: "2024-01-06T17:36:32.271Z",
  },
  {
    id: "d5741cc5-ef3b-48d1-9094-2bb9b81b7e3b",
    time: "967",
    events:
      "Святослав на прохання візантійського імператора Нікіфора Фокі здійснив вдалий похід на Дунайську Болгарію, заволодів столицею, взяв у полон кагана Бориса і переніс свою ставку у Переяславець на Дунаї. Печеніги, скориставшись відсутністю руської дружини, обложили Київ, обороною якого керувала княгиня Ольга.",
    eventsMarkup:
      'Святослав на прохання візантійського імператора Нікіфора Фокі здійснив вдалий похід на Дунайську Болгарію, заволодів столицею, взяв у полон кагана Бориса і переніс свою ставку у Переяславець на Дунаї. <a href="/wiki/%D0%9F%D0%B5%D1%87%D0%B5%D0%BD%D1%96%D0%B3%D0%B8" title="Печеніги">Печеніги</a>, скориставшись відсутністю руської дружини, обложили <a href="/wiki/%D0%9A%D0%B8%D1%97%D0%B2" title="Київ">Київ</a>, обороною якого керувала княгиня Ольга.\n',
    eventIndex: 136,
    createdAt: "2024-01-06T17:36:32.271Z",
  },
  {
    id: "01a6ab6e-7149-4710-bd0c-a2aa564017bf",
    time: "969",
    events:
      "Смерть княгині Ольги. Святослав призначає своїх синів намісниками: Володимира у Новгороді, Ярополка у Києві, Олега — у Древлянській землі.",
    eventsMarkup:
      'Смерть княгині Ольги. <a href="/wiki/%D0%A1%D0%B2%D1%8F%D1%82%D0%BE%D1%81%D0%BB%D0%B0%D0%B2" title="Святослав">Святослав</a> призначає своїх синів намісниками: Володимира у Новгороді, Ярополка у Києві, Олега&nbsp;— у Древлянській землі.\n',
    eventIndex: 137,
    createdAt: "2024-01-06T17:36:32.271Z",
  },
  {
    id: "4e747341-94d0-4331-8fa4-c00336ad1187",
    time: "970—971",
    events:
      "Військові дії Святослава у Болгарії, пограбування околиць Константинополя, 971 — облога у Доростолі; поразка і відхід з Балкан. Укладення з Візантією договору на умовах 944 р.",
    eventsMarkup:
      "Військові дії Святослава у Болгарії, пограбування околиць Константинополя, 971&nbsp;— облога у Доростолі; поразка і відхід з Балкан. Укладення з Візантією договору на умовах 944&nbsp;р.\n",
    eventIndex: 138,
    createdAt: "2024-01-06T17:36:32.271Z",
  },
  {
    id: "c53a5309-c95f-4bde-bd95-b356acadcc20",
    time: "972",
    events:
      "Напад печенігів на загін Святослава біля Дніпрових порогів і загибель князя.",
    eventsMarkup:
      'Напад печенігів на загін <a href="/wiki/%D0%A1%D0%B2%D1%8F%D1%82%D0%BE%D1%81%D0%BB%D0%B0%D0%B2" title="Святослав">Святослава</a> біля Дніпрових порогів і загибель князя.\n',
    eventIndex: 139,
    createdAt: "2024-01-06T17:36:32.271Z",
  },
  {
    id: "dd39588d-1c28-4e41-a596-4d138351ab34",
    time: "976—1025",
    events: "Візантійський імператор Василій ІІ",
    eventsMarkup: "Візантійський імператор Василій ІІ\n",
    eventIndex: 140,
    createdAt: "2024-01-06T17:36:32.318Z",
  },
  {
    id: "1fd1b57c-35d0-4847-a522-c4d2d5f7895d",
    time: "977",
    events:
      "В ході міжусобиць загинув Олег Святославич, його брат Володимир втік до Скандинавії.",
    eventsMarkup:
      'В ході міжусобиць загинув <a href="/wiki/%D0%9E%D0%BB%D0%B5%D0%B3_%D0%A1%D0%B2%D1%8F%D1%82%D0%BE%D1%81%D0%BB%D0%B0%D0%B2%D0%B8%D1%87_(%D0%BA%D0%BD%D1%8F%D0%B7%D1%8C_%D0%B4%D1%80%D0%B5%D0%B2%D0%BB%D1%8F%D0%BD%D1%81%D1%8C%D0%BA%D0%B8%D0%B9)" title="Олег Святославич (князь древлянський)">Олег Святославич</a>, його брат Володимир втік до Скандинавії.\n',
    eventIndex: 141,
    createdAt: "2024-01-06T17:36:32.318Z",
  },
  {
    id: "eb89ade9-996c-435b-b21d-53db71089f01",
    time: "979",
    events:
      "Володимир повернувся до Києва з загоном варязьких найманців і вбив свого брата Ярополка .",
    eventsMarkup:
      'Володимир повернувся до Києва з загоном варязьких найманців і вбив свого брата <a href="/wiki/%D0%AF%D1%80%D0%BE%D0%BF%D0%BE%D0%BB%D0%BA_%D0%A1%D0%B2%D1%8F%D1%82%D0%BE%D1%81%D0%BB%D0%B0%D0%B2%D0%B8%D1%87" title="Ярополк Святославич">Ярополка</a> .\n',
    eventIndex: 142,
    createdAt: "2024-01-06T17:36:32.318Z",
  },
  {
    id: "aaccc336-d501-4d9b-ac2f-6c5c189a10df",
    time: "980—1015",
    events: "Княжіння у Києві Володимира Святославича",
    eventsMarkup: "Княжіння у Києві Володимира Святославича\n",
    eventIndex: 143,
    createdAt: "2024-01-06T17:36:32.318Z",
  },
  {
    id: "d96ae486-4110-427d-8860-2451d86522a5",
    time: "981",
    events:
      "Похід Володимира на в'ятичів і їх підкорення. Конфлікт Києва з Польщею — Червенські міста (Червень, Перемишль) переходять до володінь Володимира.",
    eventsMarkup:
      'Похід Володимира на <a href="/wiki/%D0%92%27%D1%8F%D1%82%D0%B8%D1%87%D1%96" title="В\'ятичі">в\'ятичів</a> і їх підкорення. Конфлікт Києва з Польщею&nbsp;— <a href="/wiki/%D0%A7%D0%B5%D1%80%D0%B2%D0%B5%D0%BD%D1%81%D1%8C%D0%BA%D1%96_%D0%BC%D1%96%D1%81%D1%82%D0%B0" class="mw-redirect" title="Червенські міста">Червенські міста</a> (Червень, <a href="/wiki/%D0%9F%D0%B5%D1%80%D0%B5%D0%BC%D0%B8%D1%88%D0%BB%D1%8C" title="Перемишль">Перемишль</a>) переходять до володінь Володимира.\n',
    eventIndex: 144,
    createdAt: "2024-01-06T17:36:32.318Z",
  },
  {
    id: "20f1944d-5b0a-4153-8fe1-c6bbacc2b4a0",
    time: "982",
    events:
      "Похід Володимира на радимичів, які після смерті Святослава перестали платити князеві данину.",
    eventsMarkup:
      "Похід Володимира на радимичів, які після смерті Святослава перестали платити князеві данину.\n",
    eventIndex: 145,
    createdAt: "2024-01-06T17:36:32.318Z",
  },
  {
    id: "5605eedc-f2ff-493d-bdbc-f081903284da",
    time: "983",
    events:
      "Похід Володимира на ятвягів і їх підпорядкування, також взято під контроль торговельні шляхи по Бугу-Віслі і Німану.",
    eventsMarkup:
      'Похід Володимира на ятвягів і їх підпорядкування, також взято під контроль торговельні шляхи по Бугу-Віслі і <a href="/wiki/%D0%9D%D1%96%D0%BC%D0%B0%D0%BD" title="Німан">Німану</a>.\n',
    eventIndex: 146,
    createdAt: "2024-01-06T17:36:32.318Z",
  },
  {
    id: "04b7c38f-dd0b-49d1-ace7-bea06522349f",
    time: "985",
    events:
      "Похід Володимира на Волзьку Булгарію і укладання з нею договору про мир і торгівлю",
    eventsMarkup:
      "Похід Володимира на Волзьку Булгарію і укладання з нею договору про мир і торгівлю\n",
    eventIndex: 147,
    createdAt: "2024-01-06T17:36:32.318Z",
  },
  {
    id: "996bfcb3-d2c0-476c-b39f-385e6028c3c9",
    time: "987",
    events:
      "Володимир уклав союз з Візантією, отримав як наречену візантійську принцесу Ганну і прийняв християнство.",
    eventsMarkup:
      'Володимир уклав союз з Візантією, отримав як наречену візантійську принцесу Ганну і прийняв <a href="/wiki/%D0%A5%D1%80%D0%B8%D1%81%D1%82%D0%B8%D1%8F%D0%BD%D1%81%D1%82%D0%B2%D0%BE" title="Християнство">християнство</a>.\n',
    eventIndex: 148,
    createdAt: "2024-01-06T17:36:32.318Z",
  },
  {
    id: "ac2b2d26-b2c0-4450-840d-881b4ec4e540",
    time: "988",
    events:
      "Руська флотилія спрямована на допомогу Константинополю. Володимир запроваджує християнство у Києві і на Русі. Митрополитом у Києві став грек Феофілакт (?).",
    eventsMarkup:
      'Руська флотилія спрямована на допомогу Константинополю. Володимир запроваджує християнство у Києві і на Русі. <a href="/wiki/%D0%9C%D0%B8%D1%82%D1%80%D0%BE%D0%BF%D0%BE%D0%BB%D0%B8%D1%82" title="Митрополит">Митрополитом</a> у Києві став грек Феофілакт (?).\n',
    eventIndex: 149,
    createdAt: "2024-01-06T17:36:32.318Z",
  },
  {
    id: "087f1e81-405f-4430-89d8-f2a791048820",
    time: "989",
    events:
      "Після 2-місячної облоги Володимир здобув Херсонес і добився цим одруження з Ганною.",
    eventsMarkup:
      'Після 2-місячної облоги Володимир здобув <a href="/wiki/%D0%A5%D0%B5%D1%80%D1%81%D0%BE%D0%BD%D0%B5%D1%81" class="mw-redirect" title="Херсонес">Херсонес</a> і добився цим одруження з Ганною.\n',
    eventIndex: 150,
    createdAt: "2024-01-06T17:36:32.329Z",
  },
  {
    id: "bd01f949-9958-4e95-bb49-4278136750d6",
    time: "990—996",
    events:
      "Будівництво у Києві першої кам'яної церкви — Успіння Богородиці (Десятинної).",
    eventsMarkup:
      "Будівництво у Києві першої кам'яної церкви&nbsp;— Успіння Богородиці (Десятинної).\n",
    eventIndex: 151,
    createdAt: "2024-01-06T17:36:32.329Z",
  },
  {
    id: "0e4a3623-1a8b-4da4-91fa-c832b5336215",
    time: "992",
    events: "Антихристиянське повстання у Києві",
    eventsMarkup: "Антихристиянське повстання у Києві\n",
    eventIndex: 152,
    createdAt: "2024-01-06T17:36:32.329Z",
  },
  {
    id: "ee5a8660-5b49-4fcc-84a1-d3c402058297",
    time: "992—997",
    events: "Багаторазові напади печенігів на київські землі.",
    eventsMarkup: "Багаторазові напади печенігів на київські землі.\n",
    eventIndex: 153,
    createdAt: "2024-01-06T17:36:32.329Z",
  },
  {
    id: "47e14a72-1659-441d-b717-7e83e844fb2a",
    time: "996",
    events:
      "Урочисте відкриття першої у Києві кам'яної Десятинної церкви (25 травня), до якої прибули священики з Херсонеса; захоронення тут праху княгині Ольги.",
    eventsMarkup:
      'Урочисте відкриття першої у Києві кам\'яної <a href="/wiki/%D0%94%D0%B5%D1%81%D1%8F%D1%82%D0%B8%D0%BD%D0%BD%D0%B0_%D1%86%D0%B5%D1%80%D0%BA%D0%B2%D0%B0" title="Десятинна церква">Десятинної церкви</a> (25 травня), до якої прибули священики з Херсонеса; захоронення тут праху княгині Ольги.\n',
    eventIndex: 154,
    createdAt: "2024-01-06T17:36:32.329Z",
  },
  {
    id: "ae47a77a-6881-4c28-8c1c-68268cc4ce77",
    time: "997—1038",
    events:
      "Правління в Угорщині князя (з 1000 р. — короля) Іштвана І. Ліквідував племінний поділ країни і ввів королівські комітати. Отримав 1000 р. королівську корону, ввів християнство в Угорщині.",
    eventsMarkup:
      'Правління в <a href="/wiki/%D0%A3%D0%B3%D0%BE%D1%80%D1%89%D0%B8%D0%BD%D0%B0" title="Угорщина">Угорщині</a> князя (з 1000&nbsp;р.&nbsp;— короля) <a href="/wiki/%D0%86%D1%88%D1%82%D0%B2%D0%B0%D0%BD_%D0%86" class="mw-redirect" title="Іштван І">Іштвана І</a>. Ліквідував племінний поділ країни і ввів королівські комітати. Отримав 1000&nbsp;р. королівську корону, ввів <a href="/wiki/%D0%A5%D1%80%D0%B8%D1%81%D1%82%D0%B8%D1%8F%D0%BD%D1%81%D1%82%D0%B2%D0%BE" title="Християнство">християнство</a> в Угорщині.\n',
    eventIndex: 155,
    createdAt: "2024-01-06T17:36:32.329Z",
  },
  {
    id: "81ffb735-80da-43cc-8918-94df4509485e",
    time: "1006",
    events: "Торговельний договір Володимира з Волзькою Булгарією.",
    eventsMarkup: "Торговельний договір Володимира з Волзькою Булгарією.\n",
    eventIndex: 156,
    createdAt: "2024-01-06T17:36:32.329Z",
  },
  {
    id: "865a6e8d-1a18-4b6a-a9d9-56a74562855b",
    time: "1011",
    events:
      "Ймовірна дата побудови князем Володимиром Софійського собору у Києві.",
    eventsMarkup:
      'Ймовірна дата побудови князем Володимиром <a href="/wiki/%D0%A1%D0%BE%D1%84%D1%96%D0%B9%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D1%81%D0%BE%D0%B1%D0%BE%D1%80_(%D0%9A%D0%B8%D1%97%D0%B2)" title="Софійський собор (Київ)">Софійського собору</a> у Києві.\n',
    eventIndex: 157,
    createdAt: "2024-01-06T17:36:32.329Z",
  },
  {
    id: "5c4f3be4-ff03-4132-924b-79c938150af1",
    time: "1013",
    events: "Руські походи на Кавказ",
    eventsMarkup:
      'Руські походи на <a href="/wiki/%D0%9A%D0%B0%D0%B2%D0%BA%D0%B0%D0%B7" title="Кавказ">Кавказ</a>\n',
    eventIndex: 158,
    createdAt: "2024-01-06T17:36:32.329Z",
  },
  {
    id: "9b7e4430-041d-4995-8490-bf60f7022ee7",
    time: "1014",
    events: "Похід Володимира на Новгород проти сина Ярослава.",
    eventsMarkup: "Похід Володимира на Новгород проти сина Ярослава.\n",
    eventIndex: 159,
    createdAt: "2024-01-06T17:36:32.329Z",
  },
  {
    id: "360dc00a-f616-4a3d-9bf8-a0cfc4dc8644",
    time: "1015",
    events:
      "Смерть князя Володимира. Загибель у боротьбі за престол його синів Бориса і Гліба. Червенські міста переходять до Польщі — союзниці Святополка Володимировича в боротьбі за київський престол.",
    eventsMarkup:
      'Смерть князя Володимира. Загибель у боротьбі за престол його синів Бориса і Гліба. <a href="/wiki/%D0%A7%D0%B5%D1%80%D0%B2%D0%B5%D0%BD%D1%81%D1%8C%D0%BA%D1%96_%D0%BC%D1%96%D1%81%D1%82%D0%B0" class="mw-redirect" title="Червенські міста">Червенські міста</a> переходять до Польщі&nbsp;— союзниці Святополка Володимировича в боротьбі за київський престол.\n',
    eventIndex: 160,
    createdAt: "2024-01-06T17:36:32.330Z",
  },
  {
    id: "6e57b67d-90d3-4c5d-8b21-cfcc9919e392",
    time: "1015—1019",
    events: "Князь Київський — Святополк Володимирович.",
    eventsMarkup:
      'Князь Київський&nbsp;— <b><a href="/wiki/%D0%A1%D0%B2%D1%8F%D1%82%D0%BE%D0%BF%D0%BE%D0%BB%D0%BA_%D0%92%D0%BE%D0%BB%D0%BE%D0%B4%D0%B8%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B8%D1%87" class="mw-redirect" title="Святополк Володимирович">Святополк Володимирович</a></b>.\n',
    eventIndex: 161,
    createdAt: "2024-01-06T17:36:32.330Z",
  },
  {
    id: "16489570-ec15-4c84-970d-8df466b4c379",
    time: "1016—1019",
    events:
      "Міжусобна війна між синами князя Володимира князем київським Святополком і князем новгородським Ярославом. Відомі битви під Любечем 1016 р., після якої Ярослав зайняв Київ; битва на Бузі у 1018 р., в якій Ярослав зазнав поразки і битва на Альті у 1019 р., після якої київський престол остаточно залишився за Ярославом Володимировичем, а Святополк втік до Чехії.",
    eventsMarkup:
      '<b>Міжусобна війна</b> між синами князя Володимира князем київським Святополком і князем новгородським Ярославом. Відомі <a href="/wiki/%D0%91%D0%B8%D1%82%D0%B2%D0%B0_%D0%BF%D1%96%D0%B4_%D0%9B%D1%8E%D0%B1%D0%B5%D1%87%D0%B5%D0%BC" title="Битва під Любечем">битви під Любечем</a> 1016&nbsp;р., після якої Ярослав зайняв Київ; <a href="/wiki/%D0%91%D0%B8%D1%82%D0%B2%D0%B0_%D0%BD%D0%B0_%D0%91%D1%83%D0%B7%D1%96" class="mw-redirect" title="Битва на Бузі">битва на Бузі</a> у 1018&nbsp;р., в якій Ярослав зазнав поразки і <a href="/wiki/%D0%91%D0%B8%D1%82%D0%B2%D0%B0_%D0%BD%D0%B0_%D0%90%D0%BB%D1%8C%D1%82%D1%96" class="mw-disambig" title="Битва на Альті">битва на Альті</a> у 1019&nbsp;р., після якої київський престол остаточно залишився за Ярославом Володимировичем, а Святополк втік до Чехії.\n',
    eventIndex: 162,
    createdAt: "2024-01-06T17:36:32.330Z",
  },
  {
    id: "30e153c6-8ce0-497c-8cf3-bd69f8d0e7c8",
    time: "1016",
    events:
      "Битва під Любечем між Ярославом (новгородським князем з 1010 р.) і князем київським Святополком Володимировичами, в якій Святополк зазнав поразки і тимчасово втратив Київ.\n\nЕкспедиція візантійського флоту у східну Таврію проти повсталих хозар.",
    eventsMarkup:
      '<a href="/wiki/%D0%91%D0%B8%D1%82%D0%B2%D0%B0_%D0%BF%D1%96%D0%B4_%D0%9B%D1%8E%D0%B1%D0%B5%D1%87%D0%B5%D0%BC" title="Битва під Любечем">Битва під Любечем</a> між Ярославом (новгородським князем з 1010&nbsp;р.) і князем київським Святополком Володимировичами, в якій Святополк зазнав поразки і тимчасово втратив Київ.\n<p>Експедиція візантійського флоту у східну Таврію проти повсталих хозар.\n</p>\n',
    eventIndex: 163,
    createdAt: "2024-01-06T17:36:32.330Z",
  },
  {
    id: "00ab5fb4-438b-4120-b48b-9d27db4e68b9",
    time: "1017—1018",
    events:
      "Польсько-руська війна Болеслава Хороброго, який виступив на боці свого зятя князя Святополка Володимировича проти його брата Ярослава Володимировича (Мудрого). Після військової сутички на Бузі Ярослав Володимирович втік до Новгорода, а польські війська увійшли до Києва, де знов посадили на престол князя Святополка.",
    eventsMarkup:
      '<b>Польсько-руська війна</b> Болеслава Хороброго, який виступив на боці свого зятя князя Святополка Володимировича проти його брата Ярослава Володимировича (Мудрого). Після військової сутички на <b><a href="/wiki/%D0%91%D0%B8%D1%82%D0%B2%D0%B0_%D0%BD%D0%B0_%D0%91%D1%83%D0%B7%D1%96" class="mw-redirect" title="Битва на Бузі">Бузі</a></b> Ярослав Володимирович втік до Новгорода, а польські війська увійшли до Києва, де знов посадили на престол князя Святополка.\n',
    eventIndex: 164,
    createdAt: "2024-01-06T17:36:32.330Z",
  },
  {
    id: "f0442ef6-252b-4ddb-9d9a-8069cc15b25e",
    time: "1019",
    events:
      "Після поразки в битві на Альті, втечі до Чехії і смерті князя Святополка Володимировича князем у Києві стає його суперник і брат Ярослав.",
    eventsMarkup:
      'Після поразки в <a href="/wiki/%D0%91%D0%B8%D1%82%D0%B2%D0%B0_%D0%BD%D0%B0_%D0%90%D0%BB%D1%8C%D1%82%D1%96_(1019)" title="Битва на Альті (1019)">битві на Альті</a>, втечі до Чехії і смерті князя Святополка Володимировича князем у Києві стає його суперник і брат <b><a href="/wiki/%D0%AF%D1%80%D0%BE%D1%81%D0%BB%D0%B0%D0%B2_%D0%9C%D1%83%D0%B4%D1%80%D0%B8%D0%B9" title="Ярослав Мудрий">Ярослав</a></b>.\n',
    eventIndex: 165,
    createdAt: "2024-01-06T17:36:32.330Z",
  },
  {
    id: "5c56555e-90df-4e61-aae6-abf3701a4974",
    time: "1022",
    events:
      "Тмутараканьський князь Мстислав-Костянтин Володимирович Хоробрий перемагає касогів",
    eventsMarkup:
      'Тмутараканьський князь <a href="/wiki/%D0%9C%D1%81%D1%82%D0%B8%D1%81%D0%BB%D0%B0%D0%B2-%D0%9A%D0%BE%D1%81%D1%82%D1%8F%D0%BD%D1%82%D0%B8%D0%BD_%D0%92%D0%BE%D0%BB%D0%BE%D0%B4%D0%B8%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B8%D1%87" class="mw-redirect" title="Мстислав-Костянтин Володимирович">Мстислав-Костянтин Володимирович</a> Хоробрий перемагає касогів\n',
    eventIndex: 166,
    createdAt: "2024-01-06T17:36:32.330Z",
  },
  {
    id: "c0002f35-d7f3-4349-a7cf-6b2c55b8597d",
    time: "1023",
    events:
      "Похід Мстислава Володимировича Тмутараканського на Київ і оволодіння Черніговом.",
    eventsMarkup:
      "Похід Мстислава Володимировича Тмутараканського на Київ і оволодіння Черніговом.\n",
    eventIndex: 167,
    createdAt: "2024-01-06T17:36:32.330Z",
  },
  {
    id: "92d1c502-6410-4e95-b6ae-a4d8a8db0160",
    time: "1024",
    events:
      "Битва під Листвином (Чернігівщина) між Мстиславом і Ярославом Володимировичами. Ярослав зазнав поразки і за умовами Городцовського миру уступив брату Лівобережжя Дніпра з Черніговом і Переяславом, якими Мстислав володів до смерті у 1036 році.",
    eventsMarkup:
      '<a href="/wiki/%D0%9B%D0%B8%D1%81%D1%82%D0%B2%D0%B8%D0%BD%D1%81%D1%8C%D0%BA%D0%B0_%D0%B1%D0%B8%D1%82%D0%B2%D0%B0" class="mw-redirect" title="Листвинська битва">Битва під Листвином</a> (Чернігівщина) між Мстиславом і Ярославом Володимировичами. Ярослав зазнав поразки і за умовами Городцовського миру уступив брату Лівобережжя Дніпра з Черніговом і Переяславом, якими Мстислав володів до смерті у 1036 році.\n',
    eventIndex: 168,
    createdAt: "2024-01-06T17:36:32.330Z",
  },
  {
    id: "162858b6-62dd-4505-9753-430a51734707",
    time: "1025",
    events: "Польський князь Болеслав І Хоробрий приймає королівський титул",
    eventsMarkup:
      'Польський князь <a href="/wiki/%D0%91%D0%BE%D0%BB%D0%B5%D1%81%D0%BB%D0%B0%D0%B2_%D0%86_%D0%A5%D0%BE%D1%80%D0%BE%D0%B1%D1%80%D0%B8%D0%B9" class="mw-redirect" title="Болеслав І Хоробрий">Болеслав І Хоробрий</a> приймає королівський титул\n',
    eventIndex: 169,
    createdAt: "2024-01-06T17:36:32.330Z",
  },
  {
    id: "18e9043e-fc6e-41cf-ad52-aaa5ba06d898",
    time: "1029",
    events: "Похід князя Ярослава на ясів на Північному Кавказі",
    eventsMarkup: "Похід князя Ярослава на ясів на Північному Кавказі\n",
    eventIndex: 170,
    createdAt: "2024-01-06T17:36:32.338Z",
  },
  {
    id: "ce2545a5-7387-4850-a8c3-826d681a7043",
    time: "1031",
    events: "Ярослав повертає Києву Червенські міста.",
    eventsMarkup:
      'Ярослав повертає Києву <a href="/wiki/%D0%A7%D0%B5%D1%80%D0%B2%D0%B5%D0%BD%D1%81%D1%8C%D0%BA%D1%96_%D0%BC%D1%96%D1%81%D1%82%D0%B0" class="mw-redirect" title="Червенські міста">Червенські міста</a>.\n',
    eventIndex: 171,
    createdAt: "2024-01-06T17:36:32.338Z",
  },
  {
    id: "0d80556b-8a3d-4a53-8839-9a3276726f94",
    time: "1036",
    events:
      "Розгром печенігів і їх відхід на захід.\n\nПісля смерті чернігівського князя Мстислава Володимировича Лівобережжя Дніпра підпадає під владу князя Ярослава, який остаточно перебирається з Новгорода до Києва.",
    eventsMarkup:
      "Розгром печенігів і їх відхід на захід.\n<p>Після смерті чернігівського князя Мстислава Володимировича Лівобережжя Дніпра підпадає під владу князя Ярослава, який остаточно перебирається з Новгорода до Києва.\n</p>\n",
    eventIndex: 172,
    createdAt: "2024-01-06T17:36:32.338Z",
  },
  {
    id: "3f82a33b-41e1-42b2-a87b-c6ed64272292",
    time: "1036",
    events: "Спорудження Спаського собору у Чернігові",
    eventsMarkup: "Спорудження Спаського собору у Чернігові\n",
    eventIndex: 173,
    createdAt: "2024-01-06T17:36:32.338Z",
  },
  {
    id: "4c98dae7-aace-4bb4-a18b-9c611b982f11",
    time: "1037",
    events:
      "Офіційна дата завершення будівництва Софіївського собору у Києві (за останніми даними, був зведений ще за часів Володимира). Створення при ньому першої на Русі бібліотеки. Будівництво Золотих воріт у Києві, Георгіївської та Іринінської церков.",
    eventsMarkup:
      'Офіційна дата завершення будівництва Софіївського собору у Києві (за останніми даними, був зведений ще за часів Володимира). Створення при ньому першої на Русі бібліотеки. Будівництво <a href="/wiki/%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D1%96_%D0%B2%D0%BE%D1%80%D0%BE%D1%82%D0%B0_(%D0%9A%D0%B8%D1%97%D0%B2)" title="Золоті ворота (Київ)">Золотих воріт</a> у Києві, Георгіївської та Іринінської церков.\n',
    eventIndex: 174,
    createdAt: "2024-01-06T17:36:32.338Z",
  },
  {
    id: "c490a0af-bd16-4ac8-a9b1-8a36153a23db",
    time: "1039—1047",
    events: "Укладено союз Русі та Польщі",
    eventsMarkup: "Укладено союз Русі та Польщі\n",
    eventIndex: 175,
    createdAt: "2024-01-06T17:36:32.338Z",
  },
  {
    id: "2507d90a-c5da-480c-bff1-a1f7d00c66ce",
    time: "1043",
    events: "Невдалий похід князя Ярослава Володимировича на Константинополь",
    eventsMarkup:
      "Невдалий похід князя Ярослава Володимировича на Константинополь\n",
    eventIndex: 176,
    createdAt: "2024-01-06T17:36:32.338Z",
  },
  {
    id: "e77b1284-ec8e-4b7d-a492-5646fcc60109",
    time: "1044",
    events:
      "Донька князя Ярослава Ганна стає дружиною короля Франції Генріха І. У 1060—1066 — регентша при малолітньому королі Филиппі І.",
    eventsMarkup:
      "Донька князя Ярослава Ганна стає дружиною короля Франції Генріха І. У 1060—1066&nbsp;— регентша при малолітньому королі Филиппі І.\n",
    eventIndex: 177,
    createdAt: "2024-01-06T17:36:32.338Z",
  },
  {
    id: "9c63690b-8690-4c9d-bbad-2cece1d908ba",
    time: "1051",
    events:
      "Обрання нового митрополита Іларіона зборами руських єпископів. Заснування Печерського монастиря (лаври).",
    eventsMarkup:
      'Обрання нового <a href="/wiki/%D0%9C%D0%B8%D1%82%D1%80%D0%BE%D0%BF%D0%BE%D0%BB%D0%B8%D1%82" title="Митрополит">митрополита</a> Іларіона зборами руських єпископів. Заснування <a href="/wiki/%D0%9A%D0%B8%D1%94%D0%B2%D0%BE-%D0%9F%D0%B5%D1%87%D0%B5%D1%80%D1%81%D1%8C%D0%BA%D0%B0_%D0%BB%D0%B0%D0%B2%D1%80%D0%B0" title="Києво-Печерська лавра">Печерського монастиря</a> (лаври).\n',
    eventIndex: 178,
    createdAt: "2024-01-06T17:36:32.338Z",
  },
  {
    id: "eda20bb0-db4e-4560-89af-601c2b0aae31",
    time: "1054",
    events:
      "Смерть Великого князя Ярослава; фактичний розподіл Київської держави його синами на окремі уділи-вотчини. Княжити у Києві став старший син Ізяслав (1054 −1068)",
    eventsMarkup:
      'Смерть Великого князя Ярослава; фактичний розподіл Київської держави його синами на окремі уділи-вотчини. Княжити у Києві став старший син <b><a href="/wiki/%D0%86%D0%B7%D1%8F%D1%81%D0%BB%D0%B0%D0%B2" title="Ізяслав">Ізяслав</a></b> (1054 −1068)\n',
    eventIndex: 179,
    createdAt: "2024-01-06T17:36:32.338Z",
  },
  {
    id: "f2326d4e-dec5-4bbc-b9ec-7643153e4fb5",
    time: "1054",
    events:
      "Остаточний розкол християнської церкви в Європі на дві ворогуючі: католицьку і православну (ортодоксальну).",
    eventsMarkup:
      "Остаточний розкол християнської церкви в Європі на дві ворогуючі: католицьку і православну (ортодоксальну).\n",
    eventIndex: 180,
    createdAt: "2024-01-06T17:36:32.378Z",
  },
  {
    id: "588c7398-259d-4c3b-b4a5-c23b7b61d48e",
    time: "1055",
    events:
      "Перший спогад у літописах про половців (орда хана Блуша) на кордонах Русі.",
    eventsMarkup:
      'Перший спогад у літописах про <b><a href="/wiki/%D0%9F%D0%BE%D0%BB%D0%BE%D0%B2%D1%86%D1%96" title="Половці">половців</a></b> (орда хана Блуша) на кордонах Русі.\n',
    eventIndex: 181,
    createdAt: "2024-01-06T17:36:32.378Z",
  },
  {
    id: "c8a5bfff-6d1d-466e-899b-9f2c3aa782eb",
    time: "1056—1057",
    events: "Створення у Києві Остромирова Євангелія",
    eventsMarkup: "Створення у Києві Остромирова Євангелія\n",
    eventIndex: 182,
    createdAt: "2024-01-06T17:36:32.378Z",
  },
  {
    id: "6924eeaf-8860-41ac-8946-8fd8f78df9d1",
    time: "1061",
    events:
      "Перший похід половців на Русь: Всеволод Ярославич зазнав поразки від хана Іскала, розорено Переяславську землю",
    eventsMarkup:
      'Перший похід половців на Русь: <a href="/wiki/%D0%92%D1%81%D0%B5%D0%B2%D0%BE%D0%BB%D0%BE%D0%B4_%D0%AF%D1%80%D0%BE%D1%81%D0%BB%D0%B0%D0%B2%D0%B8%D1%87" title="Всеволод Ярославич">Всеволод Ярославич</a> зазнав поразки від хана Іскала, розорено <a href="/wiki/%D0%9F%D0%B5%D1%80%D0%B5%D1%8F%D1%81%D0%BB%D0%B0%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%B7%D0%B5%D0%BC%D0%BB%D1%8F" title="Переяславська земля">Переяславську землю</a>\n',
    eventIndex: 183,
    createdAt: "2024-01-06T17:36:32.378Z",
  },
  {
    id: "3d2e099b-aafe-434d-bf72-1a6972b160c0",
    time: "1068—1069",
    events:
      "Повстання у Києві і вигнання князя Ізяслава. На престол запрошено Всеслава Полоцького.",
    eventsMarkup:
      "Повстання у Києві і вигнання князя Ізяслава. На престол запрошено Всеслава Полоцького.\n",
    eventIndex: 184,
    createdAt: "2024-01-06T17:36:32.378Z",
  },
  {
    id: "1edc23fc-1fab-4e5f-a7d2-cc6917c87936",
    time: "1069",
    events: "Похід польського короля Болеслава ІІ Сміливого на Київ.",
    eventsMarkup:
      'Похід польського короля Болеслава ІІ Сміливого на <a href="/wiki/%D0%9A%D0%B8%D1%97%D0%B2" title="Київ">Київ</a>.\n',
    eventIndex: 185,
    createdAt: "2024-01-06T17:36:32.378Z",
  },
  {
    id: "b8190d33-00cc-4c46-8427-3e0fb8120f2b",
    time: "1072",
    events:
      'Вірогідна дата прийняття князями зводу законів — "Правди Ярославичів"',
    eventsMarkup:
      'Вірогідна дата прийняття князями зводу законів&nbsp;— "<a href="/wiki/%D0%9F%D1%80%D0%B0%D0%B2%D0%B4%D0%B0_%D0%AF%D1%80%D0%BE%D1%81%D0%BB%D0%B0%D0%B2%D0%B8%D1%87%D1%96%D0%B2" title="Правда Ярославичів">Правди Ярославичів</a>"\n',
    eventIndex: 186,
    createdAt: "2024-01-06T17:36:32.378Z",
  },
  {
    id: "003400df-2f2d-45c6-b2b2-94abd517a3dd",
    time: "1073",
    events:
      "Початок збройної боротьби Ярославичів за київський великокнязівський престол.",
    eventsMarkup:
      "Початок збройної боротьби Ярославичів за київський великокнязівський престол.\n",
    eventIndex: 187,
    createdAt: "2024-01-06T17:36:32.378Z",
  },
  {
    id: "e89ab86a-ee9d-4472-87a7-3c3f3d08fd33",
    time: "1073, 1076",
    events:
      "Створення найдавніших пам'яток писемності Русі — «Ізборників Святослава».",
    eventsMarkup:
      "Створення найдавніших пам'яток писемності Русі&nbsp;— «Ізборників Святослава».\n",
    eventIndex: 188,
    createdAt: "2024-01-06T17:36:32.378Z",
  },
  {
    id: "1147b2ff-c9f6-48eb-9265-c3ae7e58a377",
    time: "1078",
    events:
      "3 жовтня: Під Черніговом у битві проти князя Олега Святославича загинув київський князь Ізяслав.\n\nКиївським князем стає Всеволод Ярославич. Втручання у руські справи польського короля Болеслава ІІ",
    eventsMarkup:
      '3 жовтня: Під Черніговом у битві проти князя <a href="/wiki/%D0%9E%D0%BB%D0%B5%D0%B3_%D0%A1%D0%B2%D1%8F%D1%82%D0%BE%D1%81%D0%BB%D0%B0%D0%B2%D0%B8%D1%87" title="Олег Святославич">Олега Святославича</a> загинув київський князь Ізяслав.\n<p>Київським князем стає <a href="/wiki/%D0%92%D1%81%D0%B5%D0%B2%D0%BE%D0%BB%D0%BE%D0%B4_%D0%AF%D1%80%D0%BE%D1%81%D0%BB%D0%B0%D0%B2%D0%B8%D1%87" title="Всеволод Ярославич">Всеволод Ярославич</a>. Втручання у руські справи польського короля Болеслава ІІ\n</p>\n',
    eventIndex: 189,
    createdAt: "2024-01-06T17:36:32.378Z",
  },
  {
    id: "a960cdb1-0c5b-449d-a07c-f2c0a316fa98",
    time: "1090—1092",
    events: "Голод і мор у Києві",
    eventsMarkup: "Голод і мор у Києві\n",
    eventIndex: 190,
    createdAt: "2024-01-06T17:36:32.387Z",
  },
  {
    id: "b3501e0f-0c26-478d-805e-5b5843304f29",
    time: "1092—1094",
    events: "Війна Русі з половцями",
    eventsMarkup: "Війна Русі з половцями\n",
    eventIndex: 191,
    createdAt: "2024-01-06T17:36:32.387Z",
  },
  {
    id: "5675577b-eda5-4151-8ffb-3c9826fca743",
    time: "1097",
    events:
      "З'їзд князів у Любечі: князі Олег, Давид, Ярослав Святославичі, київський Святополк, Володимир Мономах, волинський Давид Ігорович і галицькі Ростиславичи — Володар і Василько. Вирішено питання про наслідування від батька до сина, формально визнано принцип вотчини. Перша писемна згадка про міста Теребовля, Турійськ і Буськ.",
    eventsMarkup:
      '<b><a href="/wiki/%D0%9B%D1%8E%D0%B1%D0%B5%D1%86%D1%8C%D0%BA%D0%B8%D0%B9_%D0%B7%27%D1%97%D0%B7%D0%B4_1097" title="Любецький з\'їзд 1097">З\'їзд князів у Любечі</a></b>: князі Олег, Давид, Ярослав Святославичі, київський Святополк, <a href="/wiki/%D0%92%D0%BE%D0%BB%D0%BE%D0%B4%D0%B8%D0%BC%D0%B8%D1%80_%D0%9C%D0%BE%D0%BD%D0%BE%D0%BC%D0%B0%D1%85" title="Володимир Мономах">Володимир Мономах</a>, волинський Давид Ігорович і галицькі Ростиславичи&nbsp;— <a href="/wiki/%D0%92%D0%BE%D0%BB%D0%BE%D0%B4%D0%B0%D1%80_%D0%A0%D0%BE%D1%81%D1%82%D0%B8%D1%81%D0%BB%D0%B0%D0%B2%D0%B8%D1%87" title="Володар Ростиславич">Володар</a> і <a href="/wiki/%D0%92%D0%B0%D1%81%D0%B8%D0%BB%D1%8C%D0%BA%D0%BE_%D0%A0%D0%BE%D1%81%D1%82%D0%B8%D1%81%D0%BB%D0%B0%D0%B2%D0%B8%D1%87" title="Василько Ростиславич">Василько</a>. Вирішено питання про наслідування від батька до сина, формально визнано принцип <a href="/wiki/%D0%92%D0%BE%D1%82%D1%87%D0%B8%D0%BD%D0%B0" title="Вотчина">вотчини</a>. Перша писемна згадка про міста <a href="/wiki/%D0%A2%D0%B5%D1%80%D0%B5%D0%B1%D0%BE%D0%B2%D0%BB%D1%8F" title="Теребовля">Теребовля</a>, <a href="/wiki/%D0%A2%D1%83%D1%80%D1%96%D0%B9%D1%81%D1%8C%D0%BA" title="Турійськ">Турійськ</a> і <a href="/wiki/%D0%91%D1%83%D1%81%D1%8C%D0%BA" title="Буськ">Буськ</a>.\n',
    eventIndex: 192,
    createdAt: "2024-01-06T17:36:32.387Z",
  },
  {
    id: "b95d95e9-4e8b-4b28-90c8-83714b4842ed",
    time: "1098",
    events:
      "Захоплення і осліплення князя Теребовльського Василька Ростиславича.",
    eventsMarkup:
      'Захоплення і осліплення князя <a href="/wiki/%D0%A2%D0%B5%D1%80%D0%B5%D0%B1%D0%BE%D0%B2%D0%BB%D1%8F" title="Теребовля">Теребовльського</a> Василька Ростиславича.\n',
    eventIndex: 193,
    createdAt: "2024-01-06T17:36:32.387Z",
  },
  {
    id: "c5b520bb-b0a0-4796-a5ce-218ae61c4902",
    time: "1103",
    events:
      "Долобський з'їзд князів. Рішення князів про спільні дії проти половців.",
    eventsMarkup:
      '<a href="/wiki/%D0%94%D0%BE%D0%BB%D0%BE%D0%B1%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%B7%27%D1%97%D0%B7%D0%B4" title="Долобський з\'їзд">Долобський з\'їзд</a> князів. Рішення князів про спільні дії проти половців.\n',
    eventIndex: 194,
    createdAt: "2024-01-06T17:36:32.387Z",
  },
  {
    id: "3ef7ff76-f5ee-49eb-a5e1-3109597f29ac",
    time: "1103—1120",
    events:
      "Серія походів князів Володимира і Святополка проти половців. Особливо вдалі 1103, 1107, 1111 рр.",
    eventsMarkup:
      "Серія походів князів Володимира і Святополка проти половців. Особливо вдалі 1103, 1107, 1111&nbsp;рр.\n",
    eventIndex: 195,
    createdAt: "2024-01-06T17:36:32.387Z",
  },
  {
    id: "1c6ca87a-0f87-407c-9575-0baa65866735",
    time: "1108—1113",
    events: "Спорудження Михайлівського Золотоверхого собору у Києві.",
    eventsMarkup: "Спорудження Михайлівського Золотоверхого собору у Києві.\n",
    eventIndex: 196,
    createdAt: "2024-01-06T17:36:32.387Z",
  },
  {
    id: "2b2e9fda-6f94-44c8-8a78-dbcca6f4cf46",
    time: "1110",
    events: "Часи написання «Повісті врем'яних літ»",
    eventsMarkup:
      'Часи написання <a href="/wiki/%D0%9F%D0%BE%D0%B2%D1%96%D1%81%D1%82%D1%8C_%D0%B2%D1%80%D0%B5%D0%BC%27%D1%8F%D0%BD%D0%B8%D1%85_%D0%BB%D1%96%D1%82" class="mw-redirect" title="Повість врем\'яних літ">«Повісті врем\'яних літ»</a>\n',
    eventIndex: 197,
    createdAt: "2024-01-06T17:36:32.387Z",
  },
  {
    id: "c8b35d95-6c45-44f9-bb21-8a15c69ff230",
    time: "1111",
    events: "Перемога русів над половцями при Сальниці",
    eventsMarkup: "Перемога русів над половцями при Сальниці\n",
    eventIndex: 198,
    createdAt: "2024-01-06T17:36:32.387Z",
  },
  {
    id: "fdbb91a8-293a-46b7-b78d-89c3b443cf94",
    time: "1113",
    events:
      "Смерть Святополка. Повстання залежних і кабальних людей проти князя і купців-лихварів. «Устав Володимира Всеволодовича».",
    eventsMarkup:
      "Смерть Святополка. Повстання залежних і кабальних людей проти князя і купців-лихварів. «Устав Володимира Всеволодовича».\n",
    eventIndex: 199,
    createdAt: "2024-01-06T17:36:32.387Z",
  },
  {
    id: "3b361845-7b46-4ba7-a329-7e7c2619afb4",
    time: "1113—1125",
    events: "Правління у Києві Володимира Всеволодовича Мономаха",
    eventsMarkup:
      'Правління у Києві <b><a href="/wiki/%D0%92%D0%BE%D0%BB%D0%BE%D0%B4%D0%B8%D0%BC%D0%B8%D1%80_%D0%9C%D0%BE%D0%BD%D0%BE%D0%BC%D0%B0%D1%85" title="Володимир Мономах">Володимира Всеволодовича Мономаха</a></b>\n',
    eventIndex: 200,
    createdAt: "2024-01-06T17:36:32.389Z",
  },
  {
    id: "cf74cb99-c99b-48d7-a2aa-806ca279b6a3",
    time: "1122",
    events:
      "Перемога візантійського імператора Іоанна ІІ Комніна над печенігами.",
    eventsMarkup:
      'Перемога візантійського імператора <a href="/w/index.php?title=%D0%86%D0%BE%D0%B0%D0%BD%D0%BD_%D0%86%D0%86_%D0%9A%D0%BE%D0%BC%D0%BD%D1%96%D0%BD&amp;action=edit&amp;redlink=1" class="new" title="Іоанн ІІ Комнін (ще не написана)">Іоанна ІІ Комніна</a> над печенігами.\n',
    eventIndex: 201,
    createdAt: "2024-01-06T17:36:32.389Z",
  },
  {
    id: "c8c6bbc8-a379-4573-908a-eb6ffb2ba61b",
    time: "1124—1153",
    events: "Правління у Галичині князя Володимирка",
    eventsMarkup:
      'Правління у <a href="/wiki/%D0%93%D0%B0%D0%BB%D0%B8%D1%87%D0%B8%D0%BD%D0%B0" title="Галичина">Галичині</a> князя <a href="/wiki/%D0%92%D0%BE%D0%BB%D0%BE%D0%B4%D0%B8%D0%BC%D0%B8%D1%80%D0%BA%D0%BE_%D0%92%D0%BE%D0%BB%D0%BE%D0%B4%D0%B0%D1%80%D0%BE%D0%B2%D0%B8%D1%87" title="Володимирко Володарович">Володимирка</a>\n',
    eventIndex: 202,
    createdAt: "2024-01-06T17:36:32.389Z",
  },
  {
    id: "3e13cd45-a448-44e3-92e9-4abe5b347f5d",
    time: "до 1125",
    events: "«Повчання дітям» Володимира Мономаха.",
    eventsMarkup: "«Повчання дітям» Володимира Мономаха.\n",
    eventIndex: 203,
    createdAt: "2024-01-06T17:36:32.389Z",
  },
  {
    id: "4cf6da20-0853-4937-966b-6c3277139d3b",
    time: "1125—1132",
    events: "Княжіння у Києві Мстислава Володимировича",
    eventsMarkup:
      'Княжіння у Києві <b><a href="/wiki/%D0%9C%D1%81%D1%82%D0%B8%D1%81%D0%BB%D0%B0%D0%B2_I_%D0%92%D0%BE%D0%BB%D0%BE%D0%B4%D0%B8%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B8%D1%87_(%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B8%D0%B9)" class="mw-redirect" title="Мстислав I Володимирович (Великий)">Мстислава Володимировича</a></b>\n',
    eventIndex: 204,
    createdAt: "2024-01-06T17:36:32.389Z",
  },
  {
    id: "98b66c50-aca4-4338-a897-ae4e00fef9f1",
    time: "1132",
    events:
      "Смерть Великого князя Мстислава, сина Володимира Мономаха. Остаточний розпад Русі на самостійні князівства.",
    eventsMarkup:
      "Смерть Великого князя Мстислава, сина Володимира Мономаха. <b>Остаточний розпад Русі</b> на самостійні князівства.\n",
    eventIndex: 205,
    createdAt: "2024-01-06T17:36:32.389Z",
  },
  {
    id: "42774e95-c1e0-4736-ab77-0f657e05498c",
    time: "1132—1139",
    events: "Княжіння у Києві Ярополка ІІ Володимировича",
    eventsMarkup:
      'Княжіння у Києві <a href="/wiki/%D0%AF%D1%80%D0%BE%D0%BF%D0%BE%D0%BB%D0%BA_%D0%92%D0%BE%D0%BB%D0%BE%D0%B4%D0%B8%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B8%D1%87" title="Ярополк Володимирович">Ярополка ІІ Володимировича</a>\n',
    eventIndex: 206,
    createdAt: "2024-01-06T17:36:32.389Z",
  },
  {
    id: "d42722ba-9cd1-4bbf-ba5a-9933763eea35",
    time: "1136",
    events: "Від Київського князівства відпав Новгород.",
    eventsMarkup: "Від Київського князівства відпав Новгород.\n",
    eventIndex: 207,
    createdAt: "2024-01-06T17:36:32.389Z",
  },
  {
    id: "291cec19-6c0e-4161-878d-5c3630505eb3",
    time: "1139",
    events:
      "Повстання у Києві і його захоплення Всеволодом Олеговичем (Князь у 1139—1146 рр.)",
    eventsMarkup:
      'Повстання у Києві і його захоплення <b><a href="/w/index.php?title=%D0%92%D1%81%D0%B5%D0%B2%D0%BE%D0%BB%D0%BE%D0%B4_%D0%9E%D0%BB%D0%B5%D0%B3%D0%BE%D0%B2%D0%B8%D1%87&amp;action=edit&amp;redlink=1" class="new" title="Всеволод Олегович (ще не написана)">Всеволодом Олеговичем</a></b> (Князь у 1139—1146&nbsp;рр.)\n',
    eventIndex: 208,
    createdAt: "2024-01-06T17:36:32.389Z",
  },
  {
    id: "ae82f96a-104d-4db9-998d-03706e7f834e",
    time: "1144",
    events: "Об'єднання уділів на Дністрі в Галицьке князівство.",
    eventsMarkup:
      'Об\'єднання уділів на Дністрі в <b><a href="/wiki/%D0%93%D0%B0%D0%BB%D0%B8%D1%86%D1%8C%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE" title="Галицьке князівство">Галицьке князівство</a></b>.\n',
    eventIndex: 209,
    createdAt: "2024-01-06T17:36:32.389Z",
  },
  {
    id: "c66ef7ad-4080-4527-99df-85010d4766c3",
    time: "1146—1161",
    events:
      "Збройна боротьба князівських родів (Ольговичи, Мономаховичи, Давидовичи) за Київський престол",
    eventsMarkup:
      "Збройна боротьба князівських родів (Ольговичи, Мономаховичи, Давидовичи) за Київський престол\n",
    eventIndex: 210,
    createdAt: "2024-01-06T17:36:32.389Z",
  },
  {
    id: "7dfe975d-001e-47b3-9d73-1f703b5f6d60",
    time: "1147",
    events:
      "Перші літописні спогади про міста Черкаси, Ніжин і містечко Кучково (Москов).",
    eventsMarkup:
      'Перші літописні спогади про міста <a href="/wiki/%D0%A7%D0%B5%D1%80%D0%BA%D0%B0%D1%81%D0%B8" title="Черкаси">Черкаси</a>, <a href="/wiki/%D0%9D%D1%96%D0%B6%D0%B8%D0%BD" title="Ніжин">Ніжин</a> і містечко Кучково (<a href="/wiki/%D0%9C%D0%BE%D1%81%D0%BA%D0%B2%D0%B0" title="Москва">Москов)</a>.\n',
    eventIndex: 211,
    createdAt: "2024-01-06T17:36:32.389Z",
  },
  {
    id: "ace64116-eb67-4db4-aba9-851718fe738d",
    time: "1153—1187",
    events:
      "Правління у Галицькому князівстві Ярослава Володимирковича Осмомисла; під контролем князівства опиняється територія сучасної Молдови до Чорного моря.",
    eventsMarkup:
      'Правління у Галицькому князівстві <a href="/wiki/%D0%AF%D1%80%D0%BE%D1%81%D0%BB%D0%B0%D0%B2_%D0%9E%D1%81%D0%BC%D0%BE%D0%BC%D0%B8%D1%81%D0%BB" title="Ярослав Осмомисл">Ярослава Володимирковича Осмомисла</a>; під контролем князівства опиняється територія сучасної Молдови до Чорного моря.\n',
    eventIndex: 212,
    createdAt: "2024-01-06T17:36:32.389Z",
  },
  {
    id: "327c3f59-48b9-4f33-b740-c4a8315b2129",
    time: "1157",
    events:
      "Повстання смердів у Києві.\n\nОбрання князем ростовським і суздальським Андрія Боголюбського (1157—1174).",
    eventsMarkup:
      'Повстання смердів у Києві.\n<p>Обрання князем ростовським і суздальським <a href="/wiki/%D0%90%D0%BD%D0%B4%D1%80%D1%96%D0%B9_%D0%91%D0%BE%D0%B3%D0%BE%D0%BB%D1%8E%D0%B1%D1%81%D1%8C%D0%BA%D0%B8%D0%B9" title="Андрій Боголюбський">Андрія Боголюбського</a> (1157—1174).\n</p>\n',
    eventIndex: 213,
    createdAt: "2024-01-06T17:36:32.389Z",
  },
  {
    id: "03f6921c-4a7e-424e-9b59-b2cb56454dfb",
    time: "1169",
    events:
      "Андрій Боголюбський захопив, пограбував і зруйнував Київ, після чого повернувся княжити до Суздаля. Київське князівство остаточно стало другорядним.",
    eventsMarkup:
      'Андрій Боголюбський захопив, пограбував і зруйнував <a href="/wiki/%D0%9A%D0%B8%D1%97%D0%B2" title="Київ">Київ</a>, після чого повернувся княжити до <a href="/wiki/%D0%A1%D1%83%D0%B7%D0%B4%D0%B0%D0%BB%D1%8C" title="Суздаль">Суздаля</a>. Київське князівство остаточно стало другорядним.\n',
    eventIndex: 214,
    createdAt: "2024-01-06T17:36:32.389Z",
  },
  {
    id: "dd39229e-f449-4398-8425-a64a5fa6d550",
    time: "1169",
    events:
      "Імператор Візантії Ісаак Ангел дозволив генуезцям плавати через Босфор і відвідувати Чорноморське узбережжя",
    eventsMarkup:
      '<a href="/wiki/%D0%86%D0%BC%D0%BF%D0%B5%D1%80%D0%B0%D1%82%D0%BE%D1%80" title="Імператор">Імператор</a> Візантії <a href="/w/index.php?title=%D0%86%D1%81%D0%B0%D0%B0%D0%BA_%D0%90%D0%BD%D0%B3%D0%B5%D0%BB&amp;action=edit&amp;redlink=1" class="new" title="Ісаак Ангел (ще не написана)">Ісаак Ангел</a> дозволив генуезцям плавати через <a href="/wiki/%D0%91%D0%BE%D1%81%D1%84%D0%BE%D1%80" title="Босфор">Босфор</a> і відвідувати Чорноморське узбережжя\n',
    eventIndex: 215,
    createdAt: "2024-01-06T17:36:32.389Z",
  },
  {
    id: "25f25406-88c2-4ec8-8916-8cba4cf214b1",
    time: "1173—1205",
    events:
      "Правління на Волині (а з 1199 — і в Галичині) князя Романа Мстиславича",
    eventsMarkup:
      'Правління на <a href="/wiki/%D0%92%D0%BE%D0%BB%D0%B8%D0%BD%D1%8C" title="Волинь">Волині</a> (а з 1199&nbsp;— і в Галичині) князя <b><a href="/wiki/%D0%A0%D0%BE%D0%BC%D0%B0%D0%BD_%D0%9C%D1%81%D1%82%D0%B8%D1%81%D0%BB%D0%B0%D0%B2%D0%B8%D1%87" title="Роман Мстиславич">Романа Мстиславича</a></b>\n',
    eventIndex: 216,
    createdAt: "2024-01-06T17:36:32.389Z",
  },
  {
    id: "e19cfb41-bd9d-4057-8ca4-507d4d3b51f2",
    time: "1176—1212",
    events: "Великий князь Володимирський Всеволод «Велике Гніздо»",
    eventsMarkup:
      'Великий князь Володимирський <a href="/wiki/%D0%92%D1%81%D0%B5%D0%B2%D0%BE%D0%BB%D0%BE%D0%B4_%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B5_%D0%93%D0%BD%D1%96%D0%B7%D0%B4%D0%BE" title="Всеволод Велике Гніздо">Всеволод «Велике Гніздо»</a>\n',
    eventIndex: 217,
    createdAt: "2024-01-06T17:36:32.389Z",
  },
  {
    id: "2f04c4e1-ea6d-4858-af31-8d26128b7558",
    time: "1185",
    events: "Невдалий похід князя Новгород-Сіверського Ігоря на половців",
    eventsMarkup:
      'Невдалий похід князя Новгород-Сіверського <a href="/wiki/%D0%86%D0%B3%D0%BE%D1%80_%D0%A1%D0%B2%D1%8F%D1%82%D0%BE%D1%81%D0%BB%D0%B0%D0%B2%D0%B8%D1%87" title="Ігор Святославич">Ігоря</a> на половців\n',
    eventIndex: 218,
    createdAt: "2024-01-06T17:36:32.389Z",
  },
  {
    id: "e863e0dd-b056-4b9b-8423-0f87b8294b80",
    time: "бл 1187",
    events: "Створення «Слова о полку Ігоревім»",
    eventsMarkup:
      'Створення <a href="/wiki/%D0%A1%D0%BB%D0%BE%D0%B2%D0%BE_%D0%BE_%D0%BF%D0%BE%D0%BB%D0%BA%D1%83_%D0%86%D0%B3%D0%BE%D1%80%D0%B5%D0%B2%D1%96%D0%BC" title="Слово о полку Ігоревім">«Слова о полку Ігоревім»</a>\n',
    eventIndex: 219,
    createdAt: "2024-01-06T17:36:32.389Z",
  },
  {
    id: "dd97e28d-ce38-40c4-ae18-976544c42720",
    time: "1187—1199",
    events: "Княжіння у Галичі Володимира Ярославича.",
    eventsMarkup:
      'Княжіння у <a href="/wiki/%D0%93%D0%B0%D0%BB%D0%B8%D1%87" title="Галич">Галичі</a> Володимира Ярославича.\n',
    eventIndex: 220,
    createdAt: "2024-01-06T17:36:32.390Z",
  },
  {
    id: "0f99584a-82e0-41fb-842c-95610af8ad58",
    time: "1196",
    events: "Вторгнення литовців у Волинське князівство",
    eventsMarkup:
      'Вторгнення литовців у <a href="/wiki/%D0%92%D0%BE%D0%BB%D0%B8%D0%BD%D1%81%D1%8C%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE" title="Волинське князівство">Волинське князівство</a>\n',
    eventIndex: 221,
    createdAt: "2024-01-06T17:36:32.390Z",
  },
  {
    id: "c92bd646-3fcd-4c3d-8b6b-5a7b3ff0471c",
    time: "1199",
    events:
      "Об'єднання Романом Волинським Галицького і Волинського князівств в єдине — Галицько-Волинське.",
    eventsMarkup:
      'Об\'єднання Романом Волинським <a href="/wiki/%D0%93%D0%B0%D0%BB%D0%B8%D1%86%D1%8C%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE" title="Галицьке князівство">Галицького</a> і <a href="/wiki/%D0%92%D0%BE%D0%BB%D0%B8%D0%BD%D1%81%D1%8C%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE" title="Волинське князівство">Волинського</a> князівств в єдине&nbsp;— <b><a href="/wiki/%D0%93%D0%B0%D0%BB%D0%B8%D1%86%D1%8C%D0%BA%D0%BE-%D0%92%D0%BE%D0%BB%D0%B8%D0%BD%D1%81%D1%8C%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE" title="Галицько-Волинське князівство">Галицько-Волинське</a></b>.\n',
    eventIndex: 222,
    createdAt: "2024-01-06T17:36:32.390Z",
  },
  {
    id: "bdf96ce5-1f64-47e3-8d68-725e575866b4",
    time: "1201",
    events: "Похід Романа Мстиславича Волинського на половців.",
    eventsMarkup: "Похід Романа Мстиславича Волинського на половців.\n",
    eventIndex: 223,
    createdAt: "2024-01-06T17:36:32.390Z",
  },
  {
    id: "a785678e-5eb6-4f31-ba2e-f885d27f662f",
    time: "1202",
    events: "Захоплення Романом Мстиславичем Києва.",
    eventsMarkup: "Захоплення Романом Мстиславичем Києва.\n",
    eventIndex: 224,
    createdAt: "2024-01-06T17:36:32.390Z",
  },
  {
    id: "12b1b6b0-307e-4eea-b564-5245e25589b7",
    time: "1203",
    events:
      "Рюрик Ростиславич (князь київський) за допомогою половецького війська розбив торків Романа Волинського, захопив і спалив Київ.",
    eventsMarkup:
      '<a href="/wiki/%D0%A0%D1%8E%D1%80%D0%B8%D0%BA_%D0%A0%D0%BE%D1%81%D1%82%D0%B8%D1%81%D0%BB%D0%B0%D0%B2%D0%B8%D1%87_(%D0%BA%D0%BD%D1%8F%D0%B7%D1%8C_%D0%BA%D0%B8%D1%97%D0%B2%D1%81%D1%8C%D0%BA%D0%B8%D0%B9)" class="mw-redirect" title="Рюрик Ростиславич (князь київський)">Рюрик Ростиславич (князь київський)</a> за допомогою половецького війська розбив <a href="/wiki/%D0%A2%D0%BE%D1%80%D0%BA%D0%B8" title="Торки">торків</a> Романа Волинського, захопив і спалив <a href="/wiki/%D0%9A%D0%B8%D1%97%D0%B2" title="Київ">Київ</a>.\n',
    eventIndex: 225,
    createdAt: "2024-01-06T17:36:32.390Z",
  },
  {
    id: "95053d52-94b8-4006-a1a8-a7bd9f90a918",
    time: "1204",
    events:
      "Хрестоносці під час 4-го Хрестового походу захопили і пограбували Константинополь і на частині території Візантійської імперії створили підконтрольну їм Латинську. Це, зокрема, ускладнило прохід генуезьких кораблів через Босфор.",
    eventsMarkup:
      '<a href="/wiki/%D0%A5%D1%80%D0%B5%D1%81%D1%82%D0%BE%D0%BD%D0%BE%D1%81%D1%86%D1%96" title="Хрестоносці">Хрестоносці</a> під час <a href="/wiki/%D0%A7%D0%B5%D1%82%D0%B2%D0%B5%D1%80%D1%82%D0%B8%D0%B9_%D1%85%D1%80%D0%B5%D1%81%D1%82%D0%BE%D0%B2%D0%B8%D0%B9_%D0%BF%D0%BE%D1%85%D1%96%D0%B4" title="Четвертий хрестовий похід">4-го Хрестового походу</a> захопили і пограбували <a href="/wiki/%D0%9A%D0%BE%D0%BD%D1%81%D1%82%D0%B0%D0%BD%D1%82%D0%B8%D0%BD%D0%BE%D0%BF%D0%BE%D0%BB%D1%8C" title="Константинополь">Константинополь</a> і на частині території Візантійської імперії створили підконтрольну їм <a href="/wiki/%D0%9B%D0%B0%D1%82%D0%B8%D0%BD%D1%81%D1%8C%D0%BA%D0%B0_%D1%96%D0%BC%D0%BF%D0%B5%D1%80%D1%96%D1%8F" title="Латинська імперія">Латинську</a>. Це, зокрема, ускладнило прохід генуезьких кораблів через <a href="/wiki/%D0%91%D0%BE%D1%81%D1%84%D0%BE%D1%80" title="Босфор">Босфор</a>.\n',
    eventIndex: 226,
    createdAt: "2024-01-06T17:36:32.390Z",
  },
  {
    id: "a63f0d09-d509-4909-982b-f652bdf2e5e4",
    time: "1205",
    events:
      "Під час польського походу князь Галицький Роман Мстиславич потрапив у засідку і загинув; вдову князя Ганну з двома малолітніми синами Данилом та Васильком галицькі бояри вигнали, а княжити запросили трьох Ігоревичів з Сіверщини. Битва чернігівських князів з литовцями.",
    eventsMarkup:
      'Під час польського походу князь Галицький <a href="/wiki/%D0%A0%D0%BE%D0%BC%D0%B0%D0%BD_%D0%9C%D1%81%D1%82%D0%B8%D1%81%D0%BB%D0%B0%D0%B2%D0%B8%D1%87" title="Роман Мстиславич">Роман Мстиславич</a> потрапив у засідку і загинув; вдову князя Ганну з двома малолітніми синами <a href="/wiki/%D0%94%D0%B0%D0%BD%D0%B8%D0%BB%D0%BE_%D0%93%D0%B0%D0%BB%D0%B8%D1%86%D1%8C%D0%BA%D0%B8%D0%B9" title="Данило Галицький">Данилом</a> та <a href="/wiki/%D0%92%D0%B0%D1%81%D0%B8%D0%BB%D1%8C%D0%BA%D0%BE_%D0%A0%D0%BE%D0%BC%D0%B0%D0%BD%D0%BE%D0%B2%D0%B8%D1%87" title="Василько Романович">Васильком</a> галицькі бояри вигнали, а княжити запросили трьох Ігоревичів з Сіверщини. Битва чернігівських князів з литовцями.\n',
    eventIndex: 227,
    createdAt: "2024-01-06T17:36:32.390Z",
  },
  {
    id: "78318cac-11e2-4a63-93a2-32c9ae77909f",
    time: "1206",
    events:
      "Венеційці закріплюються в Солдаї (Судаку), якою володіють спільно з половцями (кипчаками)",
    eventsMarkup:
      '<a href="/wiki/%D0%92%D0%B5%D0%BD%D0%B5%D1%86%D1%96%D1%8F" title="Венеція">Венеційці</a> закріплюються в <a href="/wiki/%D0%9A%D0%BE%D0%BD%D1%81%D1%83%D0%BB%D1%8C%D1%81%D1%82%D0%B2%D0%BE_%D0%A1%D0%BE%D0%BB%D0%B4%D0%B0%D1%8F" title="Консульство Солдая">Солдаї</a> (<a href="/wiki/%D0%A1%D1%83%D0%B4%D0%B0%D0%BA_(%D0%BC%D1%96%D1%81%D1%82%D0%BE)" title="Судак (місто)">Судаку</a>), якою володіють спільно з <a href="/wiki/%D0%9F%D0%BE%D0%BB%D0%BE%D0%B2%D1%86%D1%96" title="Половці">половцями</a> (кипчаками)\n',
    eventIndex: 228,
    createdAt: "2024-01-06T17:36:32.390Z",
  },
  {
    id: "c10b2532-3a99-4d79-9d6b-426afd40e737",
    time: "1213",
    events:
      "Галицькі бояри посадили на престол Володислава Кормильчича, що призвело до польсько-угорського вторгнення в Галичину.\n\nПоловці прийняли у себе меркітів, з якими монголи знаходились у стані війни",
    eventsMarkup:
      'Галицькі бояри посадили на престол <a href="/wiki/%D0%92%D0%BE%D0%BB%D0%BE%D0%B4%D0%B8%D1%81%D0%BB%D0%B0%D0%B2_%D0%9A%D0%BE%D1%80%D0%BC%D0%B8%D0%BB%D1%8C%D1%87%D0%B8%D1%87" class="mw-redirect" title="Володислав Кормильчич">Володислава Кормильчича</a>, що призвело до польсько-угорського вторгнення в Галичину.\n<p><a href="/wiki/%D0%9F%D0%BE%D0%BB%D0%BE%D0%B2%D1%86%D1%96" title="Половці">Половці</a> прийняли у себе <a href="/wiki/%D0%9C%D0%B5%D1%80%D0%BA%D1%96%D1%82%D0%B8" title="Меркіти">меркітів</a>, з якими <a href="/wiki/%D0%9C%D0%BE%D0%BD%D0%B3%D0%BE%D0%BB%D0%B8" title="Монголи">монголи</a> знаходились у стані війни\n</p>\n',
    eventIndex: 229,
    createdAt: "2024-01-06T17:36:32.390Z",
  },
  {
    id: "8d4a37fc-5099-425e-82b7-999d4936abea",
    time: "1214",
    events:
      "Спішська угода Угорщини і Польщі щодо галицько-волинських земель і прихід до Галича угорського королевича Коломана.",
    eventsMarkup:
      'Спішська угода Угорщини і Польщі щодо галицько-волинських земель і прихід до <a href="/wiki/%D0%93%D0%B0%D0%BB%D0%B8%D1%87" title="Галич">Галича</a> угорського королевича <a href="/wiki/%D0%9A%D0%BE%D0%BB%D0%BE%D0%BC%D0%B0%D0%BD_%D0%93%D0%B0%D0%BB%D0%B8%D1%86%D1%8C%D0%BA%D0%B8%D0%B9" title="Коломан Галицький">Коломана</a>.\n',
    eventIndex: 230,
    createdAt: "2024-01-06T17:36:32.397Z",
  },
  {
    id: "da386c06-d3d5-41d2-a0d2-2783da75cda4",
    time: "1215",
    events: "Василько та Данило Романовичі повернули собі м. Володимир",
    eventsMarkup: "Василько та Данило Романовичі повернули собі м. Володимир\n",
    eventIndex: 231,
    createdAt: "2024-01-06T17:36:32.397Z",
  },
  {
    id: "b85232d3-aca3-4f23-89f9-189488ce07b3",
    time: "1217",
    events: "Набіг сельджуків на Судак",
    eventsMarkup:
      'Набіг <a href="/wiki/%D0%A1%D0%B5%D0%BB%D1%8C%D0%B4%D0%B6%D1%83%D0%BA%D0%B8" title="Сельджуки">сельджуків</a> на <a href="/wiki/%D0%A1%D1%83%D0%B4%D0%B0%D0%BA_(%D0%BC%D1%96%D1%81%D1%82%D0%BE)" title="Судак (місто)">Судак</a>\n',
    eventIndex: 232,
    createdAt: "2024-01-06T17:36:32.397Z",
  },
  {
    id: "e9292bb4-cb27-485a-8229-dcb622eb68fc",
    time: "1221",
    events: "Данило Романович почав княжити на Волині",
    eventsMarkup:
      '<a href="/wiki/%D0%94%D0%B0%D0%BD%D0%B8%D0%BB%D0%BE_%D0%A0%D0%BE%D0%BC%D0%B0%D0%BD%D0%BE%D0%B2%D0%B8%D1%87" class="mw-redirect" title="Данило Романович">Данило Романович</a> почав княжити на <a href="/wiki/%D0%92%D0%BE%D0%BB%D0%B8%D0%BD%D1%8C" title="Волинь">Волині</a>\n',
    eventIndex: 233,
    createdAt: "2024-01-06T17:36:32.397Z",
  },
  {
    id: "9f40f8db-0ab9-4435-944c-d9c5d88452a8",
    time: "1223",
    events:
      "Монгольські загони Субедея та Джебе беруть Судак . 31 травня — битва на річці Калка: об'єднані сили руських і половецьких князів розбиті монгольськими загонами під командуванням Субедея і Джебе.",
    eventsMarkup:
      'Монгольські загони <a href="/wiki/%D0%A1%D1%83%D0%B1%D1%83%D0%B4%D0%B0%D0%B9" class="mw-redirect" title="Субудай">Субедея</a> та <a href="/wiki/%D0%94%D0%B6%D0%B5%D0%B1%D0%B5" title="Джебе">Джебе</a> беруть <a href="/wiki/%D0%A1%D1%83%D0%B4%D0%B0%D0%BA_(%D0%BC%D1%96%D1%81%D1%82%D0%BE)" title="Судак (місто)">Судак</a> . 31 травня&nbsp;— <b><a href="/wiki/%D0%91%D0%B8%D1%82%D0%B2%D0%B0_%D0%BD%D0%B0_%D1%80%D1%96%D1%87%D1%86%D1%96_%D0%9A%D0%B0%D0%BB%D0%BA%D0%B0" class="mw-redirect" title="Битва на річці Калка">битва на річці Калка</a></b>: об\'єднані сили руських і половецьких князів розбиті монгольськими загонами під командуванням Субедея і Джебе.\n',
    eventIndex: 234,
    createdAt: "2024-01-06T17:36:32.397Z",
  },
  {
    id: "80841007-52a9-40e9-bba3-2292a0ec3fbb",
    time: "1224",
    events: "Виникнення князівства у литовців",
    eventsMarkup:
      'Виникнення князівства у <a href="/wiki/%D0%9B%D0%B8%D1%82%D0%BE%D0%B2%D1%86%D1%96" title="Литовці">литовців</a>\n',
    eventIndex: 235,
    createdAt: "2024-01-06T17:36:32.397Z",
  },
  {
    id: "2fc0b451-3cc6-4926-9d1e-68ab566a3bcd",
    time: "1230",
    events:
      "Голод і мор по «всій землі Руській». Данило та Василько Романовичі оволоділи Волинню.",
    eventsMarkup:
      "Голод і мор по «всій землі Руській». Данило та Василько Романовичі оволоділи Волинню.\n",
    eventIndex: 236,
    createdAt: "2024-01-06T17:36:32.397Z",
  },
  {
    id: "5cfb1c1c-696d-45de-9c19-e09038c77820",
    time: "1231—1238",
    events: "Війна Данила та Василька Романовичів з угорцями за Галичину.",
    eventsMarkup:
      "Війна Данила та Василька Романовичів з угорцями за Галичину.\n",
    eventIndex: 237,
    createdAt: "2024-01-06T17:36:32.397Z",
  },
  {
    id: "8905a0de-7407-4228-b748-33ca97f271f2",
    time: "1238 (1237?)",
    events:
      "Битва під Дорогочином: Данило Галицький розбив німецьких лицарів Добжинського ордену.",
    eventsMarkup:
      '<a href="/wiki/%D0%91%D0%B8%D1%82%D0%B2%D0%B0_%D0%BF%D1%96%D0%B4_%D0%94%D0%BE%D1%80%D0%BE%D0%B3%D0%BE%D1%87%D0%B8%D0%BD%D0%BE%D0%BC" class="mw-redirect" title="Битва під Дорогочином">Битва під Дорогочином</a>: Данило Галицький розбив німецьких <a href="/wiki/%D0%9B%D0%B8%D1%86%D0%B0%D1%80%D1%96" class="mw-redirect" title="Лицарі">лицарів</a> <a href="/wiki/%D0%94%D0%BE%D0%B1%D0%B6%D0%B8%D0%BD%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%BE%D1%80%D0%B4%D0%B5%D0%BD" class="mw-redirect" title="Добжинський орден">Добжинського ордену</a>.\n',
    eventIndex: 238,
    createdAt: "2024-01-06T17:36:32.397Z",
  },
  {
    id: "b7a0e1f8-25a0-43b4-81aa-358a3ded9ef2",
    time: "1238",
    events:
      "Данило Романович Галицький повернув собі Галич з частиною князівства. Похід галичан на Литву.",
    eventsMarkup:
      'Данило Романович Галицький повернув собі <a href="/wiki/%D0%93%D0%B0%D0%BB%D0%B8%D1%87" title="Галич">Галич</a> з частиною князівства. Похід галичан на <a href="/wiki/%D0%9B%D0%B8%D1%82%D0%B2%D0%B0" title="Литва">Литву</a>.\n',
    eventIndex: 239,
    createdAt: "2024-01-06T17:36:32.397Z",
  },
  {
    id: "05ac11f2-6a8d-4cb1-b9c1-020b81d0e3dc",
    time: "1239",
    events:
      "Монголо-татари здійснили руйнівний похід по Ростово-Суздальській та Чернігівській землям, а у Таврії захопили і пограбували Судак. Києвом заволодів Данило Романович Галицький і призначив сюди свого воєводу Дмитра.",
    eventsMarkup:
      '<a href="/wiki/%D0%9C%D0%BE%D0%BD%D0%B3%D0%BE%D0%BB%D0%BE-%D1%82%D0%B0%D1%82%D0%B0%D1%80%D0%B8" class="mw-redirect" title="Монголо-татари">Монголо-татари</a> здійснили руйнівний похід по <a href="/wiki/%D0%92%D0%BE%D0%BB%D0%BE%D0%B4%D0%B8%D0%BC%D0%B8%D1%80%D1%81%D1%8C%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE" class="mw-redirect" title="Володимирське князівство">Ростово-Суздальській</a> та <a href="/wiki/%D0%A7%D0%B5%D1%80%D0%BD%D1%96%D0%B3%D1%96%D0%B2%D1%81%D1%8C%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE" title="Чернігівське князівство">Чернігівській</a> землям, а у Таврії захопили і пограбували Судак. Києвом заволодів Данило Романович Галицький і призначив сюди свого воєводу Дмитра.\n',
    eventIndex: 240,
    createdAt: "2024-01-06T17:36:32.438Z",
  },
  {
    id: "8b7fc77c-cae2-47a4-a67e-15d4d9ae78e4",
    time: "1240",
    events:
      "Монголо-татарські орди на чолі з ханом Батиєм зруйнували Київ (6 грудня), інші південно-руські міста, обклали руські землі даниною і вдерлись до Центральної Європи (1241).",
    eventsMarkup:
      'Монголо-татарські орди на чолі з ханом <a href="/wiki/%D0%91%D0%B0%D1%82%D0%B8%D0%B9" title="Батий">Батиєм</a> зруйнували Київ (6 грудня), інші південно-руські міста, обклали руські землі даниною і вдерлись до Центральної Європи (1241).\n',
    eventIndex: 241,
    createdAt: "2024-01-06T17:36:32.438Z",
  },
  {
    id: "ace590c4-2695-4501-b840-8cb228934526",
    time: "1242",
    events:
      "Після походу по землям Польщі, Угорщини, Словаччини, Хорватії хан Батий з військом повернувся степом на Нижню Волгу, де заснував свою державу — Золоту Орду, до складу якої потрапили, зокрема, і нинішні південно-українські степові регіони з Таврією.",
    eventsMarkup:
      'Після походу по землям Польщі, Угорщини, Словаччини, Хорватії хан Батий з військом повернувся степом на Нижню Волгу, де заснував свою державу&nbsp;— <b><a href="/wiki/%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B0_%D0%9E%D1%80%D0%B4%D0%B0" title="Золота Орда">Золоту Орду</a></b>, до складу якої потрапили, зокрема, і нинішні південно-українські степові регіони з Таврією.\n',
    eventIndex: 242,
    createdAt: "2024-01-06T17:36:32.438Z",
  },
  {
    id: "33fde6be-495a-4a33-8f0c-249b680bab63",
    time: "1243",
    events:
      "Перша поїздка руського князя (Ярослава Всеволодовича) до ставки монгольського хана за ярликом на княжіння.",
    eventsMarkup:
      'Перша поїздка руського князя (<a href="/wiki/%D0%AF%D1%80%D0%BE%D1%81%D0%BB%D0%B0%D0%B2_III_%D0%92%D1%81%D0%B5%D0%B2%D0%BE%D0%BB%D0%BE%D0%B4%D0%BE%D0%B2%D0%B8%D1%87" class="mw-redirect" title="Ярослав III Всеволодович">Ярослава Всеволодовича</a>) до ставки монгольського хана за <a href="/wiki/%D0%AF%D1%80%D0%BB%D0%B8%D0%BA_(%D0%B3%D1%80%D0%B0%D0%BC%D0%BE%D1%82%D0%B0)" title="Ярлик (грамота)">ярликом</a> на княжіння.\n',
    eventIndex: 243,
    createdAt: "2024-01-06T17:36:32.438Z",
  },
  {
    id: "84440d0c-c2b6-4a4f-9dc6-3e9ad5a87a77",
    time: "1245",
    events:
      "17 серпня — битва під Ярославом: перемога галицького війська над угорцями і поляками. Данило Романович підпорядкував собі всю Галичину.",
    eventsMarkup:
      '17 серпня&nbsp;— <a href="/wiki/%D0%91%D0%B8%D1%82%D0%B2%D0%B0_%D0%BF%D1%96%D0%B4_%D0%AF%D1%80%D0%BE%D1%81%D0%BB%D0%B0%D0%B2%D0%BE%D0%BC" title="Битва під Ярославом">битва під Ярославом</a>: перемога галицького війська над угорцями і поляками. Данило Романович підпорядкував собі всю Галичину.\n',
    eventIndex: 244,
    createdAt: "2024-01-06T17:36:32.438Z",
  },
  {
    id: "43c154f8-6e0b-403a-8f56-ef50bb8b350e",
    time: "1246",
    events:
      "Данило Романович відвідав столицю Орди — Сарай-Бату де вимушений був визнати себе підлеглим хана Батия.\n\nПодорож Плано Карпіні через Чехію, Польщу, Русь (Володимир, Київ) і Дон до Сарая і Монголії.",
    eventsMarkup:
      'Данило Романович відвідав столицю Орди&nbsp;— <a href="/wiki/%D0%A1%D0%B0%D1%80%D0%B0%D0%B9-%D0%91%D0%B0%D1%82%D1%83" title="Сарай-Бату">Сарай-Бату</a> де вимушений був визнати себе підлеглим хана Батия.\n<p>Подорож <a href="/wiki/%D0%9F%D0%BB%D0%B0%D0%BD%D0%BE_%D0%9A%D0%B0%D1%80%D0%BF%D1%96%D0%BD%D1%96" class="mw-redirect" title="Плано Карпіні">Плано Карпіні</a> через Чехію, Польщу, Русь (Володимир, Київ) і Дон до Сарая і <a href="/wiki/%D0%9C%D0%BE%D0%BD%D0%B3%D0%BE%D0%BB%D1%96%D1%8F" title="Монголія">Монголії</a>.\n</p>\n',
    eventIndex: 245,
    createdAt: "2024-01-06T17:36:32.438Z",
  },
  {
    id: "d3a776d4-584c-4573-bb5c-9b51baa68ed8",
    time: "1247",
    events:
      "На зворотному шляху з Монголії Плано Карпіні відвідав Київ (10-15 червня), де зустрівся з галицько-волинськими князями Васильком та Данилом Романовичами.",
    eventsMarkup:
      'На зворотному шляху з Монголії Плано Карпіні відвідав Київ (10-15 червня), де зустрівся з галицько-волинськими князями <a href="/wiki/%D0%92%D0%B0%D1%81%D0%B8%D0%BB%D1%8C%D0%BA%D0%BE_%D0%A0%D0%BE%D0%BC%D0%B0%D0%BD%D0%BE%D0%B2%D0%B8%D1%87" title="Василько Романович">Васильком</a> та Данилом Романовичами.\n',
    eventIndex: 246,
    createdAt: "2024-01-06T17:36:32.438Z",
  },
  {
    id: "ac5fda80-76f1-4e97-89df-175b2588d3a9",
    time: "1250",
    events: "Хрещення литовського князя Міндовга і союз з німцями.",
    eventsMarkup:
      'Хрещення литовського князя <a href="/wiki/%D0%9C%D1%96%D0%BD%D0%B4%D0%BE%D0%B2%D0%B3" title="Міндовг">Міндовга</a> і союз з німцями.\n',
    eventIndex: 247,
    createdAt: "2024-01-06T17:36:32.438Z",
  },
  {
    id: "a9595a7b-f2e2-4f24-9065-ad3d6d4e0c7d",
    time: "1253",
    events:
      "Папський посланник Опізо в Дорогичині коронує Данила Романовича «Королем Руським»\n\nПодорож монаха Гійома де Рубрука з Аккри через Крим (Солдайя — Перекоп) і Сарай-Бату до Каракорума",
    eventsMarkup:
      'Папський посланник <a href="/w/index.php?title=%D0%9E%D0%BF%D1%96%D0%B7%D0%BE&amp;action=edit&amp;redlink=1" class="new" title="Опізо (ще не написана)">Опізо</a> в Дорогичині коронує Данила Романовича «Королем Руським»\n<p>Подорож монаха Гійома де <a href="/wiki/%D0%A0%D1%83%D0%B1%D1%80%D1%83%D0%BA" class="mw-redirect" title="Рубрук">Рубрука</a> з Аккри через <a href="/wiki/%D0%9A%D1%80%D0%B8%D0%BC" title="Крим">Крим</a> (Солдайя&nbsp;— Перекоп) і <a href="/wiki/%D0%A1%D0%B0%D1%80%D0%B0%D0%B9-%D0%91%D0%B0%D1%82%D1%83" title="Сарай-Бату">Сарай-Бату</a> до <a href="/wiki/%D0%9A%D0%B0%D1%80%D0%B0%D0%BA%D0%BE%D1%80%D1%83%D0%BC" title="Каракорум">Каракорума</a>\n</p>\n',
    eventIndex: 248,
    createdAt: "2024-01-06T17:36:32.438Z",
  },
  {
    id: "e127699e-b5bb-4e69-8be8-9ba78002bb32",
    time: "1254",
    events: "Похід Данила Галицького на Київ.",
    eventsMarkup:
      'Похід Данила Галицького на <a href="/wiki/%D0%9A%D0%B8%D1%97%D0%B2" title="Київ">Київ</a>.\n',
    eventIndex: 249,
    createdAt: "2024-01-06T17:36:32.438Z",
  },
  {
    id: "7bb8c98a-e458-4b1b-a056-28f97f99e2af",
    time: "1256",
    events: "Перший спогад про Львів",
    eventsMarkup:
      'Перший спогад про <b><a href="/wiki/%D0%9B%D1%8C%D0%B2%D1%96%D0%B2" title="Львів">Львів</a></b>\n',
    eventIndex: 250,
    createdAt: "2024-01-06T17:36:32.450Z",
  },
  {
    id: "26790338-ad88-4b37-a0f5-90407ae89291",
    time: "1257",
    events: "Татарський перепис населення Русі.",
    eventsMarkup: "Татарський перепис населення Русі.\n",
    eventIndex: 251,
    createdAt: "2024-01-06T17:36:32.450Z",
  },
  {
    id: "2ffb4c8b-9312-4b7e-9027-2ece8fba6d14",
    time: "1259",
    events:
      "Похід хана Бурундая на південно-західну Русь і Польщу. Данило Романович вимушений підтвердити свою вірність монголам і знищити укріплення своїх міст, а також узяти участь в спільному поході на Литву.",
    eventsMarkup:
      'Похід хана Бурундая на південно-західну Русь і Польщу. <a href="/wiki/%D0%94%D0%B0%D0%BD%D0%B8%D0%BB%D0%BE_%D0%A0%D0%BE%D0%BC%D0%B0%D0%BD%D0%BE%D0%B2%D0%B8%D1%87" class="mw-redirect" title="Данило Романович">Данило Романович</a> вимушений підтвердити свою вірність монголам і знищити укріплення своїх міст, а також узяти участь в спільному поході на Литву.\n',
    eventIndex: 252,
    createdAt: "2024-01-06T17:36:32.450Z",
  },
  {
    id: "e17c05fa-5a99-474c-8246-2fe54a44d0c3",
    time: "1259",
    events:
      "Подорож Маффео і Ніколо Поло (Батька Марко Поло) через Солдайю і Перекоп до Сарая, Бухари і Ханбалика.",
    eventsMarkup:
      'Подорож Маффео і Ніколо Поло (Батька Марко Поло) через Солдайю і <a href="/wiki/%D0%9F%D0%B5%D1%80%D0%B5%D0%BA%D0%BE%D0%BF%D1%81%D1%8C%D0%BA%D0%B0_%D1%84%D0%BE%D1%80%D1%82%D0%B5%D1%86%D1%8F" title="Перекопська фортеця">Перекоп</a> до Сарая, <a href="/wiki/%D0%91%D1%83%D1%85%D0%B0%D1%80%D0%B0" title="Бухара">Бухари</a> і <a href="/wiki/%D0%A5%D0%B0%D0%BD%D0%B1%D0%B0%D0%BB%D0%B8%D0%BA" title="Ханбалик">Ханбалика</a>.\n',
    eventIndex: 253,
    createdAt: "2024-01-06T17:36:32.450Z",
  },
  {
    id: "1d4b55e6-44d3-43ca-8fbb-a7927b6b4610",
    time: "1261",
    events:
      "Генуя та Візантія укладають Німфейскій договір, за яким генуезці отримують виключне право на плавання в Чорному морі в обмін на допомогу Візантії при відвоюванні Константинополя. Відновлення Візантійської імперії: відвоювання Константинополя (щоправда, допомога Генуї не знадобилася)",
    eventsMarkup:
      '<a href="/wiki/%D0%93%D0%B5%D0%BD%D1%83%D1%8F" title="Генуя">Генуя</a> та <a href="/wiki/%D0%92%D1%96%D0%B7%D0%B0%D0%BD%D1%82%D1%96%D1%8F" class="mw-redirect" title="Візантія">Візантія</a> укладають <a href="/w/index.php?title=%D0%9D%D1%96%D0%BC%D1%84%D0%B5%D0%B9%D1%81%D0%BA%D1%96%D0%B9_%D0%B4%D0%BE%D0%B3%D0%BE%D0%B2%D1%96%D1%80&amp;action=edit&amp;redlink=1" class="new" title="Німфейскій договір (ще не написана)">Німфейскій договір</a>, за яким генуезці отримують виключне право на плавання в Чорному морі в обмін на допомогу Візантії при відвоюванні Константинополя. Відновлення Візантійської імперії: відвоювання Константинополя (щоправда, допомога Генуї не знадобилася)\n',
    eventIndex: 254,
    createdAt: "2024-01-06T17:36:32.450Z",
  },
  {
    id: "0e230ba1-0f30-4b34-a603-641d746208e8",
    time: "1264",
    events:
      "Після смерті Данила Романовича галицьким князем стає його син Лев (1264—1301).",
    eventsMarkup:
      'Після смерті Данила Романовича галицьким князем стає його син <b><a href="/wiki/%D0%9B%D0%B5%D0%B2_%D0%94%D0%B0%D0%BD%D0%B8%D0%BB%D0%BE%D0%B2%D0%B8%D1%87" title="Лев Данилович">Лев</a></b> (1264—1301).\n',
    eventIndex: 255,
    createdAt: "2024-01-06T17:36:32.450Z",
  },
  {
    id: "2559f22c-5453-4b46-87f5-7ff513c94f60",
    time: "1265",
    events:
      "Для противаги Генуї візантійський імператор допускає в Чорне море також і венеційців",
    eventsMarkup:
      'Для противаги Генуї візантійський імператор допускає в Чорне море також і <a href="/wiki/%D0%92%D0%B5%D0%BD%D0%B5%D1%86%D1%96%D1%8F" title="Венеція">венеційців</a>\n',
    eventIndex: 256,
    createdAt: "2024-01-06T17:36:32.450Z",
  },
  {
    id: "6361d3d3-5593-4d07-8f0a-87fbc9116a62",
    time: "1266",
    events:
      "Генуезці засновують свою першу і головну колонію в Причорномор'ї — Кафу (на місці давньої Феодосії)",
    eventsMarkup:
      '<a href="/wiki/%D0%93%D0%B5%D0%BD%D1%83%D0%B5%D0%B7%D1%86%D1%96" class="mw-redirect" title="Генуезці">Генуезці</a> засновують свою першу і головну колонію в Причорномор\'ї&nbsp;— <a href="/wiki/%D0%9A%D0%B0%D1%84%D0%B0" class="mw-redirect" title="Кафа">Кафу</a> (на місці давньої Феодосії)\n',
    eventIndex: 257,
    createdAt: "2024-01-06T17:36:32.450Z",
  },
  {
    id: "50d9dafb-5bf7-45b2-beb2-33baadd273e2",
    time: "1270",
    events:
      "Після смерті Василька Романовича волинським князем стає його син Володимир (1270—1289)\n\nУ Львові з'явилась вірменська колонія (можливо, кримських вірмен).",
    eventsMarkup:
      'Після смерті Василька Романовича волинським князем стає його син <a href="/wiki/%D0%92%D0%BE%D0%BB%D0%BE%D0%B4%D0%B8%D0%BC%D0%B8%D1%80_%D0%92%D0%B0%D1%81%D0%B8%D0%BB%D1%8C%D0%BA%D0%BE%D0%B2%D0%B8%D1%87" title="Володимир Василькович">Володимир</a> (1270—1289)\n<p>У Львові з\'явилась <a href="/wiki/%D0%92%D1%96%D1%80%D0%BC%D0%B5%D0%BD%D0%B8" title="Вірмени">вірменська</a> колонія (можливо, кримських вірмен).\n</p>\n',
    eventIndex: 258,
    createdAt: "2024-01-06T17:36:32.450Z",
  },
  {
    id: "fd2bc78a-85b9-4848-be02-f459dd50783a",
    time: "1275",
    events: "Татарсько-галицький похід на Литву.",
    eventsMarkup: "Татарсько-галицький похід на Литву.\n",
    eventIndex: 259,
    createdAt: "2024-01-06T17:36:32.450Z",
  },
  {
    id: "0b4eb552-e6c9-461a-af3c-b6c7a22619fe",
    time: "1277",
    events:
      "Татарський беклярбек Ногай звернувся з пропозицією союзу до Володимира Васильковича Волинського, Льва Даниловича Галицького і Мстислава Даниловича Луцького і провів з ними спільний похід на Литву.",
    eventsMarkup:
      'Татарський беклярбек <a href="/wiki/%D0%9D%D0%BE%D0%B3%D0%B0%D0%B9" title="Ногай">Ногай</a> звернувся з пропозицією союзу до Володимира Васильковича Волинського, Льва Даниловича Галицького і Мстислава Даниловича Луцького і провів з ними спільний похід на Литву.\n',
    eventIndex: 260,
    createdAt: "2024-01-06T17:36:32.450Z",
  },
  {
    id: "b08cddee-7aab-40d3-8637-17bd8c4cd1ef",
    time: "1279",
    events:
      "Князь Лев Данилович за допомогою військ Ногая намагався захопити Сандомир у Польщі.",
    eventsMarkup:
      'Князь <a href="/wiki/%D0%9B%D0%B5%D0%B2_%D0%94%D0%B0%D0%BD%D0%B8%D0%BB%D0%BE%D0%B2%D0%B8%D1%87" title="Лев Данилович">Лев Данилович</a> за допомогою військ Ногая намагався захопити <a href="/wiki/%D0%A1%D0%B0%D0%BD%D0%B4%D0%BE%D0%BC%D0%B8%D1%80" title="Сандомир">Сандомир</a> у Польщі.\n',
    eventIndex: 261,
    createdAt: "2024-01-06T17:36:32.450Z",
  },
  {
    id: "679e1fa3-ac4f-4947-9d63-b1153fc00a2f",
    time: "1285—1287",
    events:
      "Похід золотоординського хана Тулабуга, темніка Ногая і руських князів на Польщу.",
    eventsMarkup:
      'Похід золотоординського хана <a href="/w/index.php?title=%D0%A2%D1%83%D0%BB%D0%B0%D0%B1%D1%83%D0%B3%D0%B0&amp;action=edit&amp;redlink=1" class="new" title="Тулабуга (ще не написана)">Тулабуга</a>, темніка <a href="/wiki/%D0%9D%D0%BE%D0%B3%D0%B0%D0%B9" title="Ногай">Ногая</a> і руських князів на Польщу.\n',
    eventIndex: 262,
    createdAt: "2024-01-06T17:36:32.450Z",
  },
  {
    id: "8a89ca8a-5959-48be-a999-df548666d9e8",
    time: "1287",
    events: "Венеційський консул у Солдаї",
    eventsMarkup:
      'Венеційський <a href="/wiki/%D0%9A%D0%BE%D0%BD%D1%81%D1%83%D0%BB" title="Консул">консул</a> у <a href="/wiki/%D0%9A%D0%BE%D0%BD%D1%81%D1%83%D0%BB%D1%8C%D1%81%D1%82%D0%B2%D0%BE_%D0%A1%D0%BE%D0%BB%D0%B4%D0%B0%D1%8F" title="Консульство Солдая">Солдаї</a>\n',
    eventIndex: 263,
    createdAt: "2024-01-06T17:36:32.450Z",
  },
  {
    id: "970aabde-f3be-43ec-b11d-33fae7c529c8",
    time: "1288",
    events:
      "Генуезька колонія в Монкастро (Самастро)\n\nПовідомляється про похід темника Ногая на Польщу, у якому його супроводжували князі Лев Данилович і Мстислав Данилович (або 1291 рік)",
    eventsMarkup:
      'Генуезька <a href="/wiki/%D0%9A%D0%BE%D0%BB%D0%BE%D0%BD%D1%96%D1%8F" title="Колонія">колонія</a> в <a href="/wiki/%D0%9C%D0%BE%D0%BD%D0%BA%D0%B0%D1%81%D1%82%D1%80%D0%BE" class="mw-redirect" title="Монкастро">Монкастро</a> (<a href="/w/index.php?title=%D0%A1%D0%B0%D0%BC%D0%B0%D1%81%D1%82%D1%80%D0%BE&amp;action=edit&amp;redlink=1" class="new" title="Самастро (ще не написана)">Самастро</a>)\n<p>Повідомляється про похід <a href="/wiki/%D0%A2%D0%B5%D0%BC%D0%BD%D0%B8%D0%BA_(%D0%B2%D1%96%D0%B9%D1%81%D1%8C%D0%BA%D0%BE%D0%B2%D0%B5_%D0%B7%D0%B2%D0%B0%D0%BD%D0%BD%D1%8F)" title="Темник (військове звання)">темника</a> <a href="/wiki/%D0%9D%D0%BE%D0%B3%D0%B0%D0%B9" title="Ногай">Ногая</a> на Польщу, у якому його супроводжували князі <a href="/wiki/%D0%9B%D0%B5%D0%B2_%D0%94%D0%B0%D0%BD%D0%B8%D0%BB%D0%BE%D0%B2%D0%B8%D1%87" title="Лев Данилович">Лев Данилович</a> і <a href="/wiki/%D0%9C%D1%81%D1%82%D0%B8%D1%81%D0%BB%D0%B0%D0%B2_%D0%94%D0%B0%D0%BD%D0%B8%D0%BB%D0%BE%D0%B2%D0%B8%D1%87" title="Мстислав Данилович">Мстислав Данилович</a> (або 1291 рік)\n</p>\n',
    eventIndex: 264,
    createdAt: "2024-01-06T17:36:32.450Z",
  },
  {
    id: "d3d16158-4644-40d6-b073-f5f4863d21e4",
    time: "1298",
    events:
      "Ординський намісник Придунав'я беклярбек Ногай розбив у пониззі Сіверського Дінця військо хана Золотої Орди Тохти і став на короткий термін правителем ординських земель від Дунаю до Дону",
    eventsMarkup:
      'Ординський намісник Придунав\'я <a href="/wiki/%D0%91%D0%B5%D0%BA%D0%BB%D1%8F%D1%80%D0%B1%D0%B5%D0%BA" title="Беклярбек">беклярбек</a> <a href="/wiki/%D0%9D%D0%BE%D0%B3%D0%B0%D0%B9" title="Ногай">Ногай</a> розбив у пониззі Сіверського Дінця військо хана <a href="/wiki/%D0%97%D0%BE%D0%BB%D0%BE%D1%82%D0%B0_%D0%9E%D1%80%D0%B4%D0%B0" title="Золота Орда">Золотої Орди</a> <a href="/wiki/%D0%A2%D0%BE%D1%85%D1%82%D0%B0" title="Тохта">Тохти</a> і став на короткий термін правителем ординських земель від Дунаю до <a href="/wiki/%D0%94%D0%BE%D0%BD" title="Дон">Дону</a>\n',
    eventIndex: 265,
    createdAt: "2024-01-06T17:36:32.450Z",
  },
  {
    id: "4d8dff5e-c3e9-4e8d-8f4e-462c2ca1eff8",
    time: "1299",
    events:
      "Судак захоплено татарським темником Ногаєм. Також розорені Кирк-Ор, Херсонес, Кафа, Черкіо.\n\nБеклярбек Ногай розбитий золотоординським ханом Тохтою в районі Куяльника (нинішня Одеська область) і наступного року вбитий.",
    eventsMarkup:
      '<a href="/wiki/%D0%A1%D1%83%D0%B4%D0%B0%D0%BA_(%D0%BC%D1%96%D1%81%D1%82%D0%BE)" title="Судак (місто)">Судак</a> захоплено татарським <a href="/wiki/%D0%A2%D0%B5%D0%BC%D0%BD%D0%B8%D0%BA_(%D0%B2%D1%96%D0%B9%D1%81%D1%8C%D0%BA%D0%BE%D0%B2%D0%B5_%D0%B7%D0%B2%D0%B0%D0%BD%D0%BD%D1%8F)" title="Темник (військове звання)">темником</a> <a href="/wiki/%D0%9D%D0%BE%D0%B3%D0%B0%D0%B9" title="Ногай">Ногаєм</a>. Також розорені <a href="/wiki/%D0%9A%D0%B8%D1%80%D0%BA-%D0%9E%D1%80" class="mw-redirect" title="Кирк-Ор">Кирк-Ор</a>, <a href="/wiki/%D0%A5%D0%B5%D1%80%D1%81%D0%BE%D0%BD%D0%B5%D1%81" class="mw-redirect" title="Херсонес">Херсонес</a>, <a href="/wiki/%D0%9A%D0%B0%D1%84%D0%B0" class="mw-redirect" title="Кафа">Кафа</a>, <a href="/wiki/%D0%9A%D0%B5%D1%80%D1%87" title="Керч">Черкіо</a>.\n<p><a href="/wiki/%D0%91%D0%B5%D0%BA%D0%BB%D1%8F%D1%80%D0%B1%D0%B5%D0%BA" title="Беклярбек">Беклярбек</a> <a href="/wiki/%D0%9D%D0%BE%D0%B3%D0%B0%D0%B9" title="Ногай">Ногай</a> розбитий золотоординським <a href="/wiki/%D0%A5%D0%B0%D0%BD" title="Хан">ханом</a> <a href="/wiki/%D0%A2%D0%BE%D1%85%D1%82%D0%B0" title="Тохта">Тохтою</a> в районі <a href="/wiki/%D0%9A%D1%83%D1%8F%D0%BB%D1%8C%D0%BD%D0%B8%D0%BA" title="Куяльник">Куяльника</a> (нинішня <a href="/wiki/%D0%9E%D0%B4%D0%B5%D1%81%D1%8C%D0%BA%D0%B0_%D0%BE%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D1%8C" title="Одеська область">Одеська область</a>) і наступного року вбитий.\n</p>\n',
    eventIndex: 266,
    createdAt: "2024-01-06T17:36:32.450Z",
  },
  {
    id: "551e9b93-637c-4a7c-aa3d-357c08465616",
    time: "1300",
    events:
      "Стараннями володимирських князів митрополію перенесено з Києва до Володимира (митрополит Максим)\n\nНа північному заході Малої Азії утворився бейлік Османа — ядро майбутньої Османської імперії",
    eventsMarkup:
      'Стараннями <a href="/wiki/%D0%92%D0%BE%D0%BB%D0%BE%D0%B4%D0%B8%D0%BC%D0%B8%D1%80%D1%81%D1%8C%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE" class="mw-redirect" title="Володимирське князівство">володимирських</a> князів митрополію перенесено з Києва до Володимира (<a href="/wiki/%D0%9C%D0%B8%D1%82%D1%80%D0%BE%D0%BF%D0%BE%D0%BB%D0%B8%D1%82" title="Митрополит">митрополит</a> Максим)\n<p>На північному заході Малої Азії утворився <a href="/wiki/%D0%91%D0%B5%D0%B9%D0%BB%D1%96%D0%BA" class="mw-redirect" title="Бейлік">бейлік</a> <a href="/wiki/%D0%9E%D1%81%D0%BC%D0%B0%D0%BD" class="mw-disambig" title="Осман">Османа</a>&nbsp;— ядро майбутньої Османської імперії\n</p>\n',
    eventIndex: 267,
    createdAt: "2024-01-06T17:36:32.450Z",
  },
  {
    id: "a2ef636c-836f-459c-bb58-3a06cf54f1f3",
    time: "1302",
    events: "У війні з Польщею Юрій Львович втратив Люблінську землю",
    eventsMarkup: "У війні з Польщею Юрій Львович втратив Люблінську землю\n",
    eventIndex: 268,
    createdAt: "2024-01-06T17:36:32.450Z",
  },
  {
    id: "e6ce17f7-b043-4660-a032-a47118c820a8",
    time: "1301—1308",
    events:
      "Остання піднесення Галицько-Волинського князівства за князя (короля) Юрія Львовича",
    eventsMarkup:
      'Остання піднесення <a href="/wiki/%D0%93%D0%B0%D0%BB%D0%B8%D1%86%D1%8C%D0%BA%D0%BE-%D0%92%D0%BE%D0%BB%D0%B8%D0%BD%D1%81%D1%8C%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE" title="Галицько-Волинське князівство">Галицько-Волинського князівства</a> за князя (короля) <b><a href="/wiki/%D0%AE%D1%80%D1%96%D0%B9_%D0%9B%D1%8C%D0%B2%D0%BE%D0%B2%D0%B8%D1%87" title="Юрій Львович">Юрія Львовича</a></b>\n',
    eventIndex: 269,
    createdAt: "2024-01-06T17:36:32.450Z",
  },
  {
    id: "33a1ea0e-ad3c-45ac-a92b-d37fcefe8d59",
    time: "1303",
    events:
      "Галицький князь Юрій Львович добився від Константинополя дозволу на створення окремої митрополії в Галичині (після переїзду Київського митрополита у 1300 р. до Володимира на Клязьмі), з перервами існувала до 1347 р., пізніше відновлювалась.",
    eventsMarkup:
      'Галицький князь <a href="/wiki/%D0%AE%D1%80%D1%96%D0%B9_%D0%9B%D1%8C%D0%B2%D0%BE%D0%B2%D0%B8%D1%87" title="Юрій Львович">Юрій Львович</a> добився від Константинополя дозволу на <b>створення окремої <a href="/wiki/%D0%93%D0%B0%D0%BB%D0%B8%D1%86%D1%8C%D0%BA%D0%B0_%D0%BC%D0%B8%D1%82%D1%80%D0%BE%D0%BF%D0%BE%D0%BB%D1%96%D1%8F" class="mw-redirect" title="Галицька митрополія">митрополії</a> в Галичині</b> (після переїзду Київського митрополита у 1300&nbsp;р. до Володимира на Клязьмі), з перервами існувала до 1347&nbsp;р., пізніше відновлювалась.\n',
    eventIndex: 270,
    createdAt: "2024-01-06T17:36:32.451Z",
  },
  {
    id: "45f92a22-4ba1-4ecb-865f-f7954a73cc8f",
    time: "1318",
    events:
      "Заснування Кафської католицької єпархії. Генуезці закріплюються у Воспоро (Черкіо)",
    eventsMarkup:
      'Заснування Кафської католицької <a href="/wiki/%D0%84%D0%BF%D0%B0%D1%80%D1%85%D1%96%D1%8F" title="Єпархія">єпархії</a>. Генуезці закріплюються у <a href="/wiki/%D0%92%D0%BE%D1%81%D0%BF%D0%BE%D1%80%D0%BE" title="Воспоро">Воспоро</a> (Черкіо)\n',
    eventIndex: 271,
    createdAt: "2024-01-06T17:36:32.451Z",
  },
  {
    id: "a69d01a0-bcca-41dd-a10e-065cac028c28",
    time: "1320",
    events:
      "Битва на річці Ірпінь: литовський князь Гедимін розбив руське військо і зайняв Київ (або 1321)",
    eventsMarkup:
      '<a href="/wiki/%D0%91%D0%B8%D1%82%D0%B2%D0%B0_%D0%BD%D0%B0_%D1%80%D1%96%D1%87%D1%86%D1%96_%D0%86%D1%80%D0%BF%D1%96%D0%BD%D1%8C" title="Битва на річці Ірпінь">Битва на річці Ірпінь</a>: литовський князь <a href="/wiki/%D0%93%D0%B5%D0%B4%D0%B8%D0%BC%D1%96%D0%BD" title="Гедимін">Гедимін</a> розбив руське військо і зайняв <a href="/w/index.php?title=%D0%9A%D0%B8%D1%97%D0%B2_(%D0%94%D0%BE%D1%96%D1%81%D1%82%D0%BE%D1%80%D0%B8%D1%87%D0%BD%D0%B0,_%D0%B0%D0%BD%D1%82%D0%B8%D1%87%D0%BD%D0%B0_%D0%B4%D0%BE%D0%B1%D0%B0_%D1%96_%D1%81%D0%B5%D1%80%D0%B5%D0%B4%D0%BD%D1%8C%D0%BE%D0%B2%D1%96%D1%87%D1%87%D1%8F)&amp;action=edit&amp;redlink=1" class="new" title="Київ (Доісторична, антична доба і середньовіччя) (ще не написана)">Київ</a> (або 1321)\n',
    eventIndex: 272,
    createdAt: "2024-01-06T17:36:32.451Z",
  },
  {
    id: "c0a3a964-b24f-4a85-8e4d-2d52c4b6d811",
    time: "1322",
    events: "Перша писемна згадка про місто Мізоч",
    eventsMarkup:
      'Перша писемна згадка про місто <a href="/wiki/%D0%9C%D1%96%D0%B7%D0%BE%D1%87" title="Мізоч">Мізоч</a>\n',
    eventIndex: 273,
    createdAt: "2024-01-06T17:36:32.451Z",
  },
  {
    id: "f8fe254e-a46c-45f5-88ab-2dfa5c5ab7a6",
    time: "1325",
    events:
      "Галицьким князем бояри обрали Болеслава II (Юрія) Мазовецького (1325—1340)",
    eventsMarkup:
      "Галицьким князем бояри обрали Болеслава II (Юрія) Мазовецького (1325—1340)\n",
    eventIndex: 274,
    createdAt: "2024-01-06T17:36:32.451Z",
  },
  {
    id: "d259a6d2-2fc5-4c76-95c4-6f1faf6313cd",
    time: "1330",
    events: "Декілька тисяч вірмен переселяються з Ак-Сарая до Кафи.",
    eventsMarkup:
      'Декілька тисяч вірмен переселяються з Ак-Сарая до <a href="/wiki/%D0%9A%D0%B0%D1%84%D0%B0" class="mw-redirect" title="Кафа">Кафи</a>.\n',
    eventIndex: 275,
    createdAt: "2024-01-06T17:36:32.451Z",
  },
  {
    id: "7cfd8a8f-d2e5-4bc2-999f-12bb23b9b202",
    time: "1332",
    events: "Заснування католицьких єпархій в Воспоро і Сарсоне (Херсонесі)",
    eventsMarkup:
      'Заснування <a href="/wiki/%D0%9A%D0%B0%D1%82%D0%BE%D0%BB%D0%B8%D1%86%D1%8C%D0%BA%D0%B0_%D1%86%D0%B5%D1%80%D0%BA%D0%B2%D0%B0" title="Католицька церква">католицьких</a> єпархій в <a href="/wiki/%D0%92%D0%BE%D1%81%D0%BF%D0%BE%D1%80%D0%BE" title="Воспоро">Воспоро</a> і Сарсоне (<a href="/wiki/%D0%A5%D0%B5%D1%80%D1%81%D0%BE%D0%BD%D0%B5%D1%81" class="mw-redirect" title="Херсонес">Херсонесі</a>)\n',
    eventIndex: 276,
    createdAt: "2024-01-06T17:36:32.451Z",
  },
  {
    id: "72e94414-097b-453a-8cbc-37b0070365c1",
    time: "1333",
    events: "Правління в Польщі Казимира ІІІ Великого (1333—1370)",
    eventsMarkup:
      'Правління в Польщі <a href="/wiki/%D0%9A%D0%B0%D0%B7%D0%B8%D0%BC%D0%B8%D1%80_%D0%86%D0%86%D0%86" class="mw-redirect" title="Казимир ІІІ">Казимира ІІІ Великого</a> (1333—1370)\n',
    eventIndex: 277,
    createdAt: "2024-01-06T17:36:32.451Z",
  },
  {
    id: "8c5105c2-22ba-49a9-967b-f055a448718c",
    time: "1334",
    events:
      "Арабський мандрівник і купець Ібн-Батутта прослідував через Кафу і Солхат (Крим) на Азов (Тану) і далі до ставки ординського хана Узбека на Північному Кавказі.",
    eventsMarkup:
      'Арабський мандрівник і купець <a href="/w/index.php?title=%D0%86%D0%B1%D0%BD-%D0%91%D0%B0%D1%82%D1%83%D1%82%D1%82%D0%B0&amp;action=edit&amp;redlink=1" class="new" title="Ібн-Батутта (ще не написана)">Ібн-Батутта</a> прослідував через <a href="/wiki/%D0%9A%D0%B0%D1%84%D0%B0" class="mw-redirect" title="Кафа">Кафу</a> і <a href="/wiki/%D0%A1%D0%BE%D0%BB%D1%85%D0%B0%D1%82" class="mw-redirect" title="Солхат">Солхат</a> (Крим) на Азов (Тану) і далі до ставки ординського <a href="/wiki/%D0%A5%D0%B0%D0%BD" title="Хан">хана</a> <a href="/wiki/%D0%A3%D0%B7%D0%B1%D0%B5%D0%BA" class="mw-redirect" title="Узбек">Узбека</a> на Північному Кавказі.\n',
    eventIndex: 278,
    createdAt: "2024-01-06T17:36:32.451Z",
  },
  {
    id: "a0994af4-77d5-4e4d-9faf-d7c1685092cd",
    time: "1339",
    events: "Санок, перше з руських міст, отримав Магдебурзьке право.",
    eventsMarkup:
      '<a href="/wiki/%D0%A1%D0%B0%D0%BD%D0%BE%D0%BA" class="mw-redirect" title="Санок">Санок</a>, перше з руських міст, отримав <b><a href="/wiki/%D0%9C%D0%B0%D0%B3%D0%B4%D0%B5%D0%B1%D1%83%D1%80%D0%B7%D1%8C%D0%BA%D0%B5_%D0%BF%D1%80%D0%B0%D0%B2%D0%BE" title="Магдебурзьке право">Магдебурзьке право</a></b>.\n',
    eventIndex: 279,
    createdAt: "2024-01-06T17:36:32.451Z",
  },
  {
    id: "c8146fcb-d38f-4d40-81cf-163141bafcfc",
    time: "1340",
    events:
      "Бояри отруїли галицького князя Юрія (1325—1340), після чого через 9 днів війська польського короля Казимира ІІІ вдерлись у Галичину. Проголошений боярами правитель Дмитро Детко вимушений визнати залежність від короля Польщі. На Волині бояри проголосили князем зятя Юрія Мазовецького — сина князя Литви Гедіміна — Любарта.",
    eventsMarkup:
      'Бояри отруїли галицького князя Юрія (1325—1340), після чого через 9 днів війська польського короля Казимира ІІІ вдерлись у Галичину. Проголошений боярами правитель <a href="/w/index.php?title=%D0%94%D0%BC%D0%B8%D1%82%D1%80%D0%BE_%D0%94%D0%B5%D1%82%D0%BA%D0%BE&amp;action=edit&amp;redlink=1" class="new" title="Дмитро Детко (ще не написана)">Дмитро Детко</a> вимушений визнати залежність від короля Польщі. На Волині бояри проголосили князем зятя Юрія Мазовецького&nbsp;— сина князя Литви Гедіміна&nbsp;— <a href="/wiki/%D0%9B%D1%8E%D0%B1%D0%B0%D1%80%D1%82" title="Любарт">Любарта</a>.\n',
    eventIndex: 280,
    createdAt: "2024-01-06T17:36:32.452Z",
  },
  {
    id: "a6380b65-dd16-4740-82a2-62639f52424f",
    time: "1340 (1343)",
    events: "Захоплення Генуєю Сюмболона (Чембало)",
    eventsMarkup:
      'Захоплення Генуєю Сюмболона (<a href="/wiki/%D0%A7%D0%B5%D0%BC%D0%B1%D0%B0%D0%BB%D0%BE" class="mw-redirect" title="Чембало">Чембало</a>)\n',
    eventIndex: 281,
    createdAt: "2024-01-06T17:36:32.452Z",
  },
  {
    id: "3a72525b-733d-4984-ac22-0b85976adecf",
    time: "1342—1382",
    events: "Правління в Угорщині Людовіка І Анжуйського",
    eventsMarkup:
      'Правління в <a href="/wiki/%D0%A3%D0%B3%D0%BE%D1%80%D1%89%D0%B8%D0%BD%D0%B0" title="Угорщина">Угорщині</a> Людовіка І Анжуйського\n',
    eventIndex: 282,
    createdAt: "2024-01-06T17:36:32.452Z",
  },
  {
    id: "bff8cdd9-d32a-407a-a7fb-e43a15f73ec2",
    time: "1344",
    events:
      "Смерть галицького правителя Дмитра Детка і початок війни Польщі і Литви за Галичину і Волинь (до 1366 р.)",
    eventsMarkup:
      "Смерть галицького правителя Дмитра Детка і початок <b>війни Польщі і Литви за Галичину і Волинь</b> (до 1366&nbsp;р.)\n",
    eventIndex: 283,
    createdAt: "2024-01-06T17:36:32.452Z",
  },
  {
    id: "1bb0c4c0-c889-440f-bbcb-6210c04cec43",
    time: "1345—1377",
    events:
      "Під контроль Великого князівства Литовського переходить Чернігівщина і Переяславщина",
    eventsMarkup:
      'Під контроль <b><a href="/wiki/%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE_%D0%9B%D0%B8%D1%82%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B5" title="Велике князівство Литовське">Великого князівства Литовського</a></b> переходить <a href="/wiki/%D0%A7%D0%B5%D1%80%D0%BD%D1%96%D0%B3%D1%96%D0%B2%D1%89%D0%B8%D0%BD%D0%B0" title="Чернігівщина">Чернігівщина</a> і <a href="/wiki/%D0%9F%D0%B5%D1%80%D0%B5%D1%8F%D1%81%D0%BB%D0%B0%D0%B2%D1%81%D1%8C%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE" title="Переяславське князівство">Переяславщина</a>\n',
    eventIndex: 284,
    createdAt: "2024-01-06T17:36:32.452Z",
  },
  {
    id: "a93c4f2f-7baa-466b-82d4-dc43841b68fc",
    time: "1346",
    events: "Хан Джанібек обступає Кафу",
    eventsMarkup:
      '<a href="/wiki/%D0%A5%D0%B0%D0%BD_(%D1%82%D0%B8%D1%82%D1%83%D0%BB)" class="mw-redirect" title="Хан (титул)">Хан</a> Джанібек обступає <a href="/wiki/%D0%9A%D0%B0%D1%84%D0%B0" class="mw-redirect" title="Кафа">Кафу</a>\n',
    eventIndex: 285,
    createdAt: "2024-01-06T17:36:32.452Z",
  },
  {
    id: "0fb7c690-d95c-4728-bf22-554e564a2374",
    time: "1349",
    events:
      "Успішна кампанія Казимира ІІІ і окупація Галичини і частини Волині.",
    eventsMarkup:
      "Успішна кампанія Казимира ІІІ і окупація Галичини і частини Волині.\n",
    eventIndex: 286,
    createdAt: "2024-01-06T17:36:32.452Z",
  },
  {
    id: "82355ced-e1ea-4886-9a5f-45611a9582be",
    time: "1356",
    events: "Вірмени Львова отримують привілеї власного судочинства",
    eventsMarkup:
      '<a href="/wiki/%D0%92%D1%96%D1%80%D0%BC%D0%B5%D0%BD%D0%B8" title="Вірмени">Вірмени</a> Львова отримують привілеї власного судочинства\n',
    eventIndex: 287,
    createdAt: "2024-01-06T17:36:32.452Z",
  },
  {
    id: "d989185d-4eeb-43ff-a5ce-ac18bcb067e4",
    time: "1357",
    events:
      "Чембало: початок будівництва фортеці та заснування католицької єпархії",
    eventsMarkup:
      '<a href="/wiki/%D0%A7%D0%B5%D0%BC%D0%B1%D0%B0%D0%BB%D0%BE" class="mw-redirect" title="Чембало">Чембало</a>: початок будівництва фортеці та заснування католицької єпархії\n',
    eventIndex: 288,
    createdAt: "2024-01-06T17:36:32.452Z",
  },
  {
    id: "80a36ce8-12f8-4b02-975b-f6409d15ba47",
    time: "1358",
    events: "Заснування вірменського монастиря Сурб-Хач (біля Старого Криму)",
    eventsMarkup:
      'Заснування вірменського монастиря <a href="/wiki/%D0%A1%D1%83%D1%80%D0%B1-%D0%A5%D0%B0%D1%87" title="Сурб-Хач">Сурб-Хач</a> (біля Старого Криму)\n',
    eventIndex: 289,
    createdAt: "2024-01-06T17:36:32.452Z",
  },
  {
    id: "9121de79-41bf-4f8a-93c0-1ddf33e5acdb",
    time: "1362",
    events:
      "Битва на Синіх Водах (1363?): князь Литовський Ольгерд переміг татарське військо і заволодів Києвщиною, Поділлям і всім Правобережжям Дніпра до Чорного моря",
    eventsMarkup:
      '<a href="/wiki/%D0%91%D0%B8%D1%82%D0%B2%D0%B0_%D0%BD%D0%B0_%D0%A1%D0%B8%D0%BD%D1%96%D1%85_%D0%92%D0%BE%D0%B4%D0%B0%D1%85" title="Битва на Синіх Водах">Битва на Синіх Водах</a> (1363?): князь <a href="/wiki/%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE_%D0%9B%D0%B8%D1%82%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B5" title="Велике князівство Литовське">Литовський</a> <a href="/wiki/%D0%9E%D0%BB%D1%8C%D0%B3%D0%B5%D1%80%D0%B4" title="Ольгерд">Ольгерд</a> переміг татарське військо і заволодів Києвщиною, Поділлям і всім Правобережжям Дніпра до Чорного моря\n',
    eventIndex: 290,
    createdAt: "2024-01-06T17:36:32.463Z",
  },
  {
    id: "88404ddc-312f-49db-9099-db61ff0899b7",
    time: "1363",
    events: "Похід князя Литовського Ольгерда на Крим і на Москву",
    eventsMarkup:
      'Похід князя <a href="/wiki/%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE_%D0%9B%D0%B8%D1%82%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B5" title="Велике князівство Литовське">Литовського</a> <a href="/wiki/%D0%9E%D0%BB%D1%8C%D0%B3%D0%B5%D1%80%D0%B4" title="Ольгерд">Ольгерда</a> на <a href="/wiki/%D0%9A%D1%80%D0%B8%D0%BC" title="Крим">Крим</a> і на <a href="/wiki/%D0%9C%D0%BE%D1%81%D0%BA%D0%B2%D0%B0" title="Москва">Москву</a>\n',
    eventIndex: 291,
    createdAt: "2024-01-06T17:36:32.463Z",
  },
  {
    id: "80de5313-6750-4635-bf06-83c8c90d12d6",
    time: "1364",
    events: "Заснування Краківського університету.",
    eventsMarkup:
      'Заснування <a href="/wiki/%D0%9A%D1%80%D0%B0%D0%BA%D1%96%D0%B2" title="Краків">Краківського</a> університету.\n',
    eventIndex: 292,
    createdAt: "2024-01-06T17:36:32.463Z",
  },
  {
    id: "af61d7b3-bcc9-4578-9163-6f59b1b982e4",
    time: "1364—1425",
    events: "Період посилення і зростання Московського князівства",
    eventsMarkup:
      'Період посилення і зростання <a href="/wiki/%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE_%D0%9C%D0%BE%D1%81%D0%BA%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B5" title="Велике князівство Московське">Московського князівства</a>\n',
    eventIndex: 293,
    createdAt: "2024-01-06T17:36:32.463Z",
  },
  {
    id: "78bd0f45-b8cc-4f7a-a2f0-9e9e32d7e8c2",
    time: "1365",
    events: "Судак переходить до Генуї; заснування тут католицької єпархії",
    eventsMarkup:
      '<a href="/wiki/%D0%A1%D1%83%D0%B4%D0%B0%D0%BA_(%D0%BC%D1%96%D1%81%D1%82%D0%BE)" title="Судак (місто)">Судак</a> переходить до Генуї; заснування тут католицької єпархії\n',
    eventIndex: 294,
    createdAt: "2024-01-06T17:36:32.463Z",
  },
  {
    id: "11390dc3-b086-4879-8c4b-c62f17702528",
    time: "1368",
    events: "Похід князя Литовського Ольгерда на Москву",
    eventsMarkup:
      'Похід князя <a href="/wiki/%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE_%D0%9B%D0%B8%D1%82%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B5" title="Велике князівство Литовське">Литовського</a> <a href="/wiki/%D0%9E%D0%BB%D1%8C%D0%B3%D0%B5%D1%80%D0%B4" title="Ольгерд">Ольгерда</a> на Москву\n',
    eventIndex: 295,
    createdAt: "2024-01-06T17:36:32.463Z",
  },
  {
    id: "a0e077eb-96db-4dd8-8edc-85c0841175e9",
    time: "1370",
    events:
      "Після смерті короля Польщі Казимира ІІІ польськім королем стає король Угорщини Людовик І Анжуйський; Галичина тимчасово переходить до Угорського королівства.\n\nПохід князя Литовського Ольгерда на Москву",
    eventsMarkup:
      'Після смерті короля Польщі Казимира ІІІ польськім королем стає король Угорщини <a href="/wiki/%D0%9B%D1%8E%D0%B4%D0%BE%D0%B2%D0%B8%D0%BA_%D0%A3%D0%B3%D0%BE%D1%80%D1%81%D1%8C%D0%BA%D0%B8%D0%B9" title="Людовик Угорський">Людовик І Анжуйський</a>; <a href="/wiki/%D0%93%D0%B0%D0%BB%D0%B8%D1%87%D0%B8%D0%BD%D0%B0" title="Галичина">Галичина</a> тимчасово переходить до <a href="/wiki/%D0%A3%D0%B3%D0%BE%D1%80%D1%81%D1%8C%D0%BA%D0%B5_%D0%BA%D0%BE%D1%80%D0%BE%D0%BB%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE" title="Угорське королівство">Угорського королівства</a>.\n<p>Похід князя <a href="/wiki/%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE_%D0%9B%D0%B8%D1%82%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B5" title="Велике князівство Литовське">Литовського</a> <a href="/wiki/%D0%9E%D0%BB%D1%8C%D0%B3%D0%B5%D1%80%D0%B4" title="Ольгерд">Ольгерда</a> на Москву\n</p>\n',
    eventIndex: 296,
    createdAt: "2024-01-06T17:36:32.463Z",
  },
  {
    id: "3bac2cd0-a41e-4729-92d7-68fa20611184",
    time: "1372",
    events: "Похід князя Литовського Ольгерда на Московське князівство",
    eventsMarkup:
      'Похід князя <a href="/wiki/%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE_%D0%9B%D0%B8%D1%82%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B5" title="Велике князівство Литовське">Литовського</a> <a href="/wiki/%D0%9E%D0%BB%D1%8C%D0%B3%D0%B5%D1%80%D0%B4" title="Ольгерд">Ольгерда</a> на Московське князівство\n',
    eventIndex: 297,
    createdAt: "2024-01-06T17:36:32.463Z",
  },
  {
    id: "0f31aee0-b4d3-4fbc-9f29-338963f5d1ba",
    time: "1374",
    events:
      "Людовик І Анжуйський позбавив польську шляхту від сплати всіх податків",
    eventsMarkup:
      "Людовик І Анжуйський позбавив польську шляхту від сплати всіх податків\n",
    eventIndex: 298,
    createdAt: "2024-01-06T17:36:32.463Z",
  },
  {
    id: "62cef3a5-b6c0-40db-93a6-ae2499ea6f9c",
    time: "1375",
    events: "Похід князя Литовського Ольгерда на Смоленські землі",
    eventsMarkup:
      'Похід князя <a href="/wiki/%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE_%D0%9B%D0%B8%D1%82%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B5" title="Велике князівство Литовське">Литовського</a> <a href="/wiki/%D0%9E%D0%BB%D1%8C%D0%B3%D0%B5%D1%80%D0%B4" title="Ольгерд">Ольгерда</a> на Смоленські землі\n',
    eventIndex: 299,
    createdAt: "2024-01-06T17:36:32.463Z",
  },
  {
    id: "6872028a-57c9-4623-9481-01768d61f70c",
    time: "1380—1387",
    events:
      "Згідно з низкою договорів з татарами, Південний берег Криму від Кафи і Солдайї до Алушти та Чембало переходять до Генуї.",
    eventsMarkup:
      'Згідно з низкою договорів з татарами, <a href="/wiki/%D0%9F%D1%96%D0%B2%D0%B4%D0%B5%D0%BD%D0%BD%D0%B8%D0%B9_%D0%B1%D0%B5%D1%80%D0%B5%D0%B3_%D0%9A%D1%80%D0%B8%D0%BC%D1%83" class="mw-redirect" title="Південний берег Криму">Південний берег Криму</a> від Кафи і Солдайї до <a href="/wiki/%D0%90%D0%BB%D1%83%D1%88%D1%82%D0%B0" title="Алушта">Алушти</a> та <a href="/wiki/%D0%A7%D0%B5%D0%BC%D0%B1%D0%B0%D0%BB%D0%BE" class="mw-redirect" title="Чембало">Чембало</a> переходять до Генуї.\n',
    eventIndex: 300,
    createdAt: "2024-01-06T17:36:32.497Z",
  },
  {
    id: "2e09855a-62b8-4e35-bade-82a489d5e112",
    time: "1382",
    events: "Польська королева Ядвіга повертає Галичину Польщі (1385—1386?)",
    eventsMarkup:
      'Польська королева <a href="/wiki/%D0%AF%D0%B4%D0%B2%D1%96%D0%B3%D0%B0" title="Ядвіга">Ядвіга</a> повертає Галичину Польщі (1385—1386?)\n',
    eventIndex: 301,
    createdAt: "2024-01-06T17:36:32.497Z",
  },
  {
    id: "351935ec-47a6-4298-8e68-8a263f6afd59",
    time: "1385",
    events:
      "Кревська унія: об'єднання Польщі і Литви в результаті браку польської королеви Ядвіги і Великого князя Литовського Владислава Ягайла (Ягеллона)",
    eventsMarkup:
      '<b><a href="/wiki/%D0%9A%D1%80%D0%B5%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D1%83%D0%BD%D1%96%D1%8F" title="Кревська унія">Кревська унія</a></b>: об\'єднання Польщі і Литви в результаті браку польської королеви Ядвіги і Великого князя Литовського <a href="/wiki/%D0%92%D0%BB%D0%B0%D0%B4%D0%B8%D1%81%D0%BB%D0%B0%D0%B2_II_%D0%AF%D0%B3%D0%B0%D0%B9%D0%BB%D0%BE" title="Владислав II Ягайло">Владислава Ягайла</a> (Ягеллона)\n',
    eventIndex: 302,
    createdAt: "2024-01-06T17:36:32.497Z",
  },
  {
    id: "c95fca0e-9541-4fe3-8e11-c8dcfb232462",
    time: "1385",
    events: "Вітовта (кузена короля Ягайла) визнано Великим князем Литовським",
    eventsMarkup:
      '<a href="/wiki/%D0%92%D1%96%D1%82%D0%BE%D0%B2%D1%82" title="Вітовт">Вітовта</a> (кузена короля Ягайла) визнано Великим князем Литовським\n',
    eventIndex: 303,
    createdAt: "2024-01-06T17:36:32.497Z",
  },
  {
    id: "ce75ffc6-fdc5-4fe1-acde-2ca5ea7e69be",
    time: "1387",
    events: "Ліквідація поляками Галицького князівства",
    eventsMarkup: "Ліквідація поляками Галицького князівства\n",
    eventIndex: 304,
    createdAt: "2024-01-06T17:36:32.497Z",
  },
  {
    id: "e0d471a9-64d5-4454-a669-8dcf79cf69a5",
    time: "1393 — 1394",
    events: "Ліквідація литовцями руських удільних князівств",
    eventsMarkup: "Ліквідація литовцями руських удільних князівств\n",
    eventIndex: 305,
    createdAt: "2024-01-06T17:36:32.497Z",
  },
  {
    id: "bebb26cd-d9fe-4cd1-b332-a8ea699bc80f",
    time: "1394",
    events:
      "В Україні зафіксовані перші гармати. Гармати і 6 бочок пороху привіз король Володислав ІІ Ягайло до Львова. Того ж року з наказу короля львівський гармаш Зброжек привіз перші гармати і 6 бочок пороху до Кам'янця на Поділлі.",
    eventsMarkup:
      'В Україні зафіксовані перші <a href="/wiki/%D0%93%D0%B0%D1%80%D0%BC%D0%B0%D1%82%D0%B0" title="Гармата">гармати</a>. Гармати і 6 бочок <a href="/wiki/%D0%9F%D0%BE%D1%80%D0%BE%D1%85" title="Порох">пороху</a> привіз король <a href="/wiki/%D0%92%D0%BB%D0%B0%D0%B4%D0%B8%D1%81%D0%BB%D0%B0%D0%B2_II_%D0%AF%D0%B3%D0%B0%D0%B9%D0%BB%D0%BE" title="Владислав II Ягайло">Володислав ІІ Ягайло</a> до <a href="/wiki/%D0%9B%D1%8C%D0%B2%D1%96%D0%B2" title="Львів">Львова</a>. Того ж року з наказу короля львівський <a href="/wiki/%D0%93%D0%B0%D1%80%D0%BC%D0%B0%D1%88%D1%96" title="Гармаші">гармаш</a> Зброжек привіз перші гармати і 6 бочок пороху до <a href="/wiki/%D0%9A%D0%B0%D0%BC%27%D1%8F%D0%BD%D0%B5%D1%86%D1%8C-%D0%9F%D0%BE%D0%B4%D1%96%D0%BB%D1%8C%D1%81%D1%8C%D0%BA%D0%B8%D0%B9" title="Кам\'янець-Подільський">Кам\'янця</a> на <a href="/wiki/%D0%9F%D0%BE%D0%B4%D1%96%D0%BB%D0%BB%D1%8F" title="Поділля">Поділлі</a>.\n',
    eventIndex: 306,
    createdAt: "2024-01-06T17:36:32.497Z",
  },
  {
    id: "657e1ffe-de1f-4a84-8133-ab76cfd95f64",
    time: "1395",
    events:
      "Крим та Кавказ спустошені військами Тимура, особливо постраждали християни.",
    eventsMarkup:
      '<a href="/wiki/%D0%9A%D1%80%D0%B8%D0%BC" title="Крим">Крим</a> та <a href="/wiki/%D0%9A%D0%B0%D0%B2%D0%BA%D0%B0%D0%B7" title="Кавказ">Кавказ</a> спустошені військами <a href="/wiki/%D0%A2%D0%B8%D0%BC%D1%83%D1%80" title="Тимур">Тимура</a>, особливо постраждали <a href="/wiki/%D0%A5%D1%80%D0%B8%D1%81%D1%82%D0%B8%D1%8F%D0%BD%D0%B8" title="Християни">християни</a>.\n',
    eventIndex: 307,
    createdAt: "2024-01-06T17:36:32.497Z",
  },
  {
    id: "ba3412a2-75f8-497b-8c7a-a0c66a76ca7b",
    time: "1397",
    events:
      "Великий князь Литовський Вітовт дійшов до Кафи, взяв Кирк-Ор і зруйнував Херсонес . Золотоординський хан Тохтамиш (знаходячись у вигнанні у Литві) погодився на передачу під контроль Великого князівства Литовського Київщини, Переяславщини, Чернігівщини і степів на правому березі Дніпра в обмін на допомогу в боротьбі з Тамерланом.\n\nПерша писемна згадка про міста Сколе і Бучач",
    eventsMarkup:
      '<a href="/wiki/%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B8%D0%B9_%D0%BA%D0%BD%D1%8F%D0%B7%D1%8C_%D0%9B%D0%B8%D1%82%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B8%D0%B9" class="mw-redirect" title="Великий князь Литовський">Великий князь Литовський</a> <b><a href="/wiki/%D0%92%D1%96%D1%82%D0%BE%D0%B2%D1%82" title="Вітовт">Вітовт</a></b> дійшов до <a href="/wiki/%D0%A4%D0%B5%D0%BE%D0%B4%D0%BE%D1%81%D1%96%D1%8F" title="Феодосія">Кафи</a>, взяв <a href="/wiki/%D0%9A%D0%B8%D1%80%D0%BA-%D0%9E%D1%80" class="mw-redirect" title="Кирк-Ор">Кирк-Ор</a> і зруйнував <a href="/wiki/%D0%A5%D0%B5%D1%80%D1%81%D0%BE%D0%BD%D0%B5%D1%81" class="mw-redirect" title="Херсонес">Херсонес</a> . Золотоординський хан <a href="/wiki/%D0%A2%D0%BE%D1%85%D1%82%D0%B0%D0%BC%D0%B8%D1%88" title="Тохтамиш">Тохтамиш</a> (знаходячись у вигнанні у Литві) погодився на передачу під контроль Великого князівства Литовського Київщини, Переяславщини, Чернігівщини і степів на правому березі Дніпра в обмін на допомогу в боротьбі з <a href="/wiki/%D0%A2%D0%B0%D0%BC%D0%B5%D1%80%D0%BB%D0%B0%D0%BD" class="mw-redirect" title="Тамерлан">Тамерланом</a>.\n<p>Перша писемна згадка про міста <a href="/wiki/%D0%A1%D0%BA%D0%BE%D0%BB%D0%B5" title="Сколе">Сколе</a> і <a href="/wiki/%D0%91%D1%83%D1%87%D0%B0%D1%87" title="Бучач">Бучач</a>\n</p>\n',
    eventIndex: 308,
    createdAt: "2024-01-06T17:36:32.497Z",
  },
  {
    id: "f4b7bd9c-ff5c-4646-a3e6-16ab4cfddf34",
    time: "1399",
    events:
      "Херсонес остаточно зруйнований темником Єдігеєм, після чого вже не відновлювався.\n\nБитва на Ворсклі (1399): русько-литовсько-польські війська на чолі з князем Вітовтом (75 000) зазнають поразки від татар Єдігея (20 000). Розорення татарами Київщини, Поділля, Волині.",
    eventsMarkup:
      '<a href="/wiki/%D0%A5%D0%B5%D1%80%D1%81%D0%BE%D0%BD%D0%B5%D1%81" class="mw-redirect" title="Херсонес">Херсонес</a> остаточно зруйнований темником <a href="/wiki/%D0%84%D0%B4%D1%96%D0%B3%D0%B5%D0%B9" class="mw-redirect" title="Єдігей">Єдігеєм</a>, після чого вже не відновлювався.\n<p><a href="/wiki/%D0%91%D0%B8%D1%82%D0%B2%D0%B0_%D0%BD%D0%B0_%D0%92%D0%BE%D1%80%D1%81%D0%BA%D0%BB%D1%96_(1399)" class="mw-redirect" title="Битва на Ворсклі (1399)">Битва на Ворсклі (1399)</a>: русько-литовсько-польські війська на чолі з князем Вітовтом (75 000) зазнають поразки від татар Єдігея (20 000). Розорення татарами Київщини, <a href="/wiki/%D0%9F%D0%BE%D0%B4%D1%96%D0%BB%D0%BB%D1%8F" title="Поділля">Поділля</a>, Волині.\n</p>\n',
    eventIndex: 309,
    createdAt: "2024-01-06T17:36:32.497Z",
  },
  {
    id: "07118ca9-c5ec-469d-b71e-63854784ecd0",
    time: "1402",
    events: "Вітовт остаточно оволодів Смоленським князівством.",
    eventsMarkup:
      '<a href="/wiki/%D0%92%D1%96%D1%82%D0%BE%D0%B2%D1%82" title="Вітовт">Вітовт</a> остаточно оволодів <a href="/wiki/%D0%A1%D0%BC%D0%BE%D0%BB%D0%B5%D0%BD%D1%81%D1%8C%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE" title="Смоленське князівство">Смоленським князівством</a>.\n',
    eventIndex: 310,
    createdAt: "2024-01-06T17:36:32.506Z",
  },
  {
    id: "bd275a56-d379-443f-9574-f20a55c06a70",
    time: "1403",
    events: "Відновлення фортеці Феодоро (Мангуп) в гірському Криму",
    eventsMarkup:
      'Відновлення фортеці <a href="/wiki/%D0%A4%D0%B5%D0%BE%D0%B4%D0%BE%D1%80%D0%BE" title="Феодоро">Феодоро</a> (<a href="/wiki/%D0%9C%D0%B0%D0%BD%D0%B3%D1%83%D0%BF" title="Мангуп">Мангуп</a>) в гірському Криму\n',
    eventIndex: 311,
    createdAt: "2024-01-06T17:36:32.506Z",
  },
  {
    id: "ca575ff2-d88e-4fcd-b369-56e8929e36aa",
    time: "1408",
    events:
      "Договір між Москвою та Литвою на Угрі, який встановлював кордон по цій річці, що не виключало переходу князів з литовського берегу на службу до Москви",
    eventsMarkup:
      "Договір між Москвою та Литвою на Угрі, який встановлював кордон по цій річці, що не виключало переходу князів з литовського берегу на службу до Москви\n",
    eventIndex: 312,
    createdAt: "2024-01-06T17:36:32.506Z",
  },
  {
    id: "0bf33b1e-fcd1-4abf-8e0c-f7872d4dba0f",
    time: "1410",
    events:
      "Грюнвальдська битва: перемога польсько-литовсько-руського війська над тевтонськими лицарями.",
    eventsMarkup:
      '<b><a href="/wiki/%D0%93%D1%80%D1%8E%D0%BD%D0%B2%D0%B0%D0%BB%D1%8C%D0%B4%D1%81%D1%8C%D0%BA%D0%B0_%D0%B1%D0%B8%D1%82%D0%B2%D0%B0" title="Грюнвальдська битва">Грюнвальдська битва</a></b>: перемога польсько-литовсько-руського війська над <a href="/wiki/%D0%A2%D0%B5%D0%B2%D1%82%D0%BE%D0%BD%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%BE%D1%80%D0%B4%D0%B5%D0%BD" title="Тевтонський орден">тевтонськими</a> лицарями.\n',
    eventIndex: 313,
    createdAt: "2024-01-06T17:36:32.506Z",
  },
  {
    id: "d5940bf5-45a5-4b0f-a6e7-74912b85b717",
    time: "1413",
    events:
      "Городельська унія між Вітовтом та Ягайлом. Литовські бояри-католики отримали права польської шляхти.",
    eventsMarkup:
      '<a href="/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B5%D0%BB%D1%8C%D1%81%D1%8C%D0%BA%D0%B0_%D1%83%D0%BD%D1%96%D1%8F" title="Городельська унія">Городельська унія</a> між <a href="/wiki/%D0%92%D1%96%D1%82%D0%BE%D0%B2%D1%82" title="Вітовт">Вітовтом</a> та <a href="/wiki/%D0%AF%D0%B3%D0%B0%D0%B9%D0%BB%D0%BE" class="mw-redirect" title="Ягайло">Ягайлом</a>. Литовські бояри-католики отримали права польської шляхти.\n',
    eventIndex: 314,
    createdAt: "2024-01-06T17:36:32.506Z",
  },
  {
    id: "dd265358-2051-42d5-8a1f-e29b0a7f90db",
    time: "1427",
    events:
      "Хан Хаджі-Гірей домагається виокремлення Кримського ханства зі складу Золотої Орди. Феодоріти завершують будівництво гавані Авліта (Каламіта).",
    eventsMarkup:
      'Хан <a href="/wiki/%D0%A5%D0%B0%D0%B4%D0%B6%D1%96-%D0%93%D1%96%D1%80%D0%B5%D0%B9" class="mw-redirect" title="Хаджі-Гірей">Хаджі-Гірей</a> домагається виокремлення <a href="/wiki/%D0%9A%D1%80%D0%B8%D0%BC%D1%81%D1%8C%D0%BA%D0%B5_%D1%85%D0%B0%D0%BD%D1%81%D1%82%D0%B2%D0%BE" title="Кримське ханство">Кримського ханства</a> зі складу Золотої Орди. Феодоріти завершують будівництво гавані <a href="/wiki/%D0%90%D0%B2%D0%BB%D1%96%D1%82%D0%B0" class="mw-disambig" title="Авліта">Авліта</a> (<a href="/wiki/%D0%9A%D0%B0%D0%BB%D0%B0%D0%BC%D1%96%D1%82%D0%B0" title="Каламіта">Каламіта</a>).\n',
    eventIndex: 315,
    createdAt: "2024-01-06T17:36:32.506Z",
  },
  {
    id: "8eed393b-a9bb-4d97-9e1b-7ec81ec85e52",
    time: "1428",
    events:
      "Згадуються генуезькі консули в Кафі, Трапезунді, Тані, Чембало, Солдайї, Самастро, Коппі, Севастополісі, Синопі.",
    eventsMarkup:
      'Згадуються генуезькі консули в Кафі, <a href="/wiki/%D0%A2%D1%80%D0%B0%D0%BF%D0%B5%D0%B7%D1%83%D0%BD%D0%B4" class="mw-redirect" title="Трапезунд">Трапезунді</a>, <a href="/wiki/%D0%A2%D0%B0%D0%BD%D0%B0_(%D0%BC%D1%96%D1%81%D1%82%D0%BE)" title="Тана (місто)">Тані</a>, <a href="/wiki/%D0%A7%D0%B5%D0%BC%D0%B1%D0%B0%D0%BB%D0%BE" class="mw-redirect" title="Чембало">Чембало</a>, Солдайї, <a href="/w/index.php?title=%D0%A1%D0%B0%D0%BC%D0%B0%D1%81%D1%82%D1%80%D0%BE&amp;action=edit&amp;redlink=1" class="new" title="Самастро (ще не написана)">Самастро</a>, <a href="/wiki/%D0%A1%D0%BB%D0%BE%D0%B2%27%D1%8F%D0%BD%D1%81%D1%8C%D0%BA-%D0%BD%D0%B0-%D0%9A%D1%83%D0%B1%D0%B0%D0%BD%D1%96" title="Слов\'янськ-на-Кубані">Коппі</a>, <a href="/wiki/%D0%A1%D1%83%D1%85%D1%83%D0%BC%D1%96" title="Сухумі">Севастополісі</a>, <a href="/wiki/%D0%A1%D0%B8%D0%BD%D0%BE%D0%BF" class="mw-redirect" title="Синоп">Синопі</a>.\n',
    eventIndex: 316,
    createdAt: "2024-01-06T17:36:32.506Z",
  },
  {
    id: "f0fb4a3f-5337-470a-b761-57c0225b065b",
    time: "1432—1436",
    events:
      "«Велике князівство Руське (1432—1435)» князя Свидригайла. Розкол у Великому князівстві Литовському. Сигізмунд Стародубський (брат Вітовта) дарує православному дворянству права, як і у католицького.",
    eventsMarkup:
      '<a href="/wiki/%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE_%D0%A0%D1%83%D1%81%D1%8C%D0%BA%D0%B5_(1432%E2%80%941435)" title="Велике князівство Руське (1432—1435)">«Велике князівство Руське (1432—1435)»</a> князя <a href="/wiki/%D0%A1%D0%B2%D0%B8%D0%B4%D1%80%D0%B8%D0%B3%D0%B0%D0%B9%D0%BB%D0%BE" class="mw-redirect" title="Свидригайло">Свидригайла</a>. Розкол у Великому князівстві Литовському. <a href="/w/index.php?title=%D0%A1%D0%B8%D0%B3%D1%96%D0%B7%D0%BC%D1%83%D0%BD%D0%B4_%D0%A1%D1%82%D0%B0%D1%80%D0%BE%D0%B4%D1%83%D0%B1%D1%81%D1%8C%D0%BA%D0%B8%D0%B9&amp;action=edit&amp;redlink=1" class="new" title="Сигізмунд Стародубський (ще не написана)">Сигізмунд Стародубський</a> (брат Вітовта) дарує православному дворянству права, як і у католицького.\n',
    eventIndex: 317,
    createdAt: "2024-01-06T17:36:32.506Z",
  },
  {
    id: "50928a09-053e-40a5-9d40-e9669b7a2175",
    time: "1433",
    events: "Повстання населення Чембало проти генузців, підтримане Феодоро .",
    eventsMarkup:
      'Повстання населення <a href="/wiki/%D0%A7%D0%B5%D0%BC%D0%B1%D0%B0%D0%BB%D0%BE" class="mw-redirect" title="Чембало">Чембало</a> проти генузців, підтримане <a href="/wiki/%D0%A4%D0%B5%D0%BE%D0%B4%D0%BE%D1%80%D0%BE" title="Феодоро">Феодоро</a> .\n',
    eventIndex: 318,
    createdAt: "2024-01-06T17:36:32.506Z",
  },
  {
    id: "006a023d-2a49-4510-a32d-5f384236311a",
    time: "1434",
    events:
      "Західне Поділля переходить до Польщі і перетворюється на воєводство.\n\nЕкспедиційний корпус з Генуї відвойовує Чембало у Феодоро, руйнує Каламіту, але зазнає поразки від кримських татар в битві під Солхатом.",
    eventsMarkup:
      'Західне <a href="/wiki/%D0%9F%D0%BE%D0%B4%D1%96%D0%BB%D0%BB%D1%8F" title="Поділля">Поділля</a> переходить до Польщі і перетворюється на <a href="/wiki/%D0%92%D0%BE%D1%94%D0%B2%D0%BE%D0%B4%D1%81%D1%82%D0%B2%D0%BE" title="Воєводство">воєводство</a>.\n<p>Експедиційний корпус з Генуї відвойовує <a href="/wiki/%D0%A7%D0%B5%D0%BC%D0%B1%D0%B0%D0%BB%D0%BE" class="mw-redirect" title="Чембало">Чембало</a> у <a href="/wiki/%D0%A4%D0%B5%D0%BE%D0%B4%D0%BE%D1%80%D0%BE" title="Феодоро">Феодоро</a>, руйнує Каламіту, але зазнає поразки від <a href="/wiki/%D0%9A%D1%80%D0%B8%D0%BC%D1%81%D1%8C%D0%BA%D0%B5_%D1%85%D0%B0%D0%BD%D1%81%D1%82%D0%B2%D0%BE" title="Кримське ханство">кримських татар</a> в битві під <a href="/wiki/%D0%A1%D0%BE%D0%BB%D1%85%D0%B0%D1%82" class="mw-redirect" title="Солхат">Солхатом</a>.\n</p>\n',
    eventIndex: 319,
    createdAt: "2024-01-06T17:36:32.506Z",
  },
  {
    id: "c589f32b-dfb4-400d-b891-e70b7d9d6145",
    time: "1438—1445",
    events:
      "Флорентійська церковна унія — спроба об'єднати католицьку і православну церкви.",
    eventsMarkup:
      '<a href="/wiki/%D0%A4%D0%BB%D0%BE%D1%80%D0%B5%D0%BD%D1%82%D1%96%D0%B9%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D1%81%D0%BE%D0%B1%D0%BE%D1%80" title="Флорентійський собор">Флорентійська церковна унія</a>&nbsp;— спроба об\'єднати католицьку і православну церкви.\n',
    eventIndex: 320,
    createdAt: "2024-01-06T17:36:32.507Z",
  },
  {
    id: "6f0fdd2a-0165-49a3-9e7d-a5f56ab94547",
    time: "1438",
    events:
      "Невдала спроба генуезців відвоювати у феодоритів Алусту, Партеніт, Гурзуф",
    eventsMarkup:
      'Невдала спроба генуезців відвоювати у феодоритів Алусту, <a href="/wiki/%D0%9F%D0%B0%D1%80%D1%82%D0%B5%D0%BD%D1%96%D1%82" title="Партеніт">Партеніт</a>, <a href="/wiki/%D0%93%D1%83%D1%80%D0%B7%D1%83%D1%84" title="Гурзуф">Гурзуф</a>\n',
    eventIndex: 321,
    createdAt: "2024-01-06T17:36:32.507Z",
  },
  {
    id: "65cfb220-1b1b-4f29-9656-6dd5a8a0917a",
    time: "1438—1454",
    events: "Спорудження фортеці у Білгороді-Дністровському",
    eventsMarkup: "Спорудження фортеці у Білгороді-Дністровському\n",
    eventIndex: 322,
    createdAt: "2024-01-06T17:36:32.507Z",
  },
  {
    id: "2beb7fd1-2eb0-4a7c-9767-f9961120094b",
    time: "1447",
    events: "Заснування міста Рахів на Закарпатті",
    eventsMarkup:
      'Заснування міста <a href="/wiki/%D0%A0%D0%B0%D1%85%D1%96%D0%B2" title="Рахів">Рахів</a> на <a href="/wiki/%D0%97%D0%B0%D0%BA%D0%B0%D1%80%D0%BF%D0%B0%D1%82%D1%82%D1%8F" title="Закарпаття">Закарпатті</a>\n',
    eventIndex: 323,
    createdAt: "2024-01-06T17:36:32.507Z",
  },
  {
    id: "5f3bbfe3-79a7-4a43-a6f2-90e04808875e",
    time: "1448",
    events:
      "Собор російських єпископів призначає єпископа рязанського Іону митрополитом без отримання дозволу Вселенського патріарха: фактично Московська православна церква стала автокефальною. Константинополь затвердив Іону митрополитом лише 1451 р.",
    eventsMarkup:
      'Собор російських єпископів призначає єпископа рязанського Іону митрополитом без отримання дозволу Вселенського патріарха: фактично <a href="/wiki/%D0%9C%D0%BE%D1%81%D0%BA%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%BF%D1%80%D0%B0%D0%B2%D0%BE%D1%81%D0%BB%D0%B0%D0%B2%D0%BD%D0%B0_%D1%86%D0%B5%D1%80%D0%BA%D0%B2%D0%B0" class="mw-redirect" title="Московська православна церква">Московська православна церква</a> стала автокефальною. <a href="/wiki/%D0%9A%D0%BE%D0%BD%D1%81%D1%82%D0%B0%D0%BD%D1%82%D0%B8%D0%BD%D0%BE%D0%BF%D0%BE%D0%BB%D1%8C" title="Константинополь">Константинополь</a> затвердив Іону митрополитом лише <a href="/wiki/1451" title="1451">1451</a>&nbsp;р.\n',
    eventIndex: 324,
    createdAt: "2024-01-06T17:36:32.507Z",
  },
  {
    id: "39ae81cf-152f-45a6-89ef-2305fb4d19f1",
    time: "1449",
    events: "Утворення незалежного Кримського ханства",
    eventsMarkup:
      'Утворення незалежного <b><a href="/wiki/%D0%9A%D1%80%D0%B8%D0%BC%D1%81%D1%8C%D0%BA%D0%B5_%D1%85%D0%B0%D0%BD%D1%81%D1%82%D0%B2%D0%BE" title="Кримське ханство">Кримського ханства</a></b>\n',
    eventIndex: 325,
    createdAt: "2024-01-06T17:36:32.507Z",
  },
  {
    id: "831058f8-db2f-4f22-96dd-824335053281",
    time: "1452",
    events:
      "На початку 1452 р. волинські замки зайняли литовські війська, а незабаром Волинське князівство було остаточно ліквідоване і перетворене в провінцію Великого князівства Литовського, якою став управляти великокнязівський намісник.",
    eventsMarkup:
      "На початку 1452&nbsp;р. волинські замки зайняли литовські війська, а незабаром Волинське князівство було остаточно ліквідоване і перетворене в провінцію Великого князівства Литовського, якою став управляти великокнязівський намісник.\n",
    eventIndex: 326,
    createdAt: "2024-01-06T17:36:32.507Z",
  },
  {
    id: "a12a864e-929b-4465-a2f6-fa2b76911625",
    time: "1453",
    events:
      "Взяття турками Константинополя — крах Візантійської імперії, після чого Генуя продає чорноморські колонії своєму банку Сан-Джорджо",
    eventsMarkup:
      '<b><a href="/wiki/%D0%92%D0%B7%D1%8F%D1%82%D1%82%D1%8F_%D1%82%D1%83%D1%80%D0%BA%D0%B0%D0%BC%D0%B8_%D0%9A%D0%BE%D0%BD%D1%81%D1%82%D0%B0%D0%BD%D1%82%D0%B8%D0%BD%D0%BE%D0%BF%D0%BE%D0%BB%D1%8F" class="mw-redirect" title="Взяття турками Константинополя">Взяття турками Константинополя</a></b>&nbsp;— крах <a href="/wiki/%D0%92%D1%96%D0%B7%D0%B0%D0%BD%D1%82%D1%96%D0%B9%D1%81%D1%8C%D0%BA%D0%B0_%D1%96%D0%BC%D0%BF%D0%B5%D1%80%D1%96%D1%8F" title="Візантійська імперія">Візантійської імперії</a>, після чого <a href="/wiki/%D0%93%D0%B5%D0%BD%D1%83%D1%8F" title="Генуя">Генуя</a> продає чорноморські колонії своєму банку Сан-Джорджо\n',
    eventIndex: 327,
    createdAt: "2024-01-06T17:36:32.507Z",
  },
  {
    id: "e93d0c36-26df-423f-a212-793f4fd87d8f",
    time: "1456 (1458?)",
    events:
      "Під впливом короля Польщі (Литовського князя?) Вселенський патріарх призначає митрополитом Київським Григорія. Розкол руської церкви. Київська митрополія — 10 українських і білоруських єпископатів.",
    eventsMarkup:
      'Під впливом короля Польщі (Литовського князя?) <a href="/wiki/%D0%92%D1%81%D0%B5%D0%BB%D0%B5%D0%BD%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%BF%D0%B0%D1%82%D1%80%D1%96%D0%B0%D1%80%D1%85" class="mw-redirect" title="Вселенський патріарх">Вселенський патріарх</a> призначає митрополитом Київським Григорія. Розкол руської церкви. <a href="/wiki/%D0%9A%D0%B8%D1%97%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%BC%D0%B8%D1%82%D1%80%D0%BE%D0%BF%D0%BE%D0%BB%D1%96%D1%8F" title="Київська митрополія">Київська митрополія</a>&nbsp;— 10 українських і білоруських <a href="/wiki/%D0%84%D0%BF%D0%B8%D1%81%D0%BA%D0%BE%D0%BF%D0%B0%D1%82" class="mw-redirect" title="Єпископат">єпископатів</a>.\n',
    eventIndex: 328,
    createdAt: "2024-01-06T17:36:32.507Z",
  },
  {
    id: "c54f876a-0bba-4f5c-b563-a01126749158",
    time: "1463—1485",
    events:
      "Період становлення Московського великого князівства як єдиної держави Північного сходу Русі. (Псков приєднано 1510 р., Рязань — 1521 р.)",
    eventsMarkup:
      'Період становлення Московського великого князівства як єдиної держави Північного сходу Русі. (<a href="/wiki/%D0%9F%D1%81%D0%BA%D0%BE%D0%B2" title="Псков">Псков</a> приєднано 1510&nbsp;р., <a href="/wiki/%D0%A0%D1%8F%D0%B7%D0%B0%D0%BD%D1%8C" title="Рязань">Рязань</a>&nbsp;— 1521&nbsp;р.)\n',
    eventIndex: 329,
    createdAt: "2024-01-06T17:36:32.507Z",
  },
  {
    id: "6cf8e159-98b4-4c1b-842b-cd5ed9a66154",
    time: "1471",
    events:
      "Ліквідація Київського удільного князівства і утворення Київського воєводства.",
    eventsMarkup:
      'Ліквідація Київського удільного князівства і утворення <a href="/wiki/%D0%9A%D0%B8%D1%97%D0%B2%D1%81%D1%8C%D0%BA%D0%B5_%D0%B2%D0%BE%D1%94%D0%B2%D0%BE%D0%B4%D1%81%D1%82%D0%B2%D0%BE" title="Київське воєводство">Київського воєводства</a>.\n',
    eventIndex: 330,
    createdAt: "2024-01-06T17:36:32.517Z",
  },
  {
    id: "824741c7-8f11-494f-920c-25c50d2d7ad8",
    time: "1473",
    events: "Кримське ханство потрапляє в залежність від Османської імперії",
    eventsMarkup:
      '<a href="/wiki/%D0%9A%D1%80%D0%B8%D0%BC%D1%81%D1%8C%D0%BA%D0%B5_%D1%85%D0%B0%D0%BD%D1%81%D1%82%D0%B2%D0%BE" title="Кримське ханство">Кримське ханство</a> потрапляє в залежність від <a href="/wiki/%D0%9E%D1%81%D0%BC%D0%B0%D0%BD%D1%81%D1%8C%D0%BA%D0%B0_%D1%96%D0%BC%D0%BF%D0%B5%D1%80%D1%96%D1%8F" title="Османська імперія">Османської імперії</a>\n',
    eventIndex: 331,
    createdAt: "2024-01-06T17:36:32.517Z",
  },
  {
    id: "63ecc8fe-450c-4fd9-bb1c-bcefeaf384c8",
    time: "1475",
    events:
      "Турецький десант у Крим у. Здається Кафа, взяті штурмом Судак, Чембало, Алуста (Алушта). Генуезькі колонії знищені. Після декількох місяців героїчної оборони пала фортеця Мангуп і князівство Феодоро припинило своє існування",
    eventsMarkup:
      '<b>Турецький десант у <a href="/wiki/%D0%9A%D1%80%D0%B8%D0%BC" title="Крим">Крим</a> у</b>. Здається <a href="/wiki/%D0%9A%D0%B0%D1%84%D0%B0" class="mw-redirect" title="Кафа">Кафа</a>, взяті штурмом <a href="/wiki/%D0%A1%D1%83%D0%B4%D0%B0%D0%BA_(%D0%BC%D1%96%D1%81%D1%82%D0%BE)" title="Судак (місто)">Судак</a>, <a href="/wiki/%D0%A7%D0%B5%D0%BC%D0%B1%D0%B0%D0%BB%D0%BE" class="mw-redirect" title="Чембало">Чембало</a>, Алуста (<a href="/wiki/%D0%90%D0%BB%D1%83%D1%88%D1%82%D0%B0" title="Алушта">Алушта</a>). Генуезькі колонії знищені. Після декількох місяців героїчної оборони пала фортеця <a href="/wiki/%D0%9C%D0%B0%D0%BD%D0%B3%D1%83%D0%BF" title="Мангуп">Мангуп</a> і князівство Феодоро припинило своє існування\n',
    eventIndex: 332,
    createdAt: "2024-01-06T17:36:32.517Z",
  },
  {
    id: "9a68d678-27fe-481a-9af8-d7707d378f94",
    time: "1478",
    events: "Кримський хан визнає себе васалом Османської імперії",
    eventsMarkup:
      'Кримський <a href="/wiki/%D0%A5%D0%B0%D0%BD" title="Хан">хан</a> визнає себе <a href="/wiki/%D0%92%D0%B0%D1%81%D0%B0%D0%BB" title="Васал">васалом</a> <a href="/wiki/%D0%9E%D1%81%D0%BC%D0%B0%D0%BD%D1%81%D1%8C%D0%BA%D0%B0_%D1%96%D0%BC%D0%BF%D0%B5%D1%80%D1%96%D1%8F" title="Османська імперія">Османської імперії</a>\n',
    eventIndex: 333,
    createdAt: "2024-01-06T17:36:32.517Z",
  },
  {
    id: "9f91273e-a307-4940-b019-9e83a0237f57",
    time: "1480",
    events:
      "Хан Великої Орди Ахмат пройшов з військом через землі свого союзника — короля Казимира IV на р. Угру, де гадав вдертися до меж Московського князівства, але був зупинений російським військом («Стояння на Угрі»). Кінець татаро-монгольського іга на Русі.",
    eventsMarkup:
      'Хан <a href="/wiki/%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B0_%D0%9E%D1%80%D0%B4%D0%B0" title="Велика Орда">Великої Орди</a> <a href="/wiki/%D0%90%D1%85%D0%BC%D0%B0%D1%82" class="mw-disambig" title="Ахмат">Ахмат</a> пройшов з військом через землі свого союзника&nbsp;— короля <a href="/wiki/%D0%9A%D0%B0%D0%B7%D0%B8%D0%BC%D0%B8%D1%80_IV" class="mw-redirect" title="Казимир IV">Казимира IV</a> на р. Угру, де гадав вдертися до меж Московського князівства, але був зупинений російським військом (<a href="/wiki/%D0%A1%D1%82%D0%BE%D1%8F%D0%BD%D0%BD%D1%8F_%D0%BD%D0%B0_%D0%A3%D0%B3%D1%80%D1%96" title="Стояння на Угрі">«Стояння на Угрі»</a>). Кінець татаро-монгольського іга на Русі.\n',
    eventIndex: 334,
    createdAt: "2024-01-06T17:36:32.517Z",
  },
  {
    id: "973e7290-7057-49e5-8ebb-c7c78f4977b3",
    time: "1482",
    events:
      "Перший похід кримських татар (як союзників московського князя) на українські землі: хан Менглі Герай грабує Київ і в подарунок московському князю Івану висилає віз з награбованим добром київських соборів і церков, в тому числі іконостас, золоту чашу і діскос з собору Святої Софії",
    eventsMarkup:
      'Перший похід кримських татар (як союзників московського князя) на українські землі: хан <a href="/wiki/%D0%9C%D0%B5%D0%BD%D0%B3%D0%BB%D1%96_%D0%93%D0%B5%D1%80%D0%B0%D0%B9" class="mw-redirect mw-disambig" title="Менглі Герай">Менглі Герай</a> грабує Київ і в подарунок московському князю Івану висилає віз з награбованим добром київських соборів і церков, в тому числі <a href="/wiki/%D0%86%D0%BA%D0%BE%D0%BD%D0%BE%D1%81%D1%82%D0%B0%D1%81" title="Іконостас">іконостас</a>, золоту чашу і <a href="/w/index.php?title=%D0%94%D1%96%D1%81%D0%BA%D0%BE%D1%81&amp;action=edit&amp;redlink=1" class="new" title="Діскос (ще не написана)">діскос</a> з <a href="/wiki/%D0%A1%D0%BE%D1%84%D1%96%D0%B9%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D1%81%D0%BE%D0%B1%D0%BE%D1%80_(%D0%9A%D0%B8%D1%97%D0%B2)" title="Софійський собор (Київ)">собору Святої Софії</a>\n',
    eventIndex: 335,
    createdAt: "2024-01-06T17:36:32.517Z",
  },
  {
    id: "52201769-0daa-46ed-aa2e-4d9f82b6e4d4",
    time: "1483",
    events:
      '7 лютого — у Римі друком вийшла книга "Прогностична оцінка поточного 1483 року" професора Болонського університету Юрія Дрогобича - перша з відомих на сьогодні виданих книг українського і східно-європейського автора',
    eventsMarkup:
      '7 лютого&nbsp;— у <a href="/wiki/%D0%A0%D0%B8%D0%BC" title="Рим">Римі</a> друком вийшла книга <a href="/wiki/%D0%9F%D1%80%D0%BE%D0%B3%D0%BD%D0%BE%D1%81%D1%82%D0%B8%D1%87%D0%BD%D0%B0_%D0%BE%D1%86%D1%96%D0%BD%D0%BA%D0%B0_%D0%BF%D0%BE%D1%82%D0%BE%D1%87%D0%BD%D0%BE%D0%B3%D0%BE_1483_%D1%80%D0%BE%D0%BA%D1%83" title="Прогностична оцінка поточного 1483 року">"Прогностична оцінка поточного 1483 року"</a> професора <a href="/wiki/%D0%91%D0%BE%D0%BB%D0%BE%D0%BD%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D1%83%D0%BD%D1%96%D0%B2%D0%B5%D1%80%D1%81%D0%B8%D1%82%D0%B5%D1%82" title="Болонський університет">Болонського університету</a> <a href="/wiki/%D0%AE%D1%80%D1%96%D0%B9_%D0%94%D1%80%D0%BE%D0%B3%D0%BE%D0%B1%D0%B8%D1%87" title="Юрій Дрогобич">Юрія Дрогобича</a> - перша з відомих на сьогодні виданих книг українського і східно-європейського автора\n',
    eventIndex: 336,
    createdAt: "2024-01-06T17:36:32.517Z",
  },
  {
    id: "08ea73e5-6f31-4ab4-bddd-23b142f7cc12",
    time: "1484",
    events:
      "Турецька армія переходить Дунай і бере Кілію та Білгород (Аккерман). Османська імперія бере під контроль все чорноморське узбережжя",
    eventsMarkup:
      '<a href="/wiki/%D0%A2%D1%83%D1%80%D0%BA%D0%B8" title="Турки">Турецька</a> армія переходить <a href="/wiki/%D0%94%D1%83%D0%BD%D0%B0%D0%B9" title="Дунай">Дунай</a> і бере <a href="/wiki/%D0%9A%D1%96%D0%BB%D1%96%D1%8F" title="Кілія">Кілію</a> та <a href="/wiki/%D0%91%D1%96%D0%BB%D0%B3%D0%BE%D1%80%D0%BE%D0%B4-%D0%94%D0%BD%D1%96%D1%81%D1%82%D1%80%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B8%D0%B9" title="Білгород-Дністровський">Білгород</a> (<a href="/wiki/%D0%90%D0%BA%D0%BA%D0%B5%D1%80%D0%BC%D0%B0%D0%BD" class="mw-redirect" title="Аккерман">Аккерман</a>). <a href="/wiki/%D0%9E%D1%81%D0%BC%D0%B0%D0%BD%D1%81%D1%8C%D0%BA%D0%B0_%D1%96%D0%BC%D0%BF%D0%B5%D1%80%D1%96%D1%8F" title="Османська імперія">Османська імперія</a> бере під контроль все чорноморське узбережжя\n',
    eventIndex: 337,
    createdAt: "2024-01-06T17:36:32.517Z",
  },
  {
    id: "ab2a6fa0-126f-49d0-98ba-f4e41cfac3f3",
    time: "1489",
    events:
      "Перші відомі спогади про козаків у битві разом з поляками проти татар на Брацлавщині.",
    eventsMarkup:
      'Перші відомі спогади про <b><a href="/wiki/%D0%9A%D0%BE%D0%B7%D0%B0%D0%BA%D0%B8" title="Козаки">козаків</a></b> у битві разом з поляками проти татар на <a href="/wiki/%D0%91%D1%80%D0%B0%D1%86%D0%BB%D0%B0%D0%B2%D1%89%D0%B8%D0%BD%D0%B0" title="Брацлавщина">Брацлавщині</a>.\n',
    eventIndex: 338,
    createdAt: "2024-01-06T17:36:32.517Z",
  },
  {
    id: "96bcc9fe-a997-4151-a5a7-81e37f46fd51",
    time: "1490 — 1492",
    events: "На Галичині — повстання під проводом Мухи та Борулі",
    eventsMarkup: "На Галичині&nbsp;— повстання під проводом Мухи та Борулі\n",
    eventIndex: 339,
    createdAt: "2024-01-06T17:36:32.517Z",
  },
  {
    id: "27cd395a-fb03-4100-8b8d-263081dfa94e",
    time: "1492—1494",
    events: "Московсько-литовська війна (князь Іван ІІІ і князь Олександр).",
    eventsMarkup:
      '<b><a href="/wiki/%D0%9B%D0%B8%D1%82%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%BE-%D0%BC%D0%BE%D1%81%D0%BA%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%B2%D1%96%D0%B9%D0%BD%D0%B0_(1487%E2%80%941494)" title="Литовсько-московська війна (1487—1494)">Московсько-литовська війна</a></b> (князь <a href="/wiki/%D0%86%D0%B2%D0%B0%D0%BD_%D0%86%D0%86%D0%86" class="mw-redirect" title="Іван ІІІ">Іван ІІІ</a> і князь Олександр).\n',
    eventIndex: 340,
    createdAt: "2024-01-06T17:36:32.518Z",
  },
  {
    id: "3fa0fd6c-8961-4383-986c-2de6593324a7",
    time: "1493",
    events:
      "Московський князь Іван ІІІ Васильович приймає титул «Государя всієї Русі» - Не підтверджено!",
    eventsMarkup:
      'Московський князь <a href="/wiki/%D0%86%D0%B2%D0%B0%D0%BD_III_%D0%92%D0%B0%D1%81%D0%B8%D0%BB%D1%8C%D0%BE%D0%B2%D0%B8%D1%87" title="Іван III Васильович">Іван ІІІ Васильович</a> приймає титул «Государя всієї Русі» - Не підтверджено!\n',
    eventIndex: 341,
    createdAt: "2024-01-06T17:36:32.518Z",
  },
  {
    id: "5c4fecd5-a765-4540-81dd-bacbb9a32cf7",
    time: "1494",
    events:
      "5 лютого — завершення російсько-литовської війни 1492—1494 рр. Укладено «Вічний мир»: Олександр відмовився від претензій на Новгород, Твер і Псков; більша частина земель верховських князівств, володіння хлепецьких і вяземських князів відходили Івану III, який повертав Литві Любутськ, Серпейськ, Мосальськ, Опаків и відмовлявся від претензій на Смоленськ и Брянськ. Литовський великий князь Олександр одружувався на доньці Івана III Олені",
    eventsMarkup:
      '5 лютого&nbsp;— завершення російсько-литовської війни 1492—1494&nbsp;рр. Укладено «Вічний мир»: Олександр відмовився від претензій на <a href="/wiki/%D0%9D%D0%BE%D0%B2%D0%B3%D0%BE%D1%80%D0%BE%D0%B4" class="mw-redirect" title="Новгород">Новгород</a>, <a href="/wiki/%D0%A2%D0%B2%D0%B5%D1%80" title="Твер">Твер</a> і <a href="/wiki/%D0%9F%D1%81%D0%BA%D0%BE%D0%B2" title="Псков">Псков</a>; більша частина земель <a href="/wiki/%D0%92%D0%B5%D1%80%D1%85%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D1%96_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%B0" title="Верховські князівства">верховських князівств</a>, володіння хлепецьких і вяземських князів відходили Івану III, який повертав Литві Любутськ, Серпейськ, Мосальськ, Опаків и відмовлявся від претензій на <a href="/wiki/%D0%A1%D0%BC%D0%BE%D0%BB%D0%B5%D0%BD%D1%81%D1%8C%D0%BA" title="Смоленськ">Смоленськ</a> и <a href="/wiki/%D0%91%D1%80%D1%8F%D0%BD%D1%81%D1%8C%D0%BA" title="Брянськ">Брянськ</a>. Литовський великий князь Олександр одружувався на доньці Івана III Олені\n',
    eventIndex: 342,
    createdAt: "2024-01-06T17:36:32.518Z",
  },
  {
    id: "0493f331-acae-4bcc-994b-89e42d279d4c",
    time: "1497",
    events: "Луцьк отримав Магдербурзьке право",
    eventsMarkup:
      '<a href="/wiki/%D0%9B%D1%83%D1%86%D1%8C%D0%BA" title="Луцьк">Луцьк</a> отримав <a href="/wiki/%D0%9C%D0%B0%D0%B3%D0%B4%D0%B5%D0%B1%D1%83%D1%80%D0%B7%D1%8C%D0%BA%D0%B5_%D0%BF%D1%80%D0%B0%D0%B2%D0%BE" title="Магдебурзьке право">Магдербурзьке право</a>\n',
    eventIndex: 343,
    createdAt: "2024-01-06T17:36:32.518Z",
  },
  {
    id: "6463837c-aa24-43fc-bced-9261b70ce5d9",
    time: "1498",
    events: "Похід турецько-молдавського війська у Галичину проти Польщі.",
    eventsMarkup:
      "Похід турецько-молдавського війська у Галичину проти Польщі.\n",
    eventIndex: 344,
    createdAt: "2024-01-06T17:36:32.518Z",
  },
  {
    id: "4e9e91aa-4cbe-429e-92e0-f0bf583ae36c",
    time: "1500",
    events:
      "Під владу Москви від Литви перейшли князі Стародубсько-Можайський Семен Іванович і Новгород-Сіверський Василій Іванович Шемячич, що стало причиною війни між Московським і Литовським великими князівствами 1500—1503 рр. Другий похід Івана ІІІ проти литовського князя Олександра.",
    eventsMarkup:
      'Під владу Москви від Литви перейшли князі Стародубсько-Можайський Семен Іванович і Новгород-Сіверський Василій Іванович Шемячич, що стало причиною <b><a href="/wiki/%D0%9B%D0%B8%D1%82%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%BE-%D0%BC%D0%BE%D1%81%D0%BA%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%B2%D1%96%D0%B9%D0%BD%D0%B0_(1500%E2%80%941503)" title="Литовсько-московська війна (1500—1503)">війни</a> між Московським і Литовським великими князівствами 1500—1503 рр</b>. Другий похід Івана ІІІ проти литовського князя Олександра.\n',
    eventIndex: 345,
    createdAt: "2024-01-06T17:36:32.518Z",
  },
  {
    id: "cad93a76-091b-4e13-9b92-4216455e3750",
    time: "1501",
    events: "Молдова потрапляє у залежність від Османської імперії",
    eventsMarkup:
      '<a href="/wiki/%D0%9C%D0%BE%D0%BB%D0%B4%D0%BE%D0%B2%D0%B0" title="Молдова">Молдова</a> потрапляє у залежність від Османської імперії\n',
    eventIndex: 346,
    createdAt: "2024-01-06T17:36:32.518Z",
  },
  {
    id: "228482e7-961d-4e8c-881c-1f080659744e",
    time: "1502",
    events:
      "Армія союзника Москви — кримського хана Менґлі І Ґерая — у кількості 90 000 воїнів в ході російсько-литовської війни спустошила землі Правобережжя аж до Львова, Любліна і Кракова.",
    eventsMarkup:
      'Армія союзника Москви&nbsp;— кримського хана <a href="/wiki/%D0%9C%D0%B5%D0%BD%D2%91%D0%BB%D1%96_I_%D2%90%D0%B5%D1%80%D0%B0%D0%B9" title="Менґлі I Ґерай">Менґлі І Ґерая</a>&nbsp;— у кількості 90 000 воїнів в ході російсько-литовської війни спустошила землі <a href="/wiki/%D0%9F%D1%80%D0%B0%D0%B2%D0%BE%D0%B1%D0%B5%D1%80%D0%B5%D0%B6%D0%BD%D0%B0_%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D0%B0" title="Правобережна Україна">Правобережжя</a> аж до Львова, <a href="/wiki/%D0%9B%D1%8E%D0%B1%D0%BB%D1%96%D0%BD" title="Люблін">Любліна</a> і <a href="/wiki/%D0%9A%D1%80%D0%B0%D0%BA%D1%96%D0%B2" title="Краків">Кракова</a>.\n',
    eventIndex: 347,
    createdAt: "2024-01-06T17:36:32.518Z",
  },
  {
    id: "0fbeeb32-3852-42a2-8de9-5c163476dfe1",
    time: "1503",
    events:
      "Закінчення московсько-литовської війни 1500-1503 рр. Підписано перемир'я між царем московським Іваном ІІІ і Великим князем Литовським, згідно з яким Іван ІІІ отримав Чернігів, Новгород-Сіверський, Брянськ, Путивль, Гомель, частину смоленських і вітебських земель. Таким чином Велике князівство Литовське втратило близько третини території.",
    eventsMarkup:
      'Закінчення <a href="/wiki/%D0%9C%D0%BE%D1%81%D0%BA%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%BE-%D0%BB%D0%B8%D1%82%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%B2%D1%96%D0%B9%D0%BD%D0%B0_(1500%E2%80%941503)" class="mw-redirect" title="Московсько-литовська війна (1500—1503)">московсько-литовської війни 1500-1503 рр.</a> Підписано перемир\'я між царем московським Іваном ІІІ і Великим князем Литовським, згідно з яким <a href="/wiki/%D0%86%D0%B2%D0%B0%D0%BD_III_%D0%92%D0%B0%D1%81%D0%B8%D0%BB%D1%8C%D0%BE%D0%B2%D0%B8%D1%87" title="Іван III Васильович">Іван ІІІ</a> отримав <a href="/wiki/%D0%A7%D0%B5%D1%80%D0%BD%D1%96%D0%B3%D1%96%D0%B2" title="Чернігів">Чернігів</a>, <a href="/wiki/%D0%9D%D0%BE%D0%B2%D0%B3%D0%BE%D1%80%D0%BE%D0%B4-%D0%A1%D1%96%D0%B2%D0%B5%D1%80%D1%81%D1%8C%D0%BA%D0%B8%D0%B9" title="Новгород-Сіверський">Новгород-Сіверський</a>, <a href="/wiki/%D0%91%D1%80%D1%8F%D0%BD%D1%81%D1%8C%D0%BA" title="Брянськ">Брянськ</a>, <a href="/wiki/%D0%9F%D1%83%D1%82%D0%B8%D0%B2%D0%BB%D1%8C" title="Путивль">Путивль</a>, <a href="/wiki/%D0%93%D0%BE%D0%BC%D0%B5%D0%BB%D1%8C" title="Гомель">Гомель</a>, частину смоленських і вітебських земель. Таким чином <a href="/wiki/%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE_%D0%9B%D0%B8%D1%82%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B5" title="Велике князівство Литовське">Велике князівство Литовське</a> втратило близько третини території.\n',
    eventIndex: 348,
    createdAt: "2024-01-06T17:36:32.518Z",
  },
  {
    id: "30136752-c9b5-46de-9619-f5f9ab5ca808",
    time: "1505",
    events:
      "Польській король Олександр Казимирович видає Радомську конституцію. Прикріплення селян до сел.",
    eventsMarkup:
      'Польській <a href="/wiki/%D0%9A%D0%BE%D1%80%D0%BE%D0%BB%D1%8C" title="Король">король</a> <a href="/wiki/%D0%9E%D0%BB%D0%B5%D0%BA%D1%81%D0%B0%D0%BD%D0%B4%D1%80_%D0%9A%D0%B0%D0%B7%D0%B8%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B8%D1%87" class="mw-redirect" title="Олександр Казимирович">Олександр Казимирович</a> видає <a href="/wiki/%D0%A0%D0%B0%D0%B4%D0%BE%D0%BC%D1%81%D1%8C%D0%BA%D0%B0_%D0%BA%D0%BE%D0%BD%D1%81%D1%82%D0%B8%D1%82%D1%83%D1%86%D1%96%D1%8F" class="mw-redirect" title="Радомська конституція">Радомську конституцію</a>. Прикріплення селян до сел.\n',
    eventIndex: 349,
    createdAt: "2024-01-06T17:36:32.518Z",
  },
  {
    id: "9321a22e-7c04-4875-8a7d-2e56214250c8",
    time: "1507—1508",
    events:
      "Московсько-литовська війна, завершилась мирним договором: кордони залишались старі, землі Глинських залишались за Великим князівством Литовським.",
    eventsMarkup:
      '<b><a href="/wiki/%D0%9B%D0%B8%D1%82%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%BE-%D0%BC%D0%BE%D1%81%D0%BA%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%B2%D1%96%D0%B9%D0%BD%D0%B0_(1507%E2%80%941508)" title="Литовсько-московська війна (1507—1508)">Московсько-литовська війна</a></b>, завершилась мирним договором: кордони залишались старі, землі Глинських залишались за Великим князівством Литовським.\n',
    eventIndex: 350,
    createdAt: "2024-01-06T17:36:32.519Z",
  },
  {
    id: "b2c1a4a3-e66a-4cab-8f2d-29c532ef0200",
    time: "1508",
    events:
      "Виступ проти литовської влади магната Михайла Глинського з братом, їх дії на стороні московських військ і втеча до Москви. Кримськотатарський набіг на Правобережну Україну.",
    eventsMarkup:
      'Виступ проти литовської влади магната <a href="/wiki/%D0%93%D0%BB%D0%B8%D0%BD%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D0%9C%D0%B8%D1%85%D0%B0%D0%B9%D0%BB%D0%BE_%D0%9B%D1%8C%D0%B2%D0%BE%D0%B2%D0%B8%D1%87" title="Глинський Михайло Львович">Михайла Глинського</a> з братом, їх дії на стороні московських військ і втеча до Москви. Кримськотатарський набіг на Правобережну Україну.\n',
    eventIndex: 351,
    createdAt: "2024-01-06T17:36:32.519Z",
  },
  {
    id: "a24bcae8-4705-443d-950f-028667c0e767",
    time: "1509",
    events: "Кримськотатарський набіг на Правобережну Україну",
    eventsMarkup: "Кримськотатарський набіг на Правобережну Україну\n",
    eventIndex: 352,
    createdAt: "2024-01-06T17:36:32.519Z",
  },
  {
    id: "8f08c10e-b01a-4533-87c8-c6ead270d774",
    time: "1512",
    events: "Кримськотатарський набіг на Волинь",
    eventsMarkup: "Кримськотатарський набіг на Волинь\n",
    eventIndex: 353,
    createdAt: "2024-01-06T17:36:32.519Z",
  },
  {
    id: "032c3b74-eddc-4425-b5b5-f418d3d608ac",
    time: "1512—1522",
    events:
      "Московсько-литовська війна. За мирною угодою, до Москви переходили захоплені нею 1514 р. Смоленські землі (23 тис. кв.км), але від претензій на Київ, Вітебськ і Полоцьк, а також на повернення полонених Москва відмовлялась.",
    eventsMarkup:
      '<b><a href="/wiki/%D0%9B%D0%B8%D1%82%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%BE-%D0%BC%D0%BE%D1%81%D0%BA%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%B2%D1%96%D0%B9%D0%BD%D0%B0_(1512%E2%80%941522)" title="Литовсько-московська війна (1512—1522)">Московсько-литовська війна</a></b>. За мирною угодою, до Москви переходили захоплені нею 1514&nbsp;р. Смоленські землі (23 тис. кв.км), але від претензій на <a href="/wiki/%D0%9A%D0%B8%D1%97%D0%B2" title="Київ">Київ</a>, <a href="/wiki/%D0%92%D1%96%D1%82%D0%B5%D0%B1%D1%81%D1%8C%D0%BA" title="Вітебськ">Вітебськ</a> і <a href="/wiki/%D0%9F%D0%BE%D0%BB%D0%BE%D1%86%D1%8C%D0%BA" title="Полоцьк">Полоцьк</a>, а також на повернення полонених Москва відмовлялась.\n',
    eventIndex: 354,
    createdAt: "2024-01-06T17:36:32.519Z",
  },
  {
    id: "9d94c53c-a841-4a58-ae7a-8b552ff59a45",
    time: "1514",
    events:
      "В ході війни з Великим князівством Литовським Московія захоплює Смоленськ",
    eventsMarkup:
      'В ході війни з Великим князівством Литовським <a href="/wiki/%D0%9C%D0%BE%D1%81%D0%BA%D0%BE%D0%B2%D1%96%D1%8F" title="Московія">Московія</a> захоплює <a href="/wiki/%D0%A1%D0%BC%D0%BE%D0%BB%D0%B5%D0%BD%D1%81%D1%8C%D0%BA" title="Смоленськ">Смоленськ</a>\n',
    eventIndex: 355,
    createdAt: "2024-01-06T17:36:32.519Z",
  },
  {
    id: "5a10c2cc-9f5b-4204-bb0a-0b43a1dd389e",
    time: "1518",
    events: "Кримськотатарський набіг на Волинь",
    eventsMarkup:
      'Кримськотатарський набіг на <a href="/wiki/%D0%92%D0%BE%D0%BB%D0%B8%D0%BD%D1%8C" title="Волинь">Волинь</a>\n',
    eventIndex: 356,
    createdAt: "2024-01-06T17:36:32.519Z",
  },
  {
    id: "ddce9952-f6ba-480a-9a91-65ff60d9f102",
    time: "1523",
    events: "Всі володіння сіверських князів увійшли до складу Московії.",
    eventsMarkup:
      "Всі володіння сіверських князів увійшли до складу Московії.\n",
    eventIndex: 357,
    createdAt: "2024-01-06T17:36:32.519Z",
  },
  {
    id: "8f879442-6f30-4f25-98c3-df1ecebf028e",
    time: "1523",
    events: "Поход козаків на фортецю Очаків",
    eventsMarkup:
      'Поход козаків на фортецю <a href="/wiki/%D0%9E%D1%87%D0%B0%D0%BA%D1%96%D0%B2" title="Очаків">Очаків</a>\n',
    eventIndex: 358,
    createdAt: "2024-01-06T17:36:32.519Z",
  },
  {
    id: "20f590b2-d029-4ae6-9a6c-5f2722cad452",
    time: "1526",
    events:
      "Битва при Могачі: турки захопили Угорщину; у Трансильванії утворилося васальне від Османської імперії князівство Трансильванія (Семигород).",
    eventsMarkup:
      '<a href="/wiki/%D0%91%D0%B8%D1%82%D0%B2%D0%B0_%D0%BF%D1%80%D0%B8_%D0%9C%D0%BE%D0%B3%D0%B0%D1%87%D1%96" class="mw-redirect" title="Битва при Могачі">Битва при Могачі</a>: турки захопили <a href="/wiki/%D0%A3%D0%B3%D0%BE%D1%80%D1%89%D0%B8%D0%BD%D0%B0" title="Угорщина">Угорщину</a>; у <a href="/wiki/%D0%A2%D1%80%D0%B0%D0%BD%D1%81%D0%B8%D0%BB%D1%8C%D0%B2%D0%B0%D0%BD%D1%96%D1%8F" title="Трансильванія">Трансильванії</a> утворилося васальне від Османської імперії <a href="/wiki/%D0%A2%D1%80%D0%B0%D0%BD%D1%81%D0%B8%D0%BB%D1%8C%D0%B2%D0%B0%D0%BD%D1%81%D1%8C%D0%BA%D0%B5_%D0%BA%D0%BD%D1%8F%D0%B7%D1%96%D0%B2%D1%81%D1%82%D0%B2%D0%BE_(1570%E2%80%941711)" title="Трансильванське князівство (1570—1711)">князівство Трансильванія</a> (<a href="/wiki/%D0%A1%D0%B5%D0%BC%D0%B8%D0%B3%D0%BE%D1%80%D0%BE%D0%B4" class="mw-redirect" title="Семигород">Семигород</a>).\n',
    eventIndex: 359,
    createdAt: "2024-01-06T17:36:32.519Z",
  },
  {
    id: "503f0e59-0fd0-46b1-a549-dee1527ddf38",
    time: "1529",
    events: "Запровадження 1-го Литовського статуту",
    eventsMarkup: "Запровадження 1-го Литовського статуту\n",
    eventIndex: 360,
    createdAt: "2024-01-06T17:36:32.559Z",
  },
  {
    id: "96cc8e4c-2699-4816-bfc7-6c301de0bf66",
    time: "1533—1538",
    events:
      "Після смерті великого московського князя Василія ІІІ править його вдова — Олена Глинська",
    eventsMarkup:
      'Після смерті великого московського князя Василія ІІІ править його вдова&nbsp;— <a href="/wiki/%D0%9E%D0%BB%D0%B5%D0%BD%D0%B0_%D0%93%D0%BB%D0%B8%D0%BD%D1%81%D1%8C%D0%BA%D0%B0" class="mw-redirect" title="Олена Глинська">Олена Глинська</a>\n',
    eventIndex: 361,
    createdAt: "2024-01-06T17:36:32.559Z",
  },
  {
    id: "bbb26395-425c-486f-b6d5-9309a62bf02c",
    time: "1534—1537",
    events:
      "Московсько-литовська війна (Стародубська). Стародуб було знищено. За умовами миру, Велике князівство Литовське повернуло собі Гомельську волость, але спірні Себеж та Заволоччя залишились за Москвою.",
    eventsMarkup:
      '<b><a href="/wiki/%D0%9B%D0%B8%D1%82%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%BE-%D0%BC%D0%BE%D1%81%D0%BA%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%B2%D1%96%D0%B9%D0%BD%D0%B0_(1534%E2%80%941537)" title="Литовсько-московська війна (1534—1537)">Московсько-литовська війна (Стародубська)</a></b>. <a href="/wiki/%D0%A1%D1%82%D0%B0%D1%80%D0%BE%D0%B4%D1%83%D0%B1" title="Стародуб">Стародуб</a> було знищено. За умовами миру, Велике князівство Литовське повернуло собі Гомельську волость, але спірні <a href="/wiki/%D0%A1%D0%B5%D0%B1%D0%B5%D0%B6" title="Себеж">Себеж</a> та Заволоччя залишились за Москвою.\n',
    eventIndex: 362,
    createdAt: "2024-01-06T17:36:32.559Z",
  },
  {
    id: "1c9b8fcb-4cdf-40e9-b93e-38f3c5d423ad",
    time: "1538",
    events: "Перший відомий набіг козаків на чайках на Очаків.",
    eventsMarkup:
      'Перший відомий набіг козаків на чайках на <a href="/wiki/%D0%9E%D1%87%D0%B0%D0%BA%D1%96%D0%B2" title="Очаків">Очаків</a>.\n',
    eventIndex: 363,
    createdAt: "2024-01-06T17:36:32.559Z",
  },
  {
    id: "2f1d4105-a89b-4920-855f-9e73afd305ca",
    time: "1547",
    events: "Московський князь Іван IV Грозний приймає царський титул",
    eventsMarkup:
      'Московський князь <a href="/wiki/%D0%86%D0%B2%D0%B0%D0%BD_IV_%D0%93%D1%80%D0%BE%D0%B7%D0%BD%D0%B8%D0%B9" class="mw-redirect" title="Іван IV Грозний">Іван IV Грозний</a> приймає <a href="/wiki/%D0%A6%D0%B0%D1%80" title="Цар">царський</a> титул\n',
    eventIndex: 364,
    createdAt: "2024-01-06T17:36:32.559Z",
  },
  {
    id: "5e72c0ca-8cd3-4823-b42e-fe37ce72b937",
    time: "1552",
    events:
      "Іван IV Грозний здійснює 3-й похід на Казань. Казанське ханство — перша неруська держава, включена до складу Русі.",
    eventsMarkup:
      'Іван IV Грозний здійснює 3-й похід на <a href="/wiki/%D0%9A%D0%B0%D0%B7%D0%B0%D0%BD%D1%8C" title="Казань">Казань</a>. <a href="/wiki/%D0%9A%D0%B0%D0%B7%D0%B0%D0%BD%D1%81%D1%8C%D0%BA%D0%B5_%D1%85%D0%B0%D0%BD%D1%81%D1%82%D0%B2%D0%BE" title="Казанське ханство">Казанське ханство</a>&nbsp;— перша неруська держава, включена до складу Русі.\n',
    eventIndex: 365,
    createdAt: "2024-01-06T17:36:32.559Z",
  },
  {
    id: "abc80e6c-4919-47c5-8627-d834062df925",
    time: "1552—1558",
    events:
      "Дмитро Вишневецький («Байда») збудував на о. Мала Хортиця укріплення - першу Запорізьку Січ (Хортицька Січ)",
    eventsMarkup:
      '<a href="/wiki/%D0%94%D0%BC%D0%B8%D1%82%D1%80%D0%BE_%D0%92%D0%B8%D1%88%D0%BD%D0%B5%D0%B2%D0%B5%D1%86%D1%8C%D0%BA%D0%B8%D0%B9" title="Дмитро Вишневецький">Дмитро Вишневецький</a> («Байда») збудував на о. <a href="/wiki/%D0%9C%D0%B0%D0%BB%D0%B0_%D0%A5%D0%BE%D1%80%D1%82%D0%B8%D1%86%D1%8F" class="mw-redirect" title="Мала Хортиця">Мала Хортиця</a> укріплення - першу <b><a href="/wiki/%D0%97%D0%B0%D0%BF%D0%BE%D1%80%D1%96%D0%B7%D1%8C%D0%BA%D0%B0_%D0%A1%D1%96%D1%87" class="mw-redirect" title="Запорізька Січ">Запорізьку Січ</a></b> (<b><a href="/wiki/%D0%A5%D0%BE%D1%80%D1%82%D0%B8%D1%86%D1%8C%D0%BA%D0%B0_%D0%A1%D1%96%D1%87" class="mw-redirect" title="Хортицька Січ">Хортицька Січ</a></b>)\n',
    eventIndex: 366,
    createdAt: "2024-01-06T17:36:32.559Z",
  },
  {
    id: "d1f0ea7a-7258-466c-9e3f-434aeacbee98",
    time: "1557",
    events:
      "24-дення облога і безрезультатний штурм Хортицького замка кримськими загонами.",
    eventsMarkup:
      "24-дення облога і безрезультатний штурм Хортицького замка кримськими загонами.\n",
    eventIndex: 367,
    createdAt: "2024-01-06T17:36:32.559Z",
  },
  {
    id: "511ce73a-2bd8-498c-9f45-94fed8d83ab1",
    time: "1558—1583",
    events:
      "Ливонська війна (З 1562 — за участю Великого князівства Литовського): невдала спроба Москви приєднати Прибалтику.",
    eventsMarkup:
      '<a href="/wiki/%D0%9B%D0%B8%D0%B2%D0%BE%D0%BD%D1%81%D1%8C%D0%BA%D0%B0_%D0%B2%D1%96%D0%B9%D0%BD%D0%B0" class="mw-redirect" title="Ливонська війна">Ливонська війна</a> (З 1562&nbsp;— за участю Великого князівства Литовського): невдала спроба Москви приєднати Прибалтику.\n',
    eventIndex: 368,
    createdAt: "2024-01-06T17:36:32.559Z",
  },
  {
    id: "967cc30a-e0a1-4407-a1cf-65d2225c61e6",
    time: "1564",
    events: "В Польщі з'явився орден єзуїтів.",
    eventsMarkup:
      'В Польщі з\'явився орден <a href="/wiki/%D0%A2%D0%BE%D0%B2%D0%B0%D1%80%D0%B8%D1%81%D1%82%D0%B2%D0%BE_%D0%86%D1%81%D1%83%D1%81%D0%B0" title="Товариство Ісуса">єзуїтів</a>.\n',
    eventIndex: 369,
    createdAt: "2024-01-06T17:36:32.559Z",
  },
  {
    id: "a4bef581-8e46-4506-aa86-7905ca18b436",
    time: "1564—1593",
    events: "Томаківська Січ",
    eventsMarkup:
      '<b><a href="/wiki/%D0%A2%D0%BE%D0%BC%D0%B0%D0%BA%D1%96%D0%B2%D1%81%D1%8C%D0%BA%D0%B0_%D0%A1%D1%96%D1%87" title="Томаківська Січ">Томаківська Січ</a></b>\n',
    eventIndex: 370,
    createdAt: "2024-01-06T17:36:32.565Z",
  },
  {
    id: "addd3568-fcbe-4919-9507-eff998cec531",
    time: "1566",
    events: "Запровадження 2-го Литовського статуту.",
    eventsMarkup:
      'Запровадження <a href="/wiki/%D0%9B%D0%B8%D1%82%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D1%96_%D0%A1%D1%82%D0%B0%D1%82%D1%83%D1%82%D0%B8" title="Литовські Статути">2-го Литовського статуту</a>.\n',
    eventIndex: 371,
    createdAt: "2024-01-06T17:36:32.565Z",
  },
  {
    id: "e0ab82ab-672f-460c-a42d-bbf5cef57c36",
    time: "1569",
    events:
      "Люблінська унія: об'єднання Великого князівства Литовського та королівства Польського в єдину державу — Річ Посполиту. При цьому українські землі (Підляське, Брацлавське, Київське, Волинське воєводства) перейшли до польської частини держави, а за Литвою залишились білоруські. Українська шляхта отримувала ті ж права, що і польська.",
    eventsMarkup:
      '<b><a href="/wiki/%D0%9B%D1%8E%D0%B1%D0%BB%D1%96%D0%BD%D1%81%D1%8C%D0%BA%D0%B0_%D1%83%D0%BD%D1%96%D1%8F" title="Люблінська унія">Люблінська унія</a></b>: об\'єднання Великого князівства Литовського та королівства Польського в єдину державу&nbsp;— <b><a href="/wiki/%D0%A0%D1%96%D1%87_%D0%9F%D0%BE%D1%81%D0%BF%D0%BE%D0%BB%D0%B8%D1%82%D0%B0" title="Річ Посполита">Річ Посполиту</a></b>. При цьому українські землі (Підляське, Брацлавське, Київське, Волинське воєводства) перейшли до польської частини держави, а за Литвою залишились білоруські. Українська <a href="/wiki/%D0%A8%D0%BB%D1%8F%D1%85%D1%82%D0%B0" title="Шляхта">шляхта</a> отримувала ті ж права, що і польська.\n',
    eventIndex: 372,
    createdAt: "2024-01-06T17:36:32.565Z",
  },
  {
    id: "490c20ec-e2b0-41af-9534-a0ff90a25b7c",
    time: "1570",
    events:
      "Іван Грозний відправив грамоту донським козакам (цей день вважається Днем заснування донського козацтва)",
    eventsMarkup:
      '<a href="/wiki/%D0%86%D0%B2%D0%B0%D0%BD_IV_%D0%93%D1%80%D0%BE%D0%B7%D0%BD%D0%B8%D0%B9" class="mw-redirect" title="Іван IV Грозний">Іван Грозний</a> відправив грамоту донським козакам (цей день вважається Днем заснування <a href="/wiki/%D0%94%D0%BE%D0%BD%D1%81%D1%8C%D0%BA%D1%96_%D0%BA%D0%BE%D0%B7%D0%B0%D0%BA%D0%B8" title="Донські козаки">донського козацтва</a>)\n',
    eventIndex: 373,
    createdAt: "2024-01-06T17:36:32.565Z",
  },
  {
    id: "f6b36a30-9aec-452c-b30d-b0a1e006aaac",
    time: "1571",
    events:
      "Кримські татари востаннє спалили Москву. Цар Іван IV втік зі своєї столиці.",
    eventsMarkup:
      '<a href="/wiki/%D0%9A%D1%80%D0%B8%D0%BC%D1%81%D1%8C%D0%BA%D1%96_%D1%82%D0%B0%D1%82%D0%B0%D1%80%D0%B8" title="Кримські татари">Кримські татари</a> востаннє спалили Москву. Цар <a href="/wiki/%D0%86%D0%B2%D0%B0%D0%BD_IV" class="mw-redirect mw-disambig" title="Іван IV">Іван IV</a> втік зі своєї столиці.\n',
    eventIndex: 374,
    createdAt: "2024-01-06T17:36:32.565Z",
  },
  {
    id: "f2a2decc-90bb-4275-a7cc-89959dc75217",
    time: "1572",
    events:
      "Виникнення реєстрового козацтва — король Сигізмунд II Август санкціонував створення загону у кількості 300 козаків на чолі з шляхтичем Бадовським. Незабаром загін було розформовано.",
    eventsMarkup:
      'Виникнення реєстрового козацтва&nbsp;— король <a href="/wiki/%D0%A1%D0%B8%D0%B3%D1%96%D0%B7%D0%BC%D1%83%D0%BD%D0%B4_II_%D0%90%D0%B2%D0%B3%D1%83%D1%81%D1%82" title="Сигізмунд II Август">Сигізмунд II Август</a> санкціонував створення загону у кількості 300 козаків на чолі з шляхтичем Бадовським. Незабаром загін було розформовано.\n',
    eventIndex: 375,
    createdAt: "2024-01-06T17:36:32.565Z",
  },
  {
    id: "9cd6617b-4f1f-4449-a1ce-723bed4ec72f",
    time: "1573",
    events: "Заснування Іваном Федоровим типографії у Львові.",
    eventsMarkup:
      'Заснування <a href="/wiki/%D0%86%D0%B2%D0%B0%D0%BD_%D0%A4%D0%B5%D0%B4%D0%BE%D1%80%D0%BE%D0%B2" title="Іван Федоров">Іваном Федоровим</a> типографії у <a href="/wiki/%D0%9B%D1%8C%D0%B2%D1%96%D0%B2" title="Львів">Львові</a>.\n',
    eventIndex: 376,
    createdAt: "2024-01-06T17:36:32.565Z",
  },
  {
    id: "2d99040f-b1e4-443d-88b7-49125ddabd07",
    time: "1574",
    events:
      "Надрукування Іваном Федоров[ич]ем у львівській типографії перших двох книг — «Апостол» і «Буквар».\n\nСмерть останнього короля з династії Ягеллонів; шляхта отримує право обирати монарха і укладати з ним договір з визначенням прерогатив.",
    eventsMarkup:
      'Надрукування <a href="/wiki/%D0%86%D0%B2%D0%B0%D0%BD_%D0%A4%D0%B5%D0%B4%D0%BE%D1%80%D0%BE%D0%B2" title="Іван Федоров">Іваном Федоров[ич]ем</a> у львівській типографії перших двох книг&nbsp;— <a href="/wiki/%D0%90%D0%BF%D0%BE%D1%81%D1%82%D0%BE%D0%BB_(%D0%BA%D0%BD%D0%B8%D0%B3%D0%B0)" title="Апостол (книга)">«Апостол»</a> і <a href="/w/index.php?title=%D0%91%D1%83%D0%BA%D0%B2%D0%B0%D1%80_(%D0%A4%D0%B5%D0%B4%D0%BE%D1%80%D0%BE%D0%B2)&amp;action=edit&amp;redlink=1" class="new" title="Буквар (Федоров) (ще не написана)">«Буквар»</a>.\n<p>Смерть останнього короля з династії Ягеллонів; шляхта отримує право обирати монарха і укладати з ним договір з визначенням прерогатив.\n</p>\n',
    eventIndex: 377,
    createdAt: "2024-01-06T17:36:32.565Z",
  },
  {
    id: "70ae0000-7dea-4810-89e5-48f2c7c514ba",
    time: "1576",
    events:
      "Заснування Острозької греко-слов'яно-латинської школи (існувала до 1636 р.) і типографії (існувала до 1612 р.)",
    eventsMarkup:
      'Заснування <b><a href="/wiki/%D0%9D%D0%B0%D1%86%D1%96%D0%BE%D0%BD%D0%B0%D0%BB%D1%8C%D0%BD%D0%B8%D0%B9_%D1%83%D0%BD%D1%96%D0%B2%D0%B5%D1%80%D1%81%D0%B8%D1%82%D0%B5%D1%82_%C2%AB%D0%9E%D1%81%D1%82%D1%80%D0%BE%D0%B7%D1%8C%D0%BA%D0%B0_%D0%B0%D0%BA%D0%B0%D0%B4%D0%B5%D0%BC%D1%96%D1%8F%C2%BB" title="Національний університет «Острозька академія»">Острозької греко-слов\'яно-латинської школи</a></b> (існувала до 1636&nbsp;р.) і типографії (існувала до 1612&nbsp;р.)\n',
    eventIndex: 378,
    createdAt: "2024-01-06T17:36:32.565Z",
  },
  {
    id: "4b6ff60c-1ed4-4b5f-8672-c9e366260bab",
    time: "1576—1586",
    events: "Король Речі Посполитої Стефан Баторій",
    eventsMarkup:
      'Король Речі Посполитої <b><a href="/wiki/%D0%A1%D1%82%D0%B5%D1%84%D0%B0%D0%BD_%D0%91%D0%B0%D1%82%D0%BE%D1%80%D1%96%D0%B9" title="Стефан Баторій">Стефан Баторій</a></b>\n',
    eventIndex: 379,
    createdAt: "2024-01-06T17:36:32.565Z",
  },
  {
    id: "12a69933-5a7e-4e8b-bab4-0bedade5e27e",
    time: "1577",
    events:
      "В Острозі за сприяння князя Костянтина Острозького стала до ладу друкарня на чолі з Іваном Федоровим",
    eventsMarkup:
      'В Острозі за сприяння князя <a href="/wiki/%D0%9E%D1%81%D1%82%D1%80%D0%BE%D0%B7%D1%8C%D0%BA%D0%B8%D0%B9_%D0%9A%D0%BE%D1%81%D1%82%D1%8F%D0%BD%D1%82%D0%B8%D0%BD_%D0%86%D0%B2%D0%B0%D0%BD%D0%BE%D0%B2%D0%B8%D1%87" title="Острозький Костянтин Іванович">Костянтина Острозького</a> стала до ладу <a href="/wiki/%D0%9E%D1%81%D1%82%D1%80%D0%BE%D0%B7%D1%8C%D0%BA%D0%B0_%D0%B4%D1%80%D1%83%D0%BA%D0%B0%D1%80%D0%BD%D1%8F" title="Острозька друкарня">друкарня</a> на чолі з <a href="/wiki/%D0%86%D0%B2%D0%B0%D0%BD_%D0%A4%D0%B5%D0%B4%D0%BE%D1%80%D0%BE%D0%B2" title="Іван Федоров">Іваном Федоровим</a>\n',
    eventIndex: 380,
    createdAt: "2024-01-06T17:36:32.568Z",
  },
  {
    id: "c6c3d7a1-b21c-4dd3-8682-1f3bafd5b5eb",
    time: "1578",
    events:
      "Виникнення козацького реєстру: король Стефан Баторій встановив платню 600 козакам і дозволив розташувати їм в м. Трахтемирові свій арсенал і шпиталь. Керували козаками офіцери-дворяни.",
    eventsMarkup:
      '<b>Виникнення козацького реєстру</b>: король <a href="/wiki/%D0%A1%D1%82%D0%B5%D1%84%D0%B0%D0%BD_%D0%91%D0%B0%D1%82%D0%BE%D1%80%D1%96%D0%B9" title="Стефан Баторій">Стефан Баторій</a> встановив платню 600 козакам і дозволив розташувати їм в м.&nbsp;<a href="/wiki/%D0%A2%D1%80%D0%B0%D1%85%D1%82%D0%B5%D0%BC%D0%B8%D1%80%D1%96%D0%B2" title="Трахтемирів">Трахтемирові</a> свій <a href="/wiki/%D0%90%D1%80%D1%81%D0%B5%D0%BD%D0%B0%D0%BB" title="Арсенал">арсенал</a> і шпиталь. Керували козаками офіцери-дворяни.\n',
    eventIndex: 381,
    createdAt: "2024-01-06T17:36:32.568Z",
  },
  {
    id: "693aad27-1c45-4296-8aa6-74eb93e2d73a",
    time: "1580-1581",
    events: "Іван Федоров видає Біблію в Острозькій типографії",
    eventsMarkup:
      '<a href="/wiki/%D0%86%D0%B2%D0%B0%D0%BD_%D0%A4%D0%B5%D0%B4%D0%BE%D1%80%D0%BE%D0%B2" title="Іван Федоров">Іван Федоров</a> видає <a href="/wiki/%D0%9E%D1%81%D1%82%D1%80%D0%BE%D0%B7%D1%8C%D0%BA%D0%B0_%D0%91%D1%96%D0%B1%D0%BB%D1%96%D1%8F" title="Острозька Біблія">Біблію</a> в <a href="/wiki/%D0%9E%D1%81%D1%82%D1%80%D0%BE%D0%B3" title="Острог">Острозькій</a> типографії\n',
    eventIndex: 382,
    createdAt: "2024-01-06T17:36:32.568Z",
  },
  {
    id: "16ec8428-c0be-499e-98bc-9f71ee222ff3",
    time: "1583",
    events:
      "Взяття козаками Білгорода (Аккермана). Польській король Стефан Баторій для задоволення османського султана наказав стратити 31 козака — учасника штурму.",
    eventsMarkup:
      'Взяття козаками Білгорода (<a href="/wiki/%D0%90%D0%BA%D0%BA%D0%B5%D1%80%D0%BC%D0%B0%D0%BD" class="mw-redirect" title="Аккерман">Аккермана</a>). Польській король <a href="/wiki/%D0%A1%D1%82%D0%B5%D1%84%D0%B0%D0%BD_%D0%91%D0%B0%D1%82%D0%BE%D1%80%D1%96%D0%B9" title="Стефан Баторій">Стефан Баторій</a> для задоволення османського султана наказав стратити 31 козака&nbsp;— учасника штурму.\n',
    eventIndex: 383,
    createdAt: "2024-01-06T17:36:32.568Z",
  },
  {
    id: "6ce21bf1-9cec-4aa2-82e1-1f8a73135062",
    time: "1585",
    events: "у Львові засновано «Ставропігійське братство».",
    eventsMarkup:
      'у <a href="/wiki/%D0%9B%D1%8C%D0%B2%D1%96%D0%B2" title="Львів">Львові</a> засновано <a href="/wiki/%D0%A1%D1%82%D0%B0%D0%B2%D1%80%D0%BE%D0%BF%D1%96%D0%B3%D1%96%D0%B9%D1%81%D1%8C%D0%BA%D0%B5_%D0%B1%D1%80%D0%B0%D1%82%D1%81%D1%82%D0%B2%D0%BE" class="mw-redirect" title="Ставропігійське братство">«Ставропігійське братство»</a>.\n',
    eventIndex: 384,
    createdAt: "2024-01-06T17:36:32.568Z",
  },
  {
    id: "47311718-54f5-4c2c-9b83-7bc7791bffa0",
    time: "1588",
    events:
      "3-й Литовський статут. Закріпачення селян Брацлавщини і Придніпров'я.",
    eventsMarkup:
      '<a href="/wiki/%D0%9B%D0%B8%D1%82%D0%BE%D0%B2%D1%81%D1%8C%D0%BA%D1%96_%D0%A1%D1%82%D0%B0%D1%82%D1%83%D1%82%D0%B8" title="Литовські Статути">3-й Литовський статут</a>. Закріпачення селян <a href="/wiki/%D0%91%D1%80%D0%B0%D1%86%D0%BB%D0%B0%D0%B2%D1%89%D0%B8%D0%BD%D0%B0" title="Брацлавщина">Брацлавщини</a> і Придніпров\'я.\n',
    eventIndex: 385,
    createdAt: "2024-01-06T17:36:32.568Z",
  },
  {
    id: "548d24a8-a317-4d84-8d0d-ef67aedd19e9",
    time: "1589",
    events: "Реєстр козаків визначено у 3 000.",
    eventsMarkup: "Реєстр козаків визначено у 3 000.\n",
    eventIndex: 386,
    createdAt: "2024-01-06T17:36:32.568Z",
  },
  {
    id: "b276ef9a-4827-4a3c-bd35-414c275ca76f",
    time: "1589—1590",
    events: "Повстання у Білій Церкві.",
    eventsMarkup: "Повстання у Білій Церкві.\n",
    eventIndex: 387,
    createdAt: "2024-01-06T17:36:32.568Z",
  },
  {
    id: "7a21a1dc-7a2d-4b71-9803-93d02495518c",
    time: "1591—1593",
    events: "Козацьке повстання на чолі з гетьманом Криштофом Косинським.",
    eventsMarkup:
      'Козацьке повстання на чолі з гетьманом <a href="/wiki/%D0%9A%D1%80%D0%B8%D1%88%D1%82%D0%BE%D1%84_%D0%9A%D0%BE%D1%81%D0%B8%D0%BD%D1%81%D1%8C%D0%BA%D0%B8%D0%B9" title="Криштоф Косинський">Криштофом Косинським</a>.\n',
    eventIndex: 388,
    createdAt: "2024-01-06T17:36:32.568Z",
  },
  {
    id: "7a7ce36c-ab25-4056-b1f2-7c5d4eec9d6d",
    time: "1593—1594",
    events:
      "Козацька армія найманців в кількості 12 000 воює в Молдові, внаслідок чого молдовський господар на деякий час визнав себе васалом Габсбургів.",
    eventsMarkup:
      'Козацька армія найманців в кількості 12 000 воює в Молдові, внаслідок чого молдовський господар на деякий час визнав себе васалом <a href="/wiki/%D0%93%D0%B0%D0%B1%D1%81%D0%B1%D1%83%D1%80%D0%B3%D0%B8" title="Габсбурги">Габсбургів</a>.\n',
    eventIndex: 389,
    createdAt: "2024-01-06T17:36:32.568Z",
  },
  {
    id: "faaade57-e8fe-4356-8aa0-e684cb4c2e1f",
    time: "1593—1630",
    events: "Базавлуцька Січ",
    eventsMarkup:
      '<b><a href="/wiki/%D0%91%D0%B0%D0%B7%D0%B0%D0%B2%D0%BB%D1%83%D1%86%D1%8C%D0%BA%D0%B0_%D0%A1%D1%96%D1%87" title="Базавлуцька Січ">Базавлуцька Січ</a></b>\n',
    eventIndex: 390,
    createdAt: "2024-01-06T17:36:32.585Z",
  },
  {
    id: "967fdd7a-1756-41d5-8ecb-15a70663cc6d",
    time: "1594—1595",
    events: "Антипольське повстання у Брацлаві.",
    eventsMarkup:
      'Антипольське повстання у <a href="/wiki/%D0%91%D1%80%D0%B0%D1%86%D0%BB%D0%B0%D0%B2" title="Брацлав">Брацлаві</a>.\n',
    eventIndex: 391,
    createdAt: "2024-01-06T17:36:32.585Z",
  },
  {
    id: "8a86ff1c-e6f1-48b1-82d4-25e801621c3d",
    time: "1594—1596",
    events:
      "Повстання в Україні і Білорусі під проводом С.Наливайка і Г.Лободи.",
    eventsMarkup:
      '<b>Повстання в Україні і Білорусі під проводом <a href="/wiki/%D0%A1%D0%B5%D0%B2%D0%B5%D1%80%D0%B8%D0%BD_%D0%9D%D0%B0%D0%BB%D0%B8%D0%B2%D0%B0%D0%B9%D0%BA%D0%BE" title="Северин Наливайко">С.Наливайка</a> і <a href="/wiki/%D0%93%D1%80%D0%B8%D0%B3%D0%BE%D1%80%D1%96%D0%B9_%D0%9B%D0%BE%D0%B1%D0%BE%D0%B4%D0%B0" title="Григорій Лобода">Г.Лободи</a></b>.\n',
    eventIndex: 392,
    createdAt: "2024-01-06T17:36:32.585Z",
  },
  {
    id: "50f9b5b8-c78c-4a92-b1fc-559a6a932888",
    time: "1596",
    events: "Берестейська унія. Створення Греко-Католицької церкви.",
    eventsMarkup:
      '<b><a href="/wiki/%D0%91%D0%B5%D1%80%D0%B5%D1%81%D1%82%D0%B5%D0%B9%D1%81%D1%8C%D0%BA%D0%B0_%D1%83%D0%BD%D1%96%D1%8F" title="Берестейська унія">Берестейська унія</a>. Створення <a href="/wiki/%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D1%81%D1%8C%D0%BA%D0%B0_%D0%B3%D1%80%D0%B5%D0%BA%D0%BE-%D0%BA%D0%B0%D1%82%D0%BE%D0%BB%D0%B8%D1%86%D1%8C%D0%BA%D0%B0_%D1%86%D0%B5%D1%80%D0%BA%D0%B2%D0%B0" title="Українська греко-католицька церква">Греко-Католицької церкви</a></b><a href="/wiki/%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D1%81%D1%8C%D0%BA%D0%B0_%D0%B3%D1%80%D0%B5%D0%BA%D0%BE-%D0%BA%D0%B0%D1%82%D0%BE%D0%BB%D0%B8%D1%86%D1%8C%D0%BA%D0%B0_%D1%86%D0%B5%D1%80%D0%BA%D0%B2%D0%B0" title="Українська греко-католицька церква">.</a>\n',
    eventIndex: 393,
    createdAt: "2024-01-06T17:36:32.585Z",
  },
];
